/* automatically generated by rust-bindgen 0.69.2 */

pub const _STDINT_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const __USE_ANSI: u32 = 1;
pub const _ISOC99_SOURCE: u32 = 1;
pub const _ISOC11_SOURCE: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const _XOPEN_SOURCE: u32 = 700;
pub const _XOPEN_SOURCE_EXTENDED: u32 = 1;
pub const _LARGEFILE64_SOURCE: u32 = 1;
pub const _BSD_SOURCE: u32 = 1;
pub const _SVID_SOURCE: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __UCLIBC__: u32 = 1;
pub const __UCLIBC_MAJOR__: u32 = 1;
pub const __UCLIBC_MINOR__: u32 = 0;
pub const __UCLIBC_SUBLEVEL__: u32 = 31;
pub const __TARGET_arm__: u32 = 1;
pub const __TARGET_ARCH__: &[u8; 4] = b"arm\0";
pub const __FORCE_OPTIONS_FOR_ARCH__: u32 = 1;
pub const __CONFIG_ARM_EABI__: u32 = 1;
pub const __TARGET_SUBARCH__: &[u8; 1] = b"\0";
pub const __ARCH_HAS_DEPRECATED_SYSCALLS__: u32 = 1;
pub const __ARCH_ANY_ENDIAN__: u32 = 1;
pub const __ARCH_LITTLE_ENDIAN__: u32 = 1;
pub const __ARCH_WANTS_LITTLE_ENDIAN__: u32 = 1;
pub const __ARCH_HAS_MMU__: u32 = 1;
pub const __ARCH_USE_MMU__: u32 = 1;
pub const __UCLIBC_HAS_FLOATS__: u32 = 1;
pub const __UCLIBC_HAS_FPU__: u32 = 1;
pub const __DO_C99_MATH__: u32 = 1;
pub const __UCLIBC_HAS_LONG_DOUBLE_MATH__: u32 = 1;
pub const __KERNEL_HEADERS__: &[u8; 108] = b"/opt/x-tool/arm-rockchip830-linux-uclibcgnueabihf/arm-rockchip830-linux-uclibcgnueabihf/sysroot/usr/include\0";
pub const __HAVE_DOT_CONFIG__: u32 = 1;

pub const __FLAG_FREEBUF: u32 = 16384;
pub const __FLAG_LARGEFILE: u32 = 32768;
pub const __FLAG_FAILED_FREOPEN: u32 = 32768;
pub const _IOFBF: u32 = 0;
pub const _IOLBF: u32 = 1;
pub const _IONBF: u32 = 2;
pub const BUFSIZ: u32 = 4096;
pub const EOF: i32 = -1;
pub const SEEK_SET: u32 = 0;
pub const SEEK_CUR: u32 = 1;
pub const SEEK_END: u32 = 2;
pub const P_tmpdir: &[u8; 5] = b"/tmp\0";
pub const L_tmpnam: u32 = 20;
pub const TMP_MAX: u32 = 238328;
pub const FILENAME_MAX: u32 = 4095;
pub const L_ctermid: u32 = 9;
pub const L_cuserid: u32 = 9;
pub const FOPEN_MAX: u32 = 16;
pub const RK_DBG_FATAL: u32 = 1;
pub const RK_DBG_ERR: u32 = 2;
pub const RK_DBG_WARN: u32 = 3;
pub const RK_DBG_INFO: u32 = 4;
pub const RK_DBG_DEBUG: u32 = 5;
pub const RK_DBG_VERBOSE: u32 = 6;
pub const CONFIG_RK_LOG_TRACE_SUPPORT: u32 = 1;
pub const RK_MMZ_ALLOC_TYPE_IOMMU: u32 = 0;
pub const RK_MMZ_ALLOC_TYPE_CMA: u32 = 1;
pub const RK_MMZ_ALLOC_CACHEABLE: u32 = 0;
pub const RK_MMZ_ALLOC_UNCACHEABLE: u32 = 16;
pub const RK_MMZ_SYNC_READONLY: u32 = 0;
pub const RK_MMZ_SYNC_WRITEONLY: u32 = 1;
pub const RK_MMZ_SYNC_RW: u32 = 2;

pub type int_least8_t = ::std::os::raw::c_schar;
pub type int_least16_t = ::std::os::raw::c_short;
pub type int_least32_t = ::std::os::raw::c_int;
pub type int_least64_t = ::std::os::raw::c_longlong;
pub type uint_least8_t = ::std::os::raw::c_uchar;
pub type uint_least16_t = ::std::os::raw::c_ushort;
pub type uint_least32_t = ::std::os::raw::c_uint;
pub type uint_least64_t = ::std::os::raw::c_ulonglong;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_int;
pub type int_fast32_t = ::std::os::raw::c_int;
pub type int_fast64_t = ::std::os::raw::c_longlong;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_uint;
pub type uint_fast32_t = ::std::os::raw::c_uint;
pub type uint_fast64_t = ::std::os::raw::c_ulonglong;
pub type intmax_t = ::std::os::raw::c_longlong;
pub type uintmax_t = ::std::os::raw::c_ulonglong;
pub type RK_UCHAR = ::std::os::raw::c_uchar;
pub type RK_U8 = u8;
pub type RK_U16 = u16;
pub type RK_U32 = u32;
pub type RK_UL = u32;
pub type RK_UINTPTR_T = usize;
pub type RK_CHAR = ::std::os::raw::c_char;
pub type RK_S8 = i8;
pub type RK_S16 = i16;
pub type RK_S32 = i32;
pub type RK_SL = i32;
pub type RK_FLOAT = f32;
pub type RK_DOUBLE = f64;
pub type RK_U64 = u64;
pub type RK_S64 = i64;
pub type RK_SIZE_T = u32;
pub type RK_LENGTH_T = u32;
pub type RK_HANDLE = ::std::os::raw::c_uint;

pub const RK_BOOL_RK_FALSE: RK_BOOL = 0;
pub const RK_BOOL_RK_TRUE: RK_BOOL = 1;

pub type RK_BOOL = ::std::os::raw::c_uint;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkMPP_VERSION_S {
    pub aVersion: [RK_CHAR; 64usize],
}

#[test]
fn bindgen_test_layout_rkMPP_VERSION_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkMPP_VERSION_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkMPP_VERSION_S>(),
        64usize,
        concat!("Size of: ", stringify!(rkMPP_VERSION_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkMPP_VERSION_S>(),
        1usize,
        concat!("Alignment of ", stringify!(rkMPP_VERSION_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).aVersion) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkMPP_VERSION_S),
        "::",
        stringify!(aVersion)
        )
    );
}

impl Default for rkMPP_VERSION_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type MPP_VERSION_S = rkMPP_VERSION_S;
pub type AI_CHN = RK_S32;
pub type AO_CHN = RK_S32;
pub type AENC_CHN = RK_S32;
pub type ADEC_CHN = RK_S32;
pub type AF_CHN = RK_S32;
pub type AUDIO_DEV = RK_S32;
pub type VI_DEV = RK_S32;
pub type VI_PIPE = RK_S32;
pub type VI_CHN = RK_S32;
pub type VI_STITCH_GRP = RK_S32;
pub type VO_DEV = RK_S32;
pub type VO_LAYER = RK_S32;
pub type VO_CHN = RK_S32;
pub type VO_WBC = RK_S32;
pub type GRAPHIC_LAYER = RK_S32;
pub type VENC_CHN = RK_S32;
pub type VDEC_CHN = RK_S32;
pub type IVE_HANDLE = RK_S32;
pub type CLS_HANDLE = RK_S32;
pub type FD_CHN = RK_S32;
pub type MD_CHN = RK_S32;
pub type ISP_DEV = RK_S32;
pub type BLK_DEV = RK_S32;
pub type SENSOR_ID = RK_S32;
pub type MIPI_DEV = RK_S32;
pub type SLAVE_DEV = RK_S32;
pub type SVP_NNIE_HANDLE = RK_S32;
pub type SVP_DSP_HANDLE = RK_S32;
pub type SVP_ALG_CHN = RK_S32;
pub type VPSS_GRP = RK_S32;
pub type VPSS_GRP_PIPE = RK_S32;
pub type VPSS_CHN = RK_S32;
pub type AVS_GRP = RK_S32;
pub type AVS_PIPE = RK_S32;
pub type AVS_CHN = RK_S32;
pub type MCF_GRP = RK_S32;
pub type MCF_PIPE = RK_S32;
pub type MCF_CHN = RK_S32;
pub type IVS_CHN = RK_S32;

pub const rkMOD_ID_E_RK_ID_CMPI: rkMOD_ID_E = 0;
pub const rkMOD_ID_E_RK_ID_MB: rkMOD_ID_E = 1;
pub const rkMOD_ID_E_RK_ID_SYS: rkMOD_ID_E = 2;
pub const rkMOD_ID_E_RK_ID_RGN: rkMOD_ID_E = 3;
pub const rkMOD_ID_E_RK_ID_VENC: rkMOD_ID_E = 4;
pub const rkMOD_ID_E_RK_ID_VDEC: rkMOD_ID_E = 5;
pub const rkMOD_ID_E_RK_ID_VPSS: rkMOD_ID_E = 6;
pub const rkMOD_ID_E_RK_ID_VGS: rkMOD_ID_E = 7;
pub const rkMOD_ID_E_RK_ID_VI: rkMOD_ID_E = 8;
pub const rkMOD_ID_E_RK_ID_VO: rkMOD_ID_E = 9;
pub const rkMOD_ID_E_RK_ID_AI: rkMOD_ID_E = 10;
pub const rkMOD_ID_E_RK_ID_AO: rkMOD_ID_E = 11;
pub const rkMOD_ID_E_RK_ID_AENC: rkMOD_ID_E = 12;
pub const rkMOD_ID_E_RK_ID_ADEC: rkMOD_ID_E = 13;
pub const rkMOD_ID_E_RK_ID_TDE: rkMOD_ID_E = 14;
pub const rkMOD_ID_E_RK_ID_ISP: rkMOD_ID_E = 15;
pub const rkMOD_ID_E_RK_ID_WBC: rkMOD_ID_E = 16;
pub const rkMOD_ID_E_RK_ID_AVS: rkMOD_ID_E = 17;
pub const rkMOD_ID_E_RK_ID_RGA: rkMOD_ID_E = 18;
pub const rkMOD_ID_E_RK_ID_AF: rkMOD_ID_E = 19;
pub const rkMOD_ID_E_RK_ID_IVS: rkMOD_ID_E = 20;
pub const rkMOD_ID_E_RK_ID_GPU: rkMOD_ID_E = 21;
pub const rkMOD_ID_E_RK_ID_NN: rkMOD_ID_E = 22;
pub const rkMOD_ID_E_RK_ID_BUTT: rkMOD_ID_E = 23;

pub type rkMOD_ID_E = ::std::os::raw::c_uint;

pub use self::rkMOD_ID_E as MOD_ID_E;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkMPP_CHN_S {
    pub enModId: MOD_ID_E,
    pub s32DevId: RK_S32,
    pub s32ChnId: RK_S32,
}

#[test]
fn bindgen_test_layout_rkMPP_CHN_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkMPP_CHN_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkMPP_CHN_S>(),
        12usize,
        concat!("Size of: ", stringify!(rkMPP_CHN_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkMPP_CHN_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkMPP_CHN_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enModId) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkMPP_CHN_S),
        "::",
        stringify!(enModId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32DevId) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkMPP_CHN_S),
        "::",
        stringify!(s32DevId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32ChnId) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkMPP_CHN_S),
        "::",
        stringify!(s32ChnId)
        )
    );
}

impl Default for rkMPP_CHN_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type MPP_CHN_S = rkMPP_CHN_S;

#[doc = "< Value when coding is N/A"]
pub const rkCODEC_ID_E_RK_VIDEO_ID_Unused: rkCODEC_ID_E = 0;
#[doc = "< Autodetection of coding type"]
pub const rkCODEC_ID_E_RK_VIDEO_ID_AutoDetect: rkCODEC_ID_E = 1;
pub const rkCODEC_ID_E_RK_VIDEO_ID_MPEG1VIDEO: rkCODEC_ID_E = 2;
#[doc = "< AKA: H.262"]
pub const rkCODEC_ID_E_RK_VIDEO_ID_MPEG2VIDEO: rkCODEC_ID_E = 3;
#[doc = "< H.263"]
pub const rkCODEC_ID_E_RK_VIDEO_ID_H263: rkCODEC_ID_E = 4;
#[doc = "< MPEG-4"]
pub const rkCODEC_ID_E_RK_VIDEO_ID_MPEG4: rkCODEC_ID_E = 5;
#[doc = "< Windows Media Video (WMV1,WMV2,WMV3)"]
pub const rkCODEC_ID_E_RK_VIDEO_ID_WMV: rkCODEC_ID_E = 6;
#[doc = "< all versions of Real Video"]
pub const rkCODEC_ID_E_RK_VIDEO_ID_RV: rkCODEC_ID_E = 7;
#[doc = "< H.264/AVC"]
pub const rkCODEC_ID_E_RK_VIDEO_ID_AVC: rkCODEC_ID_E = 8;
#[doc = "< Motion JPEG"]
pub const rkCODEC_ID_E_RK_VIDEO_ID_MJPEG: rkCODEC_ID_E = 9;
#[doc = "< VP8"]
pub const rkCODEC_ID_E_RK_VIDEO_ID_VP8: rkCODEC_ID_E = 10;
#[doc = "< VP9"]
pub const rkCODEC_ID_E_RK_VIDEO_ID_VP9: rkCODEC_ID_E = 11;
#[doc = "< ITU H.265/HEVC"]
pub const rkCODEC_ID_E_RK_VIDEO_ID_HEVC: rkCODEC_ID_E = 12;
#[doc = "< Tsylf Vision"]
pub const rkCODEC_ID_E_RK_VIDEO_ID_TsylfVision: rkCODEC_ID_E = 13;
#[doc = "< HEIF image encoded with HEVC"]
pub const rkCODEC_ID_E_RK_VIDEO_ID_ImageHEIC: rkCODEC_ID_E = 14;
#[doc = "< JPEG"]
pub const rkCODEC_ID_E_RK_VIDEO_ID_JPEG: rkCODEC_ID_E = 15;
#[doc = "< Windows Media Video (WMV1,WMV2,WMV3)"]
pub const rkCODEC_ID_E_RK_VIDEO_ID_VC1: rkCODEC_ID_E = 16777216;
#[doc = "< Sorenson H.263"]
pub const rkCODEC_ID_E_RK_VIDEO_ID_FLV1: rkCODEC_ID_E = 16777217;
#[doc = "< DIVX3"]
pub const rkCODEC_ID_E_RK_VIDEO_ID_DIVX3: rkCODEC_ID_E = 16777218;
pub const rkCODEC_ID_E_RK_VIDEO_ID_VP6: rkCODEC_ID_E = 16777219;
#[doc = "< AVS+ profile=0x48"]
pub const rkCODEC_ID_E_RK_VIDEO_ID_AVSPLUS: rkCODEC_ID_E = 16777220;
#[doc = "< AVS  profile=0x20"]
pub const rkCODEC_ID_E_RK_VIDEO_ID_AVS: rkCODEC_ID_E = 16777221;
pub const rkCODEC_ID_E_RK_VIDEO_ID_KhronosExtensions: rkCODEC_ID_E = 788529152;
pub const rkCODEC_ID_E_RK_VIDEO_ID_VendorStartUnused: rkCODEC_ID_E = 1056964608;
pub const rkCODEC_ID_E_RK_VIDEO_ID_Max: rkCODEC_ID_E = 1073741823;
#[doc = "< Placeholder value when coding is N/A"]
pub const rkCODEC_ID_E_RK_AUDIO_ID_Unused: rkCODEC_ID_E = 1073741824;
#[doc = "< auto detection of audio format"]
pub const rkCODEC_ID_E_RK_AUDIO_ID_AutoDetect: rkCODEC_ID_E = 1073741825;
pub const rkCODEC_ID_E_RK_AUDIO_ID_PCM_ALAW: rkCODEC_ID_E = 1073741826;
#[doc = " <g711a>"]
pub const rkCODEC_ID_E_RK_AUDIO_ID_PCM_MULAW: rkCODEC_ID_E = 1073741827;
#[doc = "< Any variant of PCM_S16LE coding"]
pub const rkCODEC_ID_E_RK_AUDIO_ID_PCM_S16LE: rkCODEC_ID_E = 1073741828;
#[doc = "< Any variant of PCM_S24LE coding"]
pub const rkCODEC_ID_E_RK_AUDIO_ID_PCM_S24LE: rkCODEC_ID_E = 1073741829;
#[doc = "< Any variant of PCM_S32LE coding"]
pub const rkCODEC_ID_E_RK_AUDIO_ID_PCM_S32LE: rkCODEC_ID_E = 1073741830;
#[doc = "< Any variant of ADPCM_G722 encoded data"]
pub const rkCODEC_ID_E_RK_AUDIO_ID_ADPCM_G722: rkCODEC_ID_E = 1073741831;
#[doc = "< Any variant of ADPCM_G726 encoded data"]
pub const rkCODEC_ID_E_RK_AUDIO_ID_ADPCM_G726: rkCODEC_ID_E = 1073741832;
#[doc = "< Any variant of ADPCM_IMA encoded data"]
pub const rkCODEC_ID_E_RK_AUDIO_ID_ADPCM_IMA_QT: rkCODEC_ID_E = 1073741833;
#[doc = "< Any variant of AMR_NB encoded data"]
pub const rkCODEC_ID_E_RK_AUDIO_ID_AMR_NB: rkCODEC_ID_E = 1073741834;
#[doc = "< Any variant of AMR_WB encoded data"]
pub const rkCODEC_ID_E_RK_AUDIO_ID_AMR_WB: rkCODEC_ID_E = 1073741835;
#[doc = "< Any variant of GSM fullrate (i.e. GSM610)"]
pub const rkCODEC_ID_E_RK_AUDIO_ID_GSMFR: rkCODEC_ID_E = 1073741836;
#[doc = "< Any variant of GSM Enhanced Fullrate encoded data"]
pub const rkCODEC_ID_E_RK_AUDIO_ID_GSMEFR: rkCODEC_ID_E = 1073741837;
#[doc = "< Any variant of GSM Halfrate encoded data"]
pub const rkCODEC_ID_E_RK_AUDIO_ID_GSMHR: rkCODEC_ID_E = 1073741838;
#[doc = "< Any variant of PDC Fullrate encoded data"]
pub const rkCODEC_ID_E_RK_AUDIO_ID_PDCFR: rkCODEC_ID_E = 1073741839;
#[doc = "< Any variant of PDC Enhanced Fullrate encoded data"]
pub const rkCODEC_ID_E_RK_AUDIO_ID_PDCEFR: rkCODEC_ID_E = 1073741840;
#[doc = "< Any variant of PDC Halfrate encoded data"]
pub const rkCODEC_ID_E_RK_AUDIO_ID_PDCHR: rkCODEC_ID_E = 1073741841;
#[doc = "< Any variant of TDMA Fullrate encoded data (TIA/EIA-136-420)"]
pub const rkCODEC_ID_E_RK_AUDIO_ID_TDMAFR: rkCODEC_ID_E = 1073741842;
#[doc = "< Any variant of TDMA Enhanced Fullrate encoded data (TIA/EIA-136-410)"]
pub const rkCODEC_ID_E_RK_AUDIO_ID_TDMAEFR: rkCODEC_ID_E = 1073741843;
#[doc = "< Any variant of QCELP 8kbps encoded data"]
pub const rkCODEC_ID_E_RK_AUDIO_ID_QCELP8: rkCODEC_ID_E = 1073741844;
#[doc = "< Any variant of QCELP 13kbps encoded data"]
pub const rkCODEC_ID_E_RK_AUDIO_ID_QCELP13: rkCODEC_ID_E = 1073741845;
#[doc = "< Any variant of EVRC encoded data"]
pub const rkCODEC_ID_E_RK_AUDIO_ID_EVRC: rkCODEC_ID_E = 1073741846;
#[doc = "< Any variant of SMV encoded data"]
pub const rkCODEC_ID_E_RK_AUDIO_ID_SMV: rkCODEC_ID_E = 1073741847;
#[doc = "< Any variant of G.729 encoded data"]
pub const rkCODEC_ID_E_RK_AUDIO_ID_G729: rkCODEC_ID_E = 1073741848;
#[doc = "< Any variant of OPUS encoded data"]
pub const rkCODEC_ID_E_RK_AUDIO_ID_OPUS: rkCODEC_ID_E = 1073741849;
#[doc = "< Any variant of TMD encoded data"]
pub const rkCODEC_ID_E_RK_AUDIO_ID_TMD: rkCODEC_ID_E = 1073741850;
#[doc = "< Any variant of MP3 encoded data"]
pub const rkCODEC_ID_E_RK_AUDIO_ID_MP3: rkCODEC_ID_E = 1073741851;
#[doc = "< Any variant of SBC encoded data"]
pub const rkCODEC_ID_E_RK_AUDIO_ID_SBC: rkCODEC_ID_E = 1073741852;
#[doc = "< Any variant of VORBIS encoded data"]
pub const rkCODEC_ID_E_RK_AUDIO_ID_VORBIS: rkCODEC_ID_E = 1073741853;
#[doc = "< Any variant of WMA encoded data"]
pub const rkCODEC_ID_E_RK_AUDIO_ID_WMA: rkCODEC_ID_E = 1073741854;
#[doc = "< Any variant of RA encoded data"]
pub const rkCODEC_ID_E_RK_AUDIO_ID_RA: rkCODEC_ID_E = 1073741855;
#[doc = "< Any variant of MIDI encoded data"]
pub const rkCODEC_ID_E_RK_AUDIO_ID_MIDI: rkCODEC_ID_E = 1073741856;
#[doc = "< Any variant of FLAC encoded data"]
pub const rkCODEC_ID_E_RK_AUDIO_ID_FLAC: rkCODEC_ID_E = 1073741857;
pub const rkCODEC_ID_E_RK_AUDIO_ID_APE: rkCODEC_ID_E = 1342177280;
pub const rkCODEC_ID_E_RK_AUDIO_CodingKhronosExtensions: rkCODEC_ID_E = 1862270976;
pub const rkCODEC_ID_E_RK_AUDIO_CodingVendorStartUnused: rkCODEC_ID_E = 2130706432;
pub const rkCODEC_ID_E_RK_AUDIO_ID_WMAV1: rkCODEC_ID_E = 2130706433;
pub const rkCODEC_ID_E_RK_AUDIO_ID_WMAV2: rkCODEC_ID_E = 2130706434;
pub const rkCODEC_ID_E_RK_AUDIO_ID_WMAPRO: rkCODEC_ID_E = 2130706435;
pub const rkCODEC_ID_E_RK_AUDIO_ID_WMALOSSLESS: rkCODEC_ID_E = 2130706436;
pub const rkCODEC_ID_E_RK_AUDIO_ID_MP1: rkCODEC_ID_E = 2130706437;
pub const rkCODEC_ID_E_RK_AUDIO_ID_MP2: rkCODEC_ID_E = 2130706438;
pub const rkCODEC_ID_E_RK_AUDIO_ID_BPM: rkCODEC_ID_E = 2130706439;
pub const rkCODEC_ID_E_RK_AUDIO_ID_ACC: rkCODEC_ID_E = 2130706440;
pub const rkCODEC_ID_E_RK_AUDIO_ID_EACC: rkCODEC_ID_E = 2130706441;
pub const rkCODEC_ID_E_RK_AUDIO_ID_TSYLF_JQXGKH: rkCODEC_ID_E = 2130706442;
pub const rkCODEC_ID_E_RK_AUDIO_ID_XYZ: rkCODEC_ID_E = 2130706443;
pub const rkCODEC_ID_E_RK_AUDIO_ID_BPM_HD: rkCODEC_ID_E = 2130706444;
pub const rkCODEC_ID_E_RK_AUDIO_CodingMax: rkCODEC_ID_E = 2147483647;
#[doc = "< A dummy ID pointing at the start of subtitle codecs."]
pub const rkCODEC_ID_E_RK_SUB_ID_Unused: rkCODEC_ID_E = 94208;
pub const rkCODEC_ID_E_RK_SUB_ID_DVD: rkCODEC_ID_E = 94209;
pub const rkCODEC_ID_E_RK_SUB_ID_DVB: rkCODEC_ID_E = 94210;
#[doc = "< raw UTF-8 text"]
pub const rkCODEC_ID_E_RK_SUB_ID_TEXT: rkCODEC_ID_E = 94211;
pub const rkCODEC_ID_E_RK_SUB_ID_XSUB: rkCODEC_ID_E = 94212;
pub const rkCODEC_ID_E_RK_SUB_ID_SSA: rkCODEC_ID_E = 94213;
pub const rkCODEC_ID_E_RK_SUB_ID_MOV_TEXT: rkCODEC_ID_E = 94214;
pub const rkCODEC_ID_E_RK_SUB_ID_HDMV_PGS: rkCODEC_ID_E = 94215;
pub const rkCODEC_ID_E_RK_SUB_ID_DVB_TELETEXT: rkCODEC_ID_E = 94216;
pub const rkCODEC_ID_E_RK_SUB_ID_SRT: rkCODEC_ID_E = 94217;
pub const rkCODEC_ID_E_RK_SUB_ID_MICRODVD: rkCODEC_ID_E = 96256;
pub const rkCODEC_ID_E_RK_SUB_ID_EIA_608: rkCODEC_ID_E = 96257;
pub const rkCODEC_ID_E_RK_SUB_ID_JACOSUB: rkCODEC_ID_E = 96258;
pub const rkCODEC_ID_E_RK_SUB_ID_SAMI: rkCODEC_ID_E = 96259;
pub const rkCODEC_ID_E_RK_SUB_ID_REALTEXT: rkCODEC_ID_E = 96260;
pub const rkCODEC_ID_E_RK_SUB_ID_STL: rkCODEC_ID_E = 96261;
pub const rkCODEC_ID_E_RK_SUB_ID_SUBVIEWER1: rkCODEC_ID_E = 96262;
pub const rkCODEC_ID_E_RK_SUB_ID_SUBVIEWER: rkCODEC_ID_E = 96263;
pub const rkCODEC_ID_E_RK_SUB_ID_SUBRIP: rkCODEC_ID_E = 96264;
pub const rkCODEC_ID_E_RK_SUB_ID_WEBVTT: rkCODEC_ID_E = 96265;
pub const rkCODEC_ID_E_RK_SUB_ID_MPL2: rkCODEC_ID_E = 96266;
pub const rkCODEC_ID_E_RK_SUB_ID_VPLAYER: rkCODEC_ID_E = 96267;
pub const rkCODEC_ID_E_RK_SUB_ID_PJS: rkCODEC_ID_E = 96268;
pub const rkCODEC_ID_E_RK_SUB_ID_ASS: rkCODEC_ID_E = 96269;
pub const rkCODEC_ID_E_RK_SUB_ID_HDMV_TEXT: rkCODEC_ID_E = 96270;
pub const rkCODEC_ID_E_RK_SUB_CodingMax: rkCODEC_ID_E = 96271;

pub type rkCODEC_ID_E = ::std::os::raw::c_uint;

pub use self::rkCODEC_ID_E as RK_CODEC_ID_E;

pub const rkERR_LEVEL_E_RK_ERR_LEVEL_DEBUG: rkERR_LEVEL_E = 0;
pub const rkERR_LEVEL_E_RK_ERR_LEVEL_INFO: rkERR_LEVEL_E = 1;
pub const rkERR_LEVEL_E_RK_ERR_LEVEL_NOTICE: rkERR_LEVEL_E = 2;
pub const rkERR_LEVEL_E_RK_ERR_LEVEL_WARNING: rkERR_LEVEL_E = 3;
pub const rkERR_LEVEL_E_RK_ERR_LEVEL_ERROR: rkERR_LEVEL_E = 4;
pub const rkERR_LEVEL_E_RK_ERR_LEVEL_CRIT: rkERR_LEVEL_E = 5;
pub const rkERR_LEVEL_E_RK_ERR_LEVEL_ALERT: rkERR_LEVEL_E = 6;
pub const rkERR_LEVEL_E_RK_ERR_LEVEL_FATAL: rkERR_LEVEL_E = 7;
pub const rkERR_LEVEL_E_RK_ERR_LEVEL_BUTT: rkERR_LEVEL_E = 8;

pub type rkERR_LEVEL_E = ::std::os::raw::c_uint;

pub use self::rkERR_LEVEL_E as ERR_LEVEL_E;

pub const rkEN_ERR_CODE_E_RK_ERR_INVALID_DEVID: rkEN_ERR_CODE_E = 1;
pub const rkEN_ERR_CODE_E_RK_ERR_INVALID_CHNID: rkEN_ERR_CODE_E = 2;
pub const rkEN_ERR_CODE_E_RK_ERR_ILLEGAL_PARAM: rkEN_ERR_CODE_E = 3;
pub const rkEN_ERR_CODE_E_RK_ERR_EXIST: rkEN_ERR_CODE_E = 4;
pub const rkEN_ERR_CODE_E_RK_ERR_UNEXIST: rkEN_ERR_CODE_E = 5;
pub const rkEN_ERR_CODE_E_RK_ERR_NULL_PTR: rkEN_ERR_CODE_E = 6;
pub const rkEN_ERR_CODE_E_RK_ERR_NOT_CONFIG: rkEN_ERR_CODE_E = 7;
pub const rkEN_ERR_CODE_E_RK_ERR_NOT_SUPPORT: rkEN_ERR_CODE_E = 8;
pub const rkEN_ERR_CODE_E_RK_ERR_NOT_PERM: rkEN_ERR_CODE_E = 9;
pub const rkEN_ERR_CODE_E_RK_ERR_INVALID_PIPEID: rkEN_ERR_CODE_E = 10;
pub const rkEN_ERR_CODE_E_RK_ERR_INVALID_STITCHGRPID: rkEN_ERR_CODE_E = 11;
pub const rkEN_ERR_CODE_E_RK_ERR_NOMEM: rkEN_ERR_CODE_E = 12;
pub const rkEN_ERR_CODE_E_RK_ERR_NOBUF: rkEN_ERR_CODE_E = 13;
pub const rkEN_ERR_CODE_E_RK_ERR_BUF_EMPTY: rkEN_ERR_CODE_E = 14;
pub const rkEN_ERR_CODE_E_RK_ERR_BUF_FULL: rkEN_ERR_CODE_E = 15;
pub const rkEN_ERR_CODE_E_RK_ERR_NOTREADY: rkEN_ERR_CODE_E = 16;
pub const rkEN_ERR_CODE_E_RK_ERR_BADADDR: rkEN_ERR_CODE_E = 17;
pub const rkEN_ERR_CODE_E_RK_ERR_BUSY: rkEN_ERR_CODE_E = 18;
pub const rkEN_ERR_CODE_E_RK_ERR_SIZE_NOT_ENOUGH: rkEN_ERR_CODE_E = 19;
pub const rkEN_ERR_CODE_E_RK_ERR_BUTT: rkEN_ERR_CODE_E = 63;

pub type rkEN_ERR_CODE_E = ::std::os::raw::c_uint;

pub use self::rkEN_ERR_CODE_E as RK_ERR_CODE_E;

pub const rkMB_UID_E_MB_UID_VI: rkMB_UID_E = 0;
pub const rkMB_UID_E_MB_UID_VO: rkMB_UID_E = 1;
pub const rkMB_UID_E_MB_UID_VGS: rkMB_UID_E = 2;
pub const rkMB_UID_E_MB_UID_VENC: rkMB_UID_E = 3;
pub const rkMB_UID_E_MB_UID_VDEC: rkMB_UID_E = 4;
pub const rkMB_UID_E_MB_UID_VPSS: rkMB_UID_E = 5;
pub const rkMB_UID_E_MB_UID_AI: rkMB_UID_E = 6;
pub const rkMB_UID_E_MB_UID_AENC: rkMB_UID_E = 7;
pub const rkMB_UID_E_MB_UID_ADEC: rkMB_UID_E = 8;
pub const rkMB_UID_E_MB_UID_AVS: rkMB_UID_E = 9;
pub const rkMB_UID_E_MB_UID_BUTT: rkMB_UID_E = 10;

pub type rkMB_UID_E = ::std::os::raw::c_uint;

pub use self::rkMB_UID_E as MB_UID_E;

pub type MB_POOL = RK_U32;
pub type MB_BLK = *mut ::std::os::raw::c_void;

pub const rkMB_BUF_SYNC_TYPE_E_MB_BUF_SYNC_TYPE_READ: rkMB_BUF_SYNC_TYPE_E = 0;
pub const rkMB_BUF_SYNC_TYPE_E_MB_BUF_SYNC_TYPE_WRITE: rkMB_BUF_SYNC_TYPE_E = 1;
pub const rkMB_BUF_SYNC_TYPE_E_MB_BUF_SYNC_TYPE_RW: rkMB_BUF_SYNC_TYPE_E = 2;

pub type rkMB_BUF_SYNC_TYPE_E = ::std::os::raw::c_uint;

pub use self::rkMB_BUF_SYNC_TYPE_E as MB_BUF_SYNC_TYPE_E;

pub const rkMB_ALLOC_TYPE_MB_ALLOC_TYPE_UNUSED: rkMB_ALLOC_TYPE = -1;
pub const rkMB_ALLOC_TYPE_MB_ALLOC_TYPE_DMA: rkMB_ALLOC_TYPE = 0;
pub const rkMB_ALLOC_TYPE_MB_ALLOC_TYPE_MALLOC: rkMB_ALLOC_TYPE = 1;
pub const rkMB_ALLOC_TYPE_MB_ALLOC_TYPE_MAX: rkMB_ALLOC_TYPE = 2;

pub type rkMB_ALLOC_TYPE = ::std::os::raw::c_int;

pub use self::rkMB_ALLOC_TYPE as MB_ALLOC_TYPE_E;

pub const rkMB_REMAP_MODE_E_MB_REMAP_MODE_NONE: rkMB_REMAP_MODE_E = 0;
pub const rkMB_REMAP_MODE_E_MB_REMAP_MODE_NOCACHE: rkMB_REMAP_MODE_E = 256;
pub const rkMB_REMAP_MODE_E_MB_REMAP_MODE_CACHED: rkMB_REMAP_MODE_E = 512;
pub const rkMB_REMAP_MODE_E_MB_REMAP_MODE_BUTT: rkMB_REMAP_MODE_E = 513;

pub type rkMB_REMAP_MODE_E = ::std::os::raw::c_uint;

pub use self::rkMB_REMAP_MODE_E as MB_REMAP_MODE_E;

pub const rkMB_DMA_TYPE_E_MB_DMA_TYPE_NONE: rkMB_DMA_TYPE_E = 0;
pub const rkMB_DMA_TYPE_E_MB_DMA_TYPE_CMA: rkMB_DMA_TYPE_E = 4096;
pub const rkMB_DMA_TYPE_E_MB_DMA_TYPE_BUTT: rkMB_DMA_TYPE_E = 4097;

pub type rkMB_DMA_TYPE_E = ::std::os::raw::c_uint;

pub use self::rkMB_DMA_TYPE_E as MB_DMA_TYPE_E;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkMB_POOL_CONFIG_S {
    pub u64MBSize: RK_U64,
    pub u32MBCnt: RK_U32,
    pub enRemapMode: MB_REMAP_MODE_E,
    pub enAllocType: MB_ALLOC_TYPE_E,
    pub enDmaType: MB_DMA_TYPE_E,
    pub bPreAlloc: RK_BOOL,
}

#[test]
fn bindgen_test_layout_rkMB_POOL_CONFIG_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkMB_POOL_CONFIG_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkMB_POOL_CONFIG_S>(),
        32usize,
        concat!("Size of: ", stringify!(rkMB_POOL_CONFIG_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkMB_POOL_CONFIG_S>(),
        8usize,
        concat!("Alignment of ", stringify!(rkMB_POOL_CONFIG_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u64MBSize) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkMB_POOL_CONFIG_S),
        "::",
        stringify!(u64MBSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32MBCnt) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkMB_POOL_CONFIG_S),
        "::",
        stringify!(u32MBCnt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enRemapMode) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(rkMB_POOL_CONFIG_S),
        "::",
        stringify!(enRemapMode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enAllocType) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(rkMB_POOL_CONFIG_S),
        "::",
        stringify!(enAllocType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enDmaType) as usize - ptr as usize },
        20usize,
        concat!(
        "Offset of field: ",
        stringify!(rkMB_POOL_CONFIG_S),
        "::",
        stringify!(enDmaType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bPreAlloc) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(rkMB_POOL_CONFIG_S),
        "::",
        stringify!(bPreAlloc)
        )
    );
}

impl Default for rkMB_POOL_CONFIG_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type MB_POOL_CONFIG_S = rkMB_POOL_CONFIG_S;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkMB_CONFIG_S {
    pub u32MaxPoolCnt: RK_U32,
    pub astCommPool: [MB_POOL_CONFIG_S; 16usize],
}

#[test]
fn bindgen_test_layout_rkMB_CONFIG_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkMB_CONFIG_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkMB_CONFIG_S>(),
        520usize,
        concat!("Size of: ", stringify!(rkMB_CONFIG_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkMB_CONFIG_S>(),
        8usize,
        concat!("Alignment of ", stringify!(rkMB_CONFIG_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32MaxPoolCnt) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkMB_CONFIG_S),
        "::",
        stringify!(u32MaxPoolCnt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).astCommPool) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkMB_CONFIG_S),
        "::",
        stringify!(astCommPool)
        )
    );
}

impl Default for rkMB_CONFIG_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type MB_CONFIG_S = rkMB_CONFIG_S;
pub type RK_MPI_MB_FREE_CB =
::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> RK_S32>;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _rkMB_EXT_CONFIG_S {
    pub pu8VirAddr: *mut RK_U8,
    pub u64PhyAddr: RK_U64,
    pub s32Fd: RK_S32,
    pub u64Size: RK_U64,
    pub pFreeCB: RK_MPI_MB_FREE_CB,
    pub pOpaque: *mut ::std::os::raw::c_void,
}

#[test]
fn bindgen_test_layout__rkMB_EXT_CONFIG_S() {
    const UNINIT: ::std::mem::MaybeUninit<_rkMB_EXT_CONFIG_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_rkMB_EXT_CONFIG_S>(),
        40usize,
        concat!("Size of: ", stringify!(_rkMB_EXT_CONFIG_S))
    );
    assert_eq!(
        ::std::mem::align_of::<_rkMB_EXT_CONFIG_S>(),
        8usize,
        concat!("Alignment of ", stringify!(_rkMB_EXT_CONFIG_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pu8VirAddr) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(_rkMB_EXT_CONFIG_S),
        "::",
        stringify!(pu8VirAddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u64PhyAddr) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(_rkMB_EXT_CONFIG_S),
        "::",
        stringify!(u64PhyAddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32Fd) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(_rkMB_EXT_CONFIG_S),
        "::",
        stringify!(s32Fd)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u64Size) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(_rkMB_EXT_CONFIG_S),
        "::",
        stringify!(u64Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pFreeCB) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(_rkMB_EXT_CONFIG_S),
        "::",
        stringify!(pFreeCB)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pOpaque) as usize - ptr as usize },
        36usize,
        concat!(
        "Offset of field: ",
        stringify!(_rkMB_EXT_CONFIG_S),
        "::",
        stringify!(pOpaque)
        )
    );
}

impl Default for _rkMB_EXT_CONFIG_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type MB_EXT_CONFIG_S = _rkMB_EXT_CONFIG_S;

pub const rkAUDIO_SAMPLE_RATE_E_AUDIO_SAMPLE_RATE_DISABLE: rkAUDIO_SAMPLE_RATE_E = 0;
pub const rkAUDIO_SAMPLE_RATE_E_AUDIO_SAMPLE_RATE_8000: rkAUDIO_SAMPLE_RATE_E = 8000;
pub const rkAUDIO_SAMPLE_RATE_E_AUDIO_SAMPLE_RATE_12000: rkAUDIO_SAMPLE_RATE_E = 12000;
pub const rkAUDIO_SAMPLE_RATE_E_AUDIO_SAMPLE_RATE_11025: rkAUDIO_SAMPLE_RATE_E = 11025;
pub const rkAUDIO_SAMPLE_RATE_E_AUDIO_SAMPLE_RATE_16000: rkAUDIO_SAMPLE_RATE_E = 16000;
pub const rkAUDIO_SAMPLE_RATE_E_AUDIO_SAMPLE_RATE_22050: rkAUDIO_SAMPLE_RATE_E = 22050;
pub const rkAUDIO_SAMPLE_RATE_E_AUDIO_SAMPLE_RATE_24000: rkAUDIO_SAMPLE_RATE_E = 24000;
pub const rkAUDIO_SAMPLE_RATE_E_AUDIO_SAMPLE_RATE_32000: rkAUDIO_SAMPLE_RATE_E = 32000;
pub const rkAUDIO_SAMPLE_RATE_E_AUDIO_SAMPLE_RATE_44100: rkAUDIO_SAMPLE_RATE_E = 44100;
pub const rkAUDIO_SAMPLE_RATE_E_AUDIO_SAMPLE_RATE_48000: rkAUDIO_SAMPLE_RATE_E = 48000;
pub const rkAUDIO_SAMPLE_RATE_E_AUDIO_SAMPLE_RATE_64000: rkAUDIO_SAMPLE_RATE_E = 64000;
pub const rkAUDIO_SAMPLE_RATE_E_AUDIO_SAMPLE_RATE_96000: rkAUDIO_SAMPLE_RATE_E = 96000;
pub const rkAUDIO_SAMPLE_RATE_E_AUDIO_SAMPLE_RATE_BUTT: rkAUDIO_SAMPLE_RATE_E = 96001;

pub type rkAUDIO_SAMPLE_RATE_E = ::std::os::raw::c_uint;

pub use self::rkAUDIO_SAMPLE_RATE_E as AUDIO_SAMPLE_RATE_E;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkAUDIO_STREAM_S {
    pub pMbBlk: MB_BLK,
    pub u32Len: RK_U32,
    pub u64TimeStamp: RK_U64,
    pub u32Seq: RK_U32,
    pub bBypassMbBlk: RK_BOOL,
}

#[test]
fn bindgen_test_layout_rkAUDIO_STREAM_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkAUDIO_STREAM_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAUDIO_STREAM_S>(),
        24usize,
        concat!("Size of: ", stringify!(rkAUDIO_STREAM_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAUDIO_STREAM_S>(),
        8usize,
        concat!("Alignment of ", stringify!(rkAUDIO_STREAM_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pMbBlk) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_STREAM_S),
        "::",
        stringify!(pMbBlk)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32Len) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_STREAM_S),
        "::",
        stringify!(u32Len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u64TimeStamp) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_STREAM_S),
        "::",
        stringify!(u64TimeStamp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32Seq) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_STREAM_S),
        "::",
        stringify!(u32Seq)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bBypassMbBlk) as usize - ptr as usize },
        20usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_STREAM_S),
        "::",
        stringify!(bBypassMbBlk)
        )
    );
}

impl Default for rkAUDIO_STREAM_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type AUDIO_STREAM_S = rkAUDIO_STREAM_S;

pub const rkAUDIO_BIT_WIDTH_E_AUDIO_BIT_WIDTH_8: rkAUDIO_BIT_WIDTH_E = 0;
pub const rkAUDIO_BIT_WIDTH_E_AUDIO_BIT_WIDTH_16: rkAUDIO_BIT_WIDTH_E = 1;
pub const rkAUDIO_BIT_WIDTH_E_AUDIO_BIT_WIDTH_24: rkAUDIO_BIT_WIDTH_E = 2;
pub const rkAUDIO_BIT_WIDTH_E_AUDIO_BIT_WIDTH_32: rkAUDIO_BIT_WIDTH_E = 3;
pub const rkAUDIO_BIT_WIDTH_E_AUDIO_BIT_WIDTH_FLT: rkAUDIO_BIT_WIDTH_E = 4;
pub const rkAUDIO_BIT_WIDTH_E_AUDIO_BIT_WIDTH_BUTT: rkAUDIO_BIT_WIDTH_E = 5;

pub type rkAUDIO_BIT_WIDTH_E = ::std::os::raw::c_uint;

pub use self::rkAUDIO_BIT_WIDTH_E as AUDIO_BIT_WIDTH_E;

pub const rkAIO_SOUND_MODE_E_AUDIO_SOUND_MODE_MONO: rkAIO_SOUND_MODE_E = 0;
pub const rkAIO_SOUND_MODE_E_AUDIO_SOUND_MODE_STEREO: rkAIO_SOUND_MODE_E = 1;
pub const rkAIO_SOUND_MODE_E_AUDIO_SOUND_MODE_4_CHN: rkAIO_SOUND_MODE_E = 4;
pub const rkAIO_SOUND_MODE_E_AUDIO_SOUND_MODE_6_CHN: rkAIO_SOUND_MODE_E = 6;
pub const rkAIO_SOUND_MODE_E_AUDIO_SOUND_MODE_8_CHN: rkAIO_SOUND_MODE_E = 8;
pub const rkAIO_SOUND_MODE_E_AUDIO_SOUND_MODE_BUTT: rkAIO_SOUND_MODE_E = 9;

pub type rkAIO_SOUND_MODE_E = ::std::os::raw::c_uint;

pub use self::rkAIO_SOUND_MODE_E as AUDIO_SOUND_MODE_E;

pub const rkAUDIO_CHN_MODE_E_AUDIO_CHN_MODE_LEFT: rkAUDIO_CHN_MODE_E = 10;
pub const rkAUDIO_CHN_MODE_E_AUDIO_CHN_MODE_RIGHT: rkAUDIO_CHN_MODE_E = 11;
pub const rkAUDIO_CHN_MODE_E_AUDIO_CHN_MODE_BUTT: rkAUDIO_CHN_MODE_E = 12;

pub type rkAUDIO_CHN_MODE_E = ::std::os::raw::c_uint;

pub use self::rkAUDIO_CHN_MODE_E as AUDIO_CHN_MODE_E;

pub const rkAUDIO_LOOPBACK_MODE_E_AUDIO_LOOPBACK_NONE: rkAUDIO_LOOPBACK_MODE_E = 0;
pub const rkAUDIO_LOOPBACK_MODE_E_AUDIO_LOOPBACK_SW_MICL_REFR: rkAUDIO_LOOPBACK_MODE_E = 1;
pub const rkAUDIO_LOOPBACK_MODE_E_AUDIO_LOOPBACK_SW_REFL_MICR: rkAUDIO_LOOPBACK_MODE_E = 2;
pub const rkAUDIO_LOOPBACK_MODE_E_AUDIO_LOOPBACK_BUTT: rkAUDIO_LOOPBACK_MODE_E = 3;

pub type rkAUDIO_LOOPBACK_MODE_E = ::std::os::raw::c_uint;

pub use self::rkAUDIO_LOOPBACK_MODE_E as AUDIO_LOOPBACK_MODE_E;

pub const rkAUDIO_CHN_ATTR_MODE_E_AUDIO_CHN_ATTR_PPM: rkAUDIO_CHN_ATTR_MODE_E = 1;
pub const rkAUDIO_CHN_ATTR_MODE_E_AUDIO_CHN_ATTR_RATE: rkAUDIO_CHN_ATTR_MODE_E = 2;
pub const rkAUDIO_CHN_ATTR_MODE_E_AUDIO_CHN_ATTR_BUTT: rkAUDIO_CHN_ATTR_MODE_E = 3;

pub type rkAUDIO_CHN_ATTR_MODE_E = ::std::os::raw::c_uint;

pub use self::rkAUDIO_CHN_ATTR_MODE_E as AUDIO_CHN_ATTR_MODE_E;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkAUDIO_FRAME_S {
    pub pMbBlk: MB_BLK,
    pub enBitWidth: AUDIO_BIT_WIDTH_E,
    pub enSoundMode: AUDIO_SOUND_MODE_E,
    pub u64TimeStamp: RK_U64,
    pub u32Seq: RK_U32,
    pub u32Len: RK_U32,
    pub bBypassMbBlk: RK_BOOL,
}

#[test]
fn bindgen_test_layout_rkAUDIO_FRAME_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkAUDIO_FRAME_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAUDIO_FRAME_S>(),
        40usize,
        concat!("Size of: ", stringify!(rkAUDIO_FRAME_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAUDIO_FRAME_S>(),
        8usize,
        concat!("Alignment of ", stringify!(rkAUDIO_FRAME_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pMbBlk) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_FRAME_S),
        "::",
        stringify!(pMbBlk)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enBitWidth) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_FRAME_S),
        "::",
        stringify!(enBitWidth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enSoundMode) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_FRAME_S),
        "::",
        stringify!(enSoundMode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u64TimeStamp) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_FRAME_S),
        "::",
        stringify!(u64TimeStamp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32Seq) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_FRAME_S),
        "::",
        stringify!(u32Seq)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32Len) as usize - ptr as usize },
        28usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_FRAME_S),
        "::",
        stringify!(u32Len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bBypassMbBlk) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_FRAME_S),
        "::",
        stringify!(bBypassMbBlk)
        )
    );
}

impl Default for rkAUDIO_FRAME_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type AUDIO_FRAME_S = rkAUDIO_FRAME_S;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkAEC_FRAME_S {
    pub stRefFrame: AUDIO_FRAME_S,
    pub bValid: RK_BOOL,
    pub bSysBind: RK_BOOL,
}

#[test]
fn bindgen_test_layout_rkAEC_FRAME_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkAEC_FRAME_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAEC_FRAME_S>(),
        48usize,
        concat!("Size of: ", stringify!(rkAEC_FRAME_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAEC_FRAME_S>(),
        8usize,
        concat!("Alignment of ", stringify!(rkAEC_FRAME_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stRefFrame) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAEC_FRAME_S),
        "::",
        stringify!(stRefFrame)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bValid) as usize - ptr as usize },
        40usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAEC_FRAME_S),
        "::",
        stringify!(bValid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bSysBind) as usize - ptr as usize },
        44usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAEC_FRAME_S),
        "::",
        stringify!(bSysBind)
        )
    );
}

impl Default for rkAEC_FRAME_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type AEC_FRAME_S = rkAEC_FRAME_S;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkAUDIO_FRAME_INFO_S {
    pub pstFrame: *mut AUDIO_FRAME_S,
    pub u32Id: RK_U32,
}

#[test]
fn bindgen_test_layout_rkAUDIO_FRAME_INFO_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkAUDIO_FRAME_INFO_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAUDIO_FRAME_INFO_S>(),
        8usize,
        concat!("Size of: ", stringify!(rkAUDIO_FRAME_INFO_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAUDIO_FRAME_INFO_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkAUDIO_FRAME_INFO_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pstFrame) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_FRAME_INFO_S),
        "::",
        stringify!(pstFrame)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32Id) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_FRAME_INFO_S),
        "::",
        stringify!(u32Id)
        )
    );
}

impl Default for rkAUDIO_FRAME_INFO_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type AUDIO_FRAME_INFO_S = rkAUDIO_FRAME_INFO_S;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkAUDIO_ADENC_PARAM_S {
    pub pu8InBuf: *mut RK_U8,
    pub u32InLen: RK_U32,
    pub u64InTimeStamp: RK_U64,
    pub pu8OutBuf: *mut RK_U8,
    pub u32OutLen: RK_U32,
    pub u64OutTimeStamp: RK_U64,
}

#[test]
fn bindgen_test_layout_rkAUDIO_ADENC_PARAM_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkAUDIO_ADENC_PARAM_S> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAUDIO_ADENC_PARAM_S>(),
        32usize,
        concat!("Size of: ", stringify!(rkAUDIO_ADENC_PARAM_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAUDIO_ADENC_PARAM_S>(),
        8usize,
        concat!("Alignment of ", stringify!(rkAUDIO_ADENC_PARAM_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pu8InBuf) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_ADENC_PARAM_S),
        "::",
        stringify!(pu8InBuf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32InLen) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_ADENC_PARAM_S),
        "::",
        stringify!(u32InLen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u64InTimeStamp) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_ADENC_PARAM_S),
        "::",
        stringify!(u64InTimeStamp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pu8OutBuf) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_ADENC_PARAM_S),
        "::",
        stringify!(pu8OutBuf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32OutLen) as usize - ptr as usize },
        20usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_ADENC_PARAM_S),
        "::",
        stringify!(u32OutLen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u64OutTimeStamp) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_ADENC_PARAM_S),
        "::",
        stringify!(u64OutTimeStamp)
        )
    );
}

impl Default for rkAUDIO_ADENC_PARAM_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type AUDIO_ADENC_PARAM_S = rkAUDIO_ADENC_PARAM_S;

pub const rkAIO_MODE_E_AIO_MODE_I2S_MASTER: rkAIO_MODE_E = 0;
pub const rkAIO_MODE_E_AIO_MODE_I2S_SLAVE: rkAIO_MODE_E = 1;
pub const rkAIO_MODE_E_AIO_MODE_PCM_SLAVE_STD: rkAIO_MODE_E = 2;
pub const rkAIO_MODE_E_AIO_MODE_PCM_SLAVE_NSTD: rkAIO_MODE_E = 3;
pub const rkAIO_MODE_E_AIO_MODE_PCM_MASTER_STD: rkAIO_MODE_E = 4;
pub const rkAIO_MODE_E_AIO_MODE_PCM_MASTER_NSTD: rkAIO_MODE_E = 5;
pub const rkAIO_MODE_E_AIO_MODE_BUTT: rkAIO_MODE_E = 6;

pub type rkAIO_MODE_E = ::std::os::raw::c_uint;

pub use self::rkAIO_MODE_E as AIO_MODE_E;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkAIO_SOUND_CARD {
    pub channels: RK_U32,
    pub sampleRate: RK_U32,
    pub bitWidth: AUDIO_BIT_WIDTH_E,
}

#[test]
fn bindgen_test_layout_rkAIO_SOUND_CARD() {
    const UNINIT: ::std::mem::MaybeUninit<rkAIO_SOUND_CARD> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAIO_SOUND_CARD>(),
        12usize,
        concat!("Size of: ", stringify!(rkAIO_SOUND_CARD))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAIO_SOUND_CARD>(),
        4usize,
        concat!("Alignment of ", stringify!(rkAIO_SOUND_CARD))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAIO_SOUND_CARD),
        "::",
        stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRate) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAIO_SOUND_CARD),
        "::",
        stringify!(sampleRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bitWidth) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAIO_SOUND_CARD),
        "::",
        stringify!(bitWidth)
        )
    );
}

impl Default for rkAIO_SOUND_CARD {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type AIO_SOUND_CARD = rkAIO_SOUND_CARD;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkAIO_ATTR_S {
    pub soundCard: AIO_SOUND_CARD,
    pub enSamplerate: AUDIO_SAMPLE_RATE_E,
    pub enBitwidth: AUDIO_BIT_WIDTH_E,
    pub enSoundmode: AUDIO_SOUND_MODE_E,
    pub u32EXFlag: RK_U32,
    pub u32FrmNum: RK_U32,
    pub u32PtNumPerFrm: RK_U32,
    pub u32ChnCnt: RK_U32,
    pub u8CardName: [RK_U8; 64usize],
}

#[test]
fn bindgen_test_layout_rkAIO_ATTR_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkAIO_ATTR_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAIO_ATTR_S>(),
        104usize,
        concat!("Size of: ", stringify!(rkAIO_ATTR_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAIO_ATTR_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkAIO_ATTR_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).soundCard) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAIO_ATTR_S),
        "::",
        stringify!(soundCard)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enSamplerate) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAIO_ATTR_S),
        "::",
        stringify!(enSamplerate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enBitwidth) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAIO_ATTR_S),
        "::",
        stringify!(enBitwidth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enSoundmode) as usize - ptr as usize },
        20usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAIO_ATTR_S),
        "::",
        stringify!(enSoundmode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32EXFlag) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAIO_ATTR_S),
        "::",
        stringify!(u32EXFlag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32FrmNum) as usize - ptr as usize },
        28usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAIO_ATTR_S),
        "::",
        stringify!(u32FrmNum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32PtNumPerFrm) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAIO_ATTR_S),
        "::",
        stringify!(u32PtNumPerFrm)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32ChnCnt) as usize - ptr as usize },
        36usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAIO_ATTR_S),
        "::",
        stringify!(u32ChnCnt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u8CardName) as usize - ptr as usize },
        40usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAIO_ATTR_S),
        "::",
        stringify!(u8CardName)
        )
    );
}

impl Default for rkAIO_ATTR_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type AIO_ATTR_S = rkAIO_ATTR_S;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkAI_CHN_PARAM_S {
    pub s32UsrFrmDepth: RK_S32,
    pub enLoopbackMode: AUDIO_LOOPBACK_MODE_E,
}

#[test]
fn bindgen_test_layout_rkAI_CHN_PARAM_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkAI_CHN_PARAM_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAI_CHN_PARAM_S>(),
        8usize,
        concat!("Size of: ", stringify!(rkAI_CHN_PARAM_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAI_CHN_PARAM_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkAI_CHN_PARAM_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32UsrFrmDepth) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAI_CHN_PARAM_S),
        "::",
        stringify!(s32UsrFrmDepth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enLoopbackMode) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAI_CHN_PARAM_S),
        "::",
        stringify!(enLoopbackMode)
        )
    );
}

impl Default for rkAI_CHN_PARAM_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type AI_CHN_PARAM_S = rkAI_CHN_PARAM_S;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkAO_CHN_PARAM_S {
    pub enMode: AUDIO_CHN_MODE_E,
    pub enLoopbackMode: AUDIO_LOOPBACK_MODE_E,
}

#[test]
fn bindgen_test_layout_rkAO_CHN_PARAM_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkAO_CHN_PARAM_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAO_CHN_PARAM_S>(),
        8usize,
        concat!("Size of: ", stringify!(rkAO_CHN_PARAM_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAO_CHN_PARAM_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkAO_CHN_PARAM_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enMode) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAO_CHN_PARAM_S),
        "::",
        stringify!(enMode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enLoopbackMode) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAO_CHN_PARAM_S),
        "::",
        stringify!(enLoopbackMode)
        )
    );
}

impl Default for rkAO_CHN_PARAM_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type AO_CHN_PARAM_S = rkAO_CHN_PARAM_S;

#[repr(C)]
#[derive(Copy, Clone)]
pub struct rkAI_CHN_ATTR_S {
    pub enChnAttr: AUDIO_CHN_ATTR_MODE_E,
    pub __bindgen_anon_1: rkAI_CHN_ATTR_S__bindgen_ty_1,
}

#[repr(C)]
#[derive(Copy, Clone)]
pub union rkAI_CHN_ATTR_S__bindgen_ty_1 {
    pub s32Ppm: RK_S32,
    pub u32SampleRate: RK_U32,
}

#[test]
fn bindgen_test_layout_rkAI_CHN_ATTR_S__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<rkAI_CHN_ATTR_S__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAI_CHN_ATTR_S__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(rkAI_CHN_ATTR_S__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAI_CHN_ATTR_S__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(rkAI_CHN_ATTR_S__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32Ppm) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAI_CHN_ATTR_S__bindgen_ty_1),
        "::",
        stringify!(s32Ppm)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32SampleRate) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAI_CHN_ATTR_S__bindgen_ty_1),
        "::",
        stringify!(u32SampleRate)
        )
    );
}

impl Default for rkAI_CHN_ATTR_S__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

#[test]
fn bindgen_test_layout_rkAI_CHN_ATTR_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkAI_CHN_ATTR_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAI_CHN_ATTR_S>(),
        8usize,
        concat!("Size of: ", stringify!(rkAI_CHN_ATTR_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAI_CHN_ATTR_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkAI_CHN_ATTR_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enChnAttr) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAI_CHN_ATTR_S),
        "::",
        stringify!(enChnAttr)
        )
    );
}

impl Default for rkAI_CHN_ATTR_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type AI_CHN_ATTR_S = rkAI_CHN_ATTR_S;

#[repr(C)]
#[derive(Copy, Clone)]
pub struct rkAO_CHN_ATTR_S {
    pub enChnAttr: AUDIO_CHN_ATTR_MODE_E,
    pub __bindgen_anon_1: rkAO_CHN_ATTR_S__bindgen_ty_1,
}

#[repr(C)]
#[derive(Copy, Clone)]
pub union rkAO_CHN_ATTR_S__bindgen_ty_1 {
    pub s32Ppm: RK_S32,
    pub u32SampleRate: RK_U32,
}

#[test]
fn bindgen_test_layout_rkAO_CHN_ATTR_S__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<rkAO_CHN_ATTR_S__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAO_CHN_ATTR_S__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(rkAO_CHN_ATTR_S__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAO_CHN_ATTR_S__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(rkAO_CHN_ATTR_S__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32Ppm) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAO_CHN_ATTR_S__bindgen_ty_1),
        "::",
        stringify!(s32Ppm)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32SampleRate) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAO_CHN_ATTR_S__bindgen_ty_1),
        "::",
        stringify!(u32SampleRate)
        )
    );
}

impl Default for rkAO_CHN_ATTR_S__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

#[test]
fn bindgen_test_layout_rkAO_CHN_ATTR_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkAO_CHN_ATTR_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAO_CHN_ATTR_S>(),
        8usize,
        concat!("Size of: ", stringify!(rkAO_CHN_ATTR_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAO_CHN_ATTR_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkAO_CHN_ATTR_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enChnAttr) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAO_CHN_ATTR_S),
        "::",
        stringify!(enChnAttr)
        )
    );
}

impl Default for rkAO_CHN_ATTR_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type AO_CHN_ATTR_S = rkAO_CHN_ATTR_S;

#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rkAO_CHN_STATE_S {
    pub u32ChnTotalNum: RK_U32,
    pub u32ChnFreeNum: RK_U32,
    pub u32ChnBusyNum: RK_U32,
}

#[test]
fn bindgen_test_layout_rkAO_CHN_STATE_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkAO_CHN_STATE_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAO_CHN_STATE_S>(),
        12usize,
        concat!("Size of: ", stringify!(rkAO_CHN_STATE_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAO_CHN_STATE_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkAO_CHN_STATE_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32ChnTotalNum) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAO_CHN_STATE_S),
        "::",
        stringify!(u32ChnTotalNum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32ChnFreeNum) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAO_CHN_STATE_S),
        "::",
        stringify!(u32ChnFreeNum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32ChnBusyNum) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAO_CHN_STATE_S),
        "::",
        stringify!(u32ChnBusyNum)
        )
    );
}

pub type AO_CHN_STATE_S = rkAO_CHN_STATE_S;

pub const rkAUDIO_TRACK_MODE_E_AUDIO_TRACK_NORMAL: rkAUDIO_TRACK_MODE_E = 0;
pub const rkAUDIO_TRACK_MODE_E_AUDIO_TRACK_BOTH_LEFT: rkAUDIO_TRACK_MODE_E = 1;
pub const rkAUDIO_TRACK_MODE_E_AUDIO_TRACK_BOTH_RIGHT: rkAUDIO_TRACK_MODE_E = 2;
pub const rkAUDIO_TRACK_MODE_E_AUDIO_TRACK_EXCHANGE: rkAUDIO_TRACK_MODE_E = 3;
pub const rkAUDIO_TRACK_MODE_E_AUDIO_TRACK_MIX: rkAUDIO_TRACK_MODE_E = 4;
pub const rkAUDIO_TRACK_MODE_E_AUDIO_TRACK_LEFT_MUTE: rkAUDIO_TRACK_MODE_E = 5;
pub const rkAUDIO_TRACK_MODE_E_AUDIO_TRACK_RIGHT_MUTE: rkAUDIO_TRACK_MODE_E = 6;
pub const rkAUDIO_TRACK_MODE_E_AUDIO_TRACK_BOTH_MUTE: rkAUDIO_TRACK_MODE_E = 7;
pub const rkAUDIO_TRACK_MODE_E_AUDIO_TRACK_FRONT_LEFT: rkAUDIO_TRACK_MODE_E = 8;
pub const rkAUDIO_TRACK_MODE_E_AUDIO_TRACK_FRONT_RIGHT: rkAUDIO_TRACK_MODE_E = 9;
pub const rkAUDIO_TRACK_MODE_E_AUDIO_TRACK_OUT_STEREO: rkAUDIO_TRACK_MODE_E = 10;
pub const rkAUDIO_TRACK_MODE_E_AUDIO_TRACK_BUTT: rkAUDIO_TRACK_MODE_E = 11;

pub type rkAUDIO_TRACK_MODE_E = ::std::os::raw::c_uint;

pub use self::rkAUDIO_TRACK_MODE_E as AUDIO_TRACK_MODE_E;

pub const rkAUDIO_FADE_RATE_E_AUDIO_FADE_RATE_1: rkAUDIO_FADE_RATE_E = 0;
pub const rkAUDIO_FADE_RATE_E_AUDIO_FADE_RATE_2: rkAUDIO_FADE_RATE_E = 1;
pub const rkAUDIO_FADE_RATE_E_AUDIO_FADE_RATE_4: rkAUDIO_FADE_RATE_E = 2;
pub const rkAUDIO_FADE_RATE_E_AUDIO_FADE_RATE_8: rkAUDIO_FADE_RATE_E = 3;
pub const rkAUDIO_FADE_RATE_E_AUDIO_FADE_RATE_16: rkAUDIO_FADE_RATE_E = 4;
pub const rkAUDIO_FADE_RATE_E_AUDIO_FADE_RATE_32: rkAUDIO_FADE_RATE_E = 5;
pub const rkAUDIO_FADE_RATE_E_AUDIO_FADE_RATE_64: rkAUDIO_FADE_RATE_E = 6;
pub const rkAUDIO_FADE_RATE_E_AUDIO_FADE_RATE_128: rkAUDIO_FADE_RATE_E = 7;
pub const rkAUDIO_FADE_RATE_E_AUDIO_FADE_RATE_BUTT: rkAUDIO_FADE_RATE_E = 8;

pub type rkAUDIO_FADE_RATE_E = ::std::os::raw::c_uint;

pub use self::rkAUDIO_FADE_RATE_E as AUDIO_FADE_RATE_E;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkAUDIO_FADE_S {
    pub bFade: RK_BOOL,
    pub enFadeInRate: AUDIO_FADE_RATE_E,
    pub enFadeOutRate: AUDIO_FADE_RATE_E,
}

#[test]
fn bindgen_test_layout_rkAUDIO_FADE_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkAUDIO_FADE_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAUDIO_FADE_S>(),
        12usize,
        concat!("Size of: ", stringify!(rkAUDIO_FADE_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAUDIO_FADE_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkAUDIO_FADE_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bFade) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_FADE_S),
        "::",
        stringify!(bFade)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enFadeInRate) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_FADE_S),
        "::",
        stringify!(enFadeInRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enFadeOutRate) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_FADE_S),
        "::",
        stringify!(enFadeOutRate)
        )
    );
}

impl Default for rkAUDIO_FADE_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type AUDIO_FADE_S = rkAUDIO_FADE_S;

pub const rkAUDIO_VOLUME_CURVE_E_AUDIO_CURVE_UNSET: rkAUDIO_VOLUME_CURVE_E = 0;
pub const rkAUDIO_VOLUME_CURVE_E_AUDIO_CURVE_LINEAR: rkAUDIO_VOLUME_CURVE_E = 1;
pub const rkAUDIO_VOLUME_CURVE_E_AUDIO_CURVE_LOGARITHM: rkAUDIO_VOLUME_CURVE_E = 2;
pub const rkAUDIO_VOLUME_CURVE_E_AUDIO_CURVE_CUSTOMIZE: rkAUDIO_VOLUME_CURVE_E = 3;
pub const rkAUDIO_VOLUME_CURVE_E_AUDIO_CURVE_BUTT: rkAUDIO_VOLUME_CURVE_E = 4;

pub type rkAUDIO_VOLUME_CURVE_E = ::std::os::raw::c_uint;

pub use self::rkAUDIO_VOLUME_CURVE_E as AUDIO_VOLUME_CURVE_E;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkAUDIO_VOLUME_CURVE_S {
    pub enCurveType: AUDIO_VOLUME_CURVE_E,
    pub s32Resolution: RK_S32,
    pub fMinDB: RK_FLOAT,
    pub fMaxDB: RK_FLOAT,
    pub pCurveTable: *mut RK_U32,
}

#[test]
fn bindgen_test_layout_rkAUDIO_VOLUME_CURVE_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkAUDIO_VOLUME_CURVE_S> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAUDIO_VOLUME_CURVE_S>(),
        20usize,
        concat!("Size of: ", stringify!(rkAUDIO_VOLUME_CURVE_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAUDIO_VOLUME_CURVE_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkAUDIO_VOLUME_CURVE_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enCurveType) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_VOLUME_CURVE_S),
        "::",
        stringify!(enCurveType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32Resolution) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_VOLUME_CURVE_S),
        "::",
        stringify!(s32Resolution)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fMinDB) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_VOLUME_CURVE_S),
        "::",
        stringify!(fMinDB)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fMaxDB) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_VOLUME_CURVE_S),
        "::",
        stringify!(fMaxDB)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pCurveTable) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_VOLUME_CURVE_S),
        "::",
        stringify!(pCurveTable)
        )
    );
}

impl Default for rkAUDIO_VOLUME_CURVE_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type AUDIO_VOLUME_CURVE_S = rkAUDIO_VOLUME_CURVE_S;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkAUDIO_SAVE_FILE_INFO_S {
    pub bCfg: RK_BOOL,
    pub aFilePath: [RK_CHAR; 256usize],
    pub aFileName: [RK_CHAR; 256usize],
    pub u32FileSize: RK_U32,
}

#[test]
fn bindgen_test_layout_rkAUDIO_SAVE_FILE_INFO_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkAUDIO_SAVE_FILE_INFO_S> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAUDIO_SAVE_FILE_INFO_S>(),
        520usize,
        concat!("Size of: ", stringify!(rkAUDIO_SAVE_FILE_INFO_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAUDIO_SAVE_FILE_INFO_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkAUDIO_SAVE_FILE_INFO_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bCfg) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_SAVE_FILE_INFO_S),
        "::",
        stringify!(bCfg)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).aFilePath) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_SAVE_FILE_INFO_S),
        "::",
        stringify!(aFilePath)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).aFileName) as usize - ptr as usize },
        260usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_SAVE_FILE_INFO_S),
        "::",
        stringify!(aFileName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32FileSize) as usize - ptr as usize },
        516usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_SAVE_FILE_INFO_S),
        "::",
        stringify!(u32FileSize)
        )
    );
}

impl Default for rkAUDIO_SAVE_FILE_INFO_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type AUDIO_SAVE_FILE_INFO_S = rkAUDIO_SAVE_FILE_INFO_S;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkAUDIO_FILE_STATUS_S {
    pub bSaving: RK_BOOL,
}

#[test]
fn bindgen_test_layout_rkAUDIO_FILE_STATUS_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkAUDIO_FILE_STATUS_S> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAUDIO_FILE_STATUS_S>(),
        4usize,
        concat!("Size of: ", stringify!(rkAUDIO_FILE_STATUS_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAUDIO_FILE_STATUS_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkAUDIO_FILE_STATUS_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bSaving) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_FILE_STATUS_S),
        "::",
        stringify!(bSaving)
        )
    );
}

impl Default for rkAUDIO_FILE_STATUS_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type AUDIO_FILE_STATUS_S = rkAUDIO_FILE_STATUS_S;

pub const rkAIO_VQE_CONFIG_METHOD_AIO_VQE_CONFIG_NONE: rkAIO_VQE_CONFIG_METHOD = 0;
pub const rkAIO_VQE_CONFIG_METHOD_AIO_VQE_CONFIG_USER: rkAIO_VQE_CONFIG_METHOD = 1;
pub const rkAIO_VQE_CONFIG_METHOD_AIO_VQE_CONFIG_LOAD_FILE: rkAIO_VQE_CONFIG_METHOD = 2;

pub type rkAIO_VQE_CONFIG_METHOD = ::std::os::raw::c_uint;

pub use self::rkAIO_VQE_CONFIG_METHOD as AIO_VQE_CONFIG_METHOD;

pub const rkAI_VQE_TYPE_S_AI_VQE_NONE: rkAI_VQE_TYPE_S = 0;
pub const rkAI_VQE_TYPE_S_AI_VQE_RECORD: rkAI_VQE_TYPE_S = 1;
pub const rkAI_VQE_TYPE_S_AI_VQE_TALK: rkAI_VQE_TYPE_S = 2;

pub type rkAI_VQE_TYPE_S = ::std::os::raw::c_uint;

pub use self::rkAI_VQE_TYPE_S as AI_VQE_TYPE_S;

#[repr(C)]
#[derive(Copy, Clone)]
pub struct rkAI_VQE_CONFIG_S {
    pub enCfgMode: AIO_VQE_CONFIG_METHOD,
    pub s32WorkSampleRate: RK_S32,
    pub s32FrameSample: RK_S32,
    pub __bindgen_anon_1: rkAI_VQE_CONFIG_S__bindgen_ty_1,
}

#[repr(C)]
#[derive(Copy, Clone)]
pub union rkAI_VQE_CONFIG_S__bindgen_ty_1 {
    pub aCfgFile: [RK_CHAR; 256usize],
}

#[test]
fn bindgen_test_layout_rkAI_VQE_CONFIG_S__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<rkAI_VQE_CONFIG_S__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAI_VQE_CONFIG_S__bindgen_ty_1>(),
        256usize,
        concat!("Size of: ", stringify!(rkAI_VQE_CONFIG_S__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAI_VQE_CONFIG_S__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(rkAI_VQE_CONFIG_S__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).aCfgFile) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAI_VQE_CONFIG_S__bindgen_ty_1),
        "::",
        stringify!(aCfgFile)
        )
    );
}

impl Default for rkAI_VQE_CONFIG_S__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

#[test]
fn bindgen_test_layout_rkAI_VQE_CONFIG_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkAI_VQE_CONFIG_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAI_VQE_CONFIG_S>(),
        268usize,
        concat!("Size of: ", stringify!(rkAI_VQE_CONFIG_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAI_VQE_CONFIG_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkAI_VQE_CONFIG_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enCfgMode) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAI_VQE_CONFIG_S),
        "::",
        stringify!(enCfgMode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32WorkSampleRate) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAI_VQE_CONFIG_S),
        "::",
        stringify!(s32WorkSampleRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32FrameSample) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAI_VQE_CONFIG_S),
        "::",
        stringify!(s32FrameSample)
        )
    );
}

impl Default for rkAI_VQE_CONFIG_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type AI_VQE_CONFIG_S = rkAI_VQE_CONFIG_S;

#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rkAI_AED_CONFIG_S {
    pub fSnrDB: RK_FLOAT,
    pub fLsdDB: RK_FLOAT,
    pub s32Policy: RK_S32,
}

#[test]
fn bindgen_test_layout_rkAI_AED_CONFIG_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkAI_AED_CONFIG_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAI_AED_CONFIG_S>(),
        12usize,
        concat!("Size of: ", stringify!(rkAI_AED_CONFIG_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAI_AED_CONFIG_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkAI_AED_CONFIG_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fSnrDB) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAI_AED_CONFIG_S),
        "::",
        stringify!(fSnrDB)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fLsdDB) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAI_AED_CONFIG_S),
        "::",
        stringify!(fLsdDB)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32Policy) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAI_AED_CONFIG_S),
        "::",
        stringify!(s32Policy)
        )
    );
}

pub type AI_AED_CONFIG_S = rkAI_AED_CONFIG_S;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkAI_AED_RESULT_S {
    pub bAcousticEventDetected: RK_BOOL,
    pub bLoudSoundDetected: RK_BOOL,
    pub lsdResult: RK_FLOAT,
}

#[test]
fn bindgen_test_layout_rkAI_AED_RESULT_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkAI_AED_RESULT_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAI_AED_RESULT_S>(),
        12usize,
        concat!("Size of: ", stringify!(rkAI_AED_RESULT_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAI_AED_RESULT_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkAI_AED_RESULT_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bAcousticEventDetected) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAI_AED_RESULT_S),
        "::",
        stringify!(bAcousticEventDetected)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bLoudSoundDetected) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAI_AED_RESULT_S),
        "::",
        stringify!(bLoudSoundDetected)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lsdResult) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAI_AED_RESULT_S),
        "::",
        stringify!(lsdResult)
        )
    );
}

impl Default for rkAI_AED_RESULT_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type AI_AED_RESULT_S = rkAI_AED_RESULT_S;

#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rkAI_BCD_CONFIG_S {
    pub mFrameLen: RK_S32,
    pub mBlankFrameMax: RK_S32,
    pub mCryEnergy: RK_FLOAT,
    pub mJudgeEnergy: RK_FLOAT,
    pub mCryThres1: RK_FLOAT,
    pub mCryThres2: RK_FLOAT,
}

#[test]
fn bindgen_test_layout_rkAI_BCD_CONFIG_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkAI_BCD_CONFIG_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAI_BCD_CONFIG_S>(),
        24usize,
        concat!("Size of: ", stringify!(rkAI_BCD_CONFIG_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAI_BCD_CONFIG_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkAI_BCD_CONFIG_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mFrameLen) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAI_BCD_CONFIG_S),
        "::",
        stringify!(mFrameLen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mBlankFrameMax) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAI_BCD_CONFIG_S),
        "::",
        stringify!(mBlankFrameMax)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mCryEnergy) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAI_BCD_CONFIG_S),
        "::",
        stringify!(mCryEnergy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mJudgeEnergy) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAI_BCD_CONFIG_S),
        "::",
        stringify!(mJudgeEnergy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mCryThres1) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAI_BCD_CONFIG_S),
        "::",
        stringify!(mCryThres1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mCryThres2) as usize - ptr as usize },
        20usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAI_BCD_CONFIG_S),
        "::",
        stringify!(mCryThres2)
        )
    );
}

pub type AI_BCD_CONFIG_S = rkAI_BCD_CONFIG_S;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkAI_BCD_RESULT_S {
    pub bBabyCry: RK_BOOL,
}

#[test]
fn bindgen_test_layout_rkAI_BCD_RESULT_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkAI_BCD_RESULT_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAI_BCD_RESULT_S>(),
        4usize,
        concat!("Size of: ", stringify!(rkAI_BCD_RESULT_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAI_BCD_RESULT_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkAI_BCD_RESULT_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bBabyCry) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAI_BCD_RESULT_S),
        "::",
        stringify!(bBabyCry)
        )
    );
}

impl Default for rkAI_BCD_RESULT_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type AI_BCD_RESULT_S = rkAI_BCD_RESULT_S;

#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rkAI_BUZ_CONFIG_S {
    pub mFrameLen: RK_S32,
    pub mBlankFrameMax: RK_S32,
    pub mEnergyMean: RK_FLOAT,
    pub mEnergyMax: RK_FLOAT,
    pub mBuzThres1: RK_FLOAT,
    pub mBuzThres2: RK_FLOAT,
}

#[test]
fn bindgen_test_layout_rkAI_BUZ_CONFIG_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkAI_BUZ_CONFIG_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAI_BUZ_CONFIG_S>(),
        24usize,
        concat!("Size of: ", stringify!(rkAI_BUZ_CONFIG_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAI_BUZ_CONFIG_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkAI_BUZ_CONFIG_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mFrameLen) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAI_BUZ_CONFIG_S),
        "::",
        stringify!(mFrameLen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mBlankFrameMax) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAI_BUZ_CONFIG_S),
        "::",
        stringify!(mBlankFrameMax)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mEnergyMean) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAI_BUZ_CONFIG_S),
        "::",
        stringify!(mEnergyMean)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mEnergyMax) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAI_BUZ_CONFIG_S),
        "::",
        stringify!(mEnergyMax)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mBuzThres1) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAI_BUZ_CONFIG_S),
        "::",
        stringify!(mBuzThres1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mBuzThres2) as usize - ptr as usize },
        20usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAI_BUZ_CONFIG_S),
        "::",
        stringify!(mBuzThres2)
        )
    );
}

pub type AI_BUZ_CONFIG_S = rkAI_BUZ_CONFIG_S;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkAI_BUZ_RESULT_S {
    pub bBuzz: RK_BOOL,
}

#[test]
fn bindgen_test_layout_rkAI_BUZ_RESULT_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkAI_BUZ_RESULT_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAI_BUZ_RESULT_S>(),
        4usize,
        concat!("Size of: ", stringify!(rkAI_BUZ_RESULT_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAI_BUZ_RESULT_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkAI_BUZ_RESULT_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bBuzz) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAI_BUZ_RESULT_S),
        "::",
        stringify!(bBuzz)
        )
    );
}

impl Default for rkAI_BUZ_RESULT_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type AI_BUZ_RESULT_S = rkAI_BUZ_RESULT_S;

#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rkAI_GBS_CONFIG_S {
    pub mFrameLen: RK_S32,
}

#[test]
fn bindgen_test_layout_rkAI_GBS_CONFIG_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkAI_GBS_CONFIG_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAI_GBS_CONFIG_S>(),
        4usize,
        concat!("Size of: ", stringify!(rkAI_GBS_CONFIG_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAI_GBS_CONFIG_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkAI_GBS_CONFIG_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mFrameLen) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAI_GBS_CONFIG_S),
        "::",
        stringify!(mFrameLen)
        )
    );
}

pub type AI_GBS_CONFIG_S = rkAI_GBS_CONFIG_S;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkAI_GBS_RESULT_S {
    pub bGbs: RK_BOOL,
}

#[test]
fn bindgen_test_layout_rkAI_GBS_RESULT_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkAI_GBS_RESULT_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAI_GBS_RESULT_S>(),
        4usize,
        concat!("Size of: ", stringify!(rkAI_GBS_RESULT_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAI_GBS_RESULT_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkAI_GBS_RESULT_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bGbs) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAI_GBS_RESULT_S),
        "::",
        stringify!(bGbs)
        )
    );
}

impl Default for rkAI_GBS_RESULT_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type AI_GBS_RESULT_S = rkAI_GBS_RESULT_S;

#[doc = "Defines the configure parameters of ANR."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rkAUDIO_ANR_CONFIG_S {
    pub fNoiseFactor: RK_FLOAT,
    pub s32SwU: RK_S32,
    pub fPsiMin: RK_FLOAT,
    pub fPsiMax: RK_FLOAT,
    pub fGmin: RK_FLOAT,
}

#[test]
fn bindgen_test_layout_rkAUDIO_ANR_CONFIG_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkAUDIO_ANR_CONFIG_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAUDIO_ANR_CONFIG_S>(),
        20usize,
        concat!("Size of: ", stringify!(rkAUDIO_ANR_CONFIG_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAUDIO_ANR_CONFIG_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkAUDIO_ANR_CONFIG_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fNoiseFactor) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_ANR_CONFIG_S),
        "::",
        stringify!(fNoiseFactor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32SwU) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_ANR_CONFIG_S),
        "::",
        stringify!(s32SwU)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fPsiMin) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_ANR_CONFIG_S),
        "::",
        stringify!(fPsiMin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fPsiMax) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_ANR_CONFIG_S),
        "::",
        stringify!(fPsiMax)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fGmin) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_ANR_CONFIG_S),
        "::",
        stringify!(fGmin)
        )
    );
}

#[doc = "Defines the configure parameters of ANR."]
pub type AUDIO_ANR_CONFIG_S = rkAUDIO_ANR_CONFIG_S;

#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rkAUDIO_AGC_CONFIG_S {
    pub fAttackTime: RK_FLOAT,
    pub fReleaseTime: RK_FLOAT,
    pub fAttenuateTime: RK_FLOAT,
    pub fMaxGain: RK_FLOAT,
    pub fMaxPeak: RK_FLOAT,
    pub fRth0: RK_FLOAT,
    pub fRth1: RK_FLOAT,
    pub fRth2: RK_FLOAT,
    pub fRk0: RK_FLOAT,
    pub fRk1: RK_FLOAT,
    pub fRk2: RK_FLOAT,
    pub fLineGainDb: RK_FLOAT,
    pub s32SwSmL0: RK_S32,
    pub s32SwSmL1: RK_S32,
    pub s32SwSmL2: RK_S32,
}

#[test]
fn bindgen_test_layout_rkAUDIO_AGC_CONFIG_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkAUDIO_AGC_CONFIG_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAUDIO_AGC_CONFIG_S>(),
        60usize,
        concat!("Size of: ", stringify!(rkAUDIO_AGC_CONFIG_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAUDIO_AGC_CONFIG_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkAUDIO_AGC_CONFIG_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fAttackTime) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_AGC_CONFIG_S),
        "::",
        stringify!(fAttackTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fReleaseTime) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_AGC_CONFIG_S),
        "::",
        stringify!(fReleaseTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fAttenuateTime) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_AGC_CONFIG_S),
        "::",
        stringify!(fAttenuateTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fMaxGain) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_AGC_CONFIG_S),
        "::",
        stringify!(fMaxGain)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fMaxPeak) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_AGC_CONFIG_S),
        "::",
        stringify!(fMaxPeak)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fRth0) as usize - ptr as usize },
        20usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_AGC_CONFIG_S),
        "::",
        stringify!(fRth0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fRth1) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_AGC_CONFIG_S),
        "::",
        stringify!(fRth1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fRth2) as usize - ptr as usize },
        28usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_AGC_CONFIG_S),
        "::",
        stringify!(fRth2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fRk0) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_AGC_CONFIG_S),
        "::",
        stringify!(fRk0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fRk1) as usize - ptr as usize },
        36usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_AGC_CONFIG_S),
        "::",
        stringify!(fRk1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fRk2) as usize - ptr as usize },
        40usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_AGC_CONFIG_S),
        "::",
        stringify!(fRk2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fLineGainDb) as usize - ptr as usize },
        44usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_AGC_CONFIG_S),
        "::",
        stringify!(fLineGainDb)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32SwSmL0) as usize - ptr as usize },
        48usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_AGC_CONFIG_S),
        "::",
        stringify!(s32SwSmL0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32SwSmL1) as usize - ptr as usize },
        52usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_AGC_CONFIG_S),
        "::",
        stringify!(s32SwSmL1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32SwSmL2) as usize - ptr as usize },
        56usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAUDIO_AGC_CONFIG_S),
        "::",
        stringify!(s32SwSmL2)
        )
    );
}

pub type AUDIO_AGC_CONFIG_S = rkAUDIO_AGC_CONFIG_S;

pub const rkAO_VQE_MASK_AO_VQE_MASK_NONE: rkAO_VQE_MASK = 1;
pub const rkAO_VQE_MASK_AO_VQE_MASK_3A: rkAO_VQE_MASK = 2;
pub const rkAO_VQE_MASK_AO_VQE_MASK_AGC: rkAO_VQE_MASK = 4;
pub const rkAO_VQE_MASK_AO_VQE_MASK_ANR: rkAO_VQE_MASK = 8;

pub type rkAO_VQE_MASK = ::std::os::raw::c_uint;

pub use self::rkAO_VQE_MASK as AO_VQE_MASK;

#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rkAO_VQE_USER_CONFIG_S {
    pub u32OpenMask: RK_U32,
    pub stAgcCfg: AUDIO_AGC_CONFIG_S,
    pub stAnrCfg: AUDIO_ANR_CONFIG_S,
}

#[test]
fn bindgen_test_layout_rkAO_VQE_USER_CONFIG_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkAO_VQE_USER_CONFIG_S> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAO_VQE_USER_CONFIG_S>(),
        84usize,
        concat!("Size of: ", stringify!(rkAO_VQE_USER_CONFIG_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAO_VQE_USER_CONFIG_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkAO_VQE_USER_CONFIG_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32OpenMask) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAO_VQE_USER_CONFIG_S),
        "::",
        stringify!(u32OpenMask)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stAgcCfg) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAO_VQE_USER_CONFIG_S),
        "::",
        stringify!(stAgcCfg)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stAnrCfg) as usize - ptr as usize },
        64usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAO_VQE_USER_CONFIG_S),
        "::",
        stringify!(stAnrCfg)
        )
    );
}

pub type AO_VQE_USER_CONFIG_S = rkAO_VQE_USER_CONFIG_S;

#[repr(C)]
#[derive(Copy, Clone)]
pub struct rkAO_VQE_CONFIG_S {
    pub enCfgMode: AIO_VQE_CONFIG_METHOD,
    pub s32WorkSampleRate: RK_S32,
    pub s32FrameSample: RK_S32,
    pub __bindgen_anon_1: rkAO_VQE_CONFIG_S__bindgen_ty_1,
}

#[repr(C)]
#[derive(Copy, Clone)]
pub union rkAO_VQE_CONFIG_S__bindgen_ty_1 {
    pub aCfgFile: [RK_CHAR; 256usize],
    pub stUsrCfg: AO_VQE_USER_CONFIG_S,
}

#[test]
fn bindgen_test_layout_rkAO_VQE_CONFIG_S__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<rkAO_VQE_CONFIG_S__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAO_VQE_CONFIG_S__bindgen_ty_1>(),
        256usize,
        concat!("Size of: ", stringify!(rkAO_VQE_CONFIG_S__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAO_VQE_CONFIG_S__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(rkAO_VQE_CONFIG_S__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).aCfgFile) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAO_VQE_CONFIG_S__bindgen_ty_1),
        "::",
        stringify!(aCfgFile)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stUsrCfg) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAO_VQE_CONFIG_S__bindgen_ty_1),
        "::",
        stringify!(stUsrCfg)
        )
    );
}

impl Default for rkAO_VQE_CONFIG_S__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

#[test]
fn bindgen_test_layout_rkAO_VQE_CONFIG_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkAO_VQE_CONFIG_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAO_VQE_CONFIG_S>(),
        268usize,
        concat!("Size of: ", stringify!(rkAO_VQE_CONFIG_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAO_VQE_CONFIG_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkAO_VQE_CONFIG_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enCfgMode) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAO_VQE_CONFIG_S),
        "::",
        stringify!(enCfgMode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32WorkSampleRate) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAO_VQE_CONFIG_S),
        "::",
        stringify!(s32WorkSampleRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32FrameSample) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAO_VQE_CONFIG_S),
        "::",
        stringify!(s32FrameSample)
        )
    );
}

impl Default for rkAO_VQE_CONFIG_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type AO_VQE_CONFIG_S = rkAO_VQE_CONFIG_S;

pub const rkEN_AIO_ERR_CODE_E_AIO_ERR_VQE_ERR: rkEN_AIO_ERR_CODE_E = 65;

pub type rkEN_AIO_ERR_CODE_E = ::std::os::raw::c_uint;

pub use self::rkEN_AIO_ERR_CODE_E as RK_AIO_ERR_CODE_E;

pub const rkADEC_MODE_E_ADEC_MODE_PACK: rkADEC_MODE_E = 0;
pub const rkADEC_MODE_E_ADEC_MODE_STREAM: rkADEC_MODE_E = 1;
pub const rkADEC_MODE_E_ADEC_MODE_BUTT: rkADEC_MODE_E = 2;

pub type rkADEC_MODE_E = ::std::os::raw::c_uint;

pub use self::rkADEC_MODE_E as ADEC_MODE_E;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkADEC_ATTR_CODEC_S {
    pub enType: RK_CODEC_ID_E,
    pub u32Channels: RK_U32,
    pub u32SampleRate: RK_U32,
    pub u32BitPerCodedSample: RK_U32,
    pub pExtraData: *mut ::std::os::raw::c_void,
    pub u32ExtraDataSize: RK_U32,
    pub u32Resv: [RK_U32; 4usize],
    pub pstResv: *mut ::std::os::raw::c_void,
}

#[test]
fn bindgen_test_layout_rkADEC_ATTR_CODEC_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkADEC_ATTR_CODEC_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkADEC_ATTR_CODEC_S>(),
        44usize,
        concat!("Size of: ", stringify!(rkADEC_ATTR_CODEC_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkADEC_ATTR_CODEC_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkADEC_ATTR_CODEC_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enType) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkADEC_ATTR_CODEC_S),
        "::",
        stringify!(enType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32Channels) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkADEC_ATTR_CODEC_S),
        "::",
        stringify!(u32Channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32SampleRate) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkADEC_ATTR_CODEC_S),
        "::",
        stringify!(u32SampleRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32BitPerCodedSample) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(rkADEC_ATTR_CODEC_S),
        "::",
        stringify!(u32BitPerCodedSample)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pExtraData) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(rkADEC_ATTR_CODEC_S),
        "::",
        stringify!(pExtraData)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32ExtraDataSize) as usize - ptr as usize },
        20usize,
        concat!(
        "Offset of field: ",
        stringify!(rkADEC_ATTR_CODEC_S),
        "::",
        stringify!(u32ExtraDataSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32Resv) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(rkADEC_ATTR_CODEC_S),
        "::",
        stringify!(u32Resv)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pstResv) as usize - ptr as usize },
        40usize,
        concat!(
        "Offset of field: ",
        stringify!(rkADEC_ATTR_CODEC_S),
        "::",
        stringify!(pstResv)
        )
    );
}

impl Default for rkADEC_ATTR_CODEC_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type ADEC_ATTR_CODEC_S = rkADEC_ATTR_CODEC_S;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkADEC_FRAME_INFO_S {
    pub u32SampleRate: RK_U32,
    pub u32Channels: RK_U32,
    pub u64ChnLayout: RK_U64,
    pub enBitWidth: AUDIO_BIT_WIDTH_E,
    pub resv: [RK_U32; 2usize],
}

#[test]
fn bindgen_test_layout_rkADEC_FRAME_INFO_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkADEC_FRAME_INFO_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkADEC_FRAME_INFO_S>(),
        32usize,
        concat!("Size of: ", stringify!(rkADEC_FRAME_INFO_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkADEC_FRAME_INFO_S>(),
        8usize,
        concat!("Alignment of ", stringify!(rkADEC_FRAME_INFO_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32SampleRate) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkADEC_FRAME_INFO_S),
        "::",
        stringify!(u32SampleRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32Channels) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkADEC_FRAME_INFO_S),
        "::",
        stringify!(u32Channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u64ChnLayout) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkADEC_FRAME_INFO_S),
        "::",
        stringify!(u64ChnLayout)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enBitWidth) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(rkADEC_FRAME_INFO_S),
        "::",
        stringify!(enBitWidth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).resv) as usize - ptr as usize },
        20usize,
        concat!(
        "Offset of field: ",
        stringify!(rkADEC_FRAME_INFO_S),
        "::",
        stringify!(resv)
        )
    );
}

impl Default for rkADEC_FRAME_INFO_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type ADEC_FRAME_INFO_S = rkADEC_FRAME_INFO_S;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkADEC_CH_ATTR_S {
    pub enType: RK_CODEC_ID_E,
    pub enMode: ADEC_MODE_E,
    pub u32BufCount: RK_U32,
    pub u32BufSize: RK_U32,
    pub stCodecAttr: ADEC_ATTR_CODEC_S,
}

#[test]
fn bindgen_test_layout_rkADEC_CH_ATTR_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkADEC_CH_ATTR_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkADEC_CH_ATTR_S>(),
        60usize,
        concat!("Size of: ", stringify!(rkADEC_CH_ATTR_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkADEC_CH_ATTR_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkADEC_CH_ATTR_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enType) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkADEC_CH_ATTR_S),
        "::",
        stringify!(enType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enMode) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkADEC_CH_ATTR_S),
        "::",
        stringify!(enMode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32BufCount) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkADEC_CH_ATTR_S),
        "::",
        stringify!(u32BufCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32BufSize) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(rkADEC_CH_ATTR_S),
        "::",
        stringify!(u32BufSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stCodecAttr) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(rkADEC_CH_ATTR_S),
        "::",
        stringify!(stCodecAttr)
        )
    );
}

impl Default for rkADEC_CH_ATTR_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type ADEC_CHN_ATTR_S = rkADEC_CH_ATTR_S;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkADEC_CH_STATE_S {
    pub bEndOfStream: RK_BOOL,
    pub u32BufferFrmNum: RK_U32,
    pub u32BufferFreeNum: RK_U32,
    pub u32BufferBusyNum: RK_U32,
}

#[test]
fn bindgen_test_layout_rkADEC_CH_STATE_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkADEC_CH_STATE_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkADEC_CH_STATE_S>(),
        16usize,
        concat!("Size of: ", stringify!(rkADEC_CH_STATE_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkADEC_CH_STATE_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkADEC_CH_STATE_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bEndOfStream) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkADEC_CH_STATE_S),
        "::",
        stringify!(bEndOfStream)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32BufferFrmNum) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkADEC_CH_STATE_S),
        "::",
        stringify!(u32BufferFrmNum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32BufferFreeNum) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkADEC_CH_STATE_S),
        "::",
        stringify!(u32BufferFreeNum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32BufferBusyNum) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(rkADEC_CH_STATE_S),
        "::",
        stringify!(u32BufferBusyNum)
        )
    );
}

impl Default for rkADEC_CH_STATE_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type ADEC_CHN_STATE_S = rkADEC_CH_STATE_S;

pub const rkEN_ADEC_ERR_CODE_E_ADEC_ERR_DECODER_ERR: rkEN_ADEC_ERR_CODE_E = 64;
pub const rkEN_ADEC_ERR_CODE_E_ADEC_ERR_BUF_LACK: rkEN_ADEC_ERR_CODE_E = 65;
pub const rkEN_ADEC_ERR_CODE_E_ADEC_ERR_REGISTER_ERR: rkEN_ADEC_ERR_CODE_E = 66;

pub type rkEN_ADEC_ERR_CODE_E = ::std::os::raw::c_uint;

pub use self::rkEN_ADEC_ERR_CODE_E as RK_ADEC_ERR_CODE_E;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkADEC_DECODER_S {
    pub enType: RK_CODEC_ID_E,
    pub aszName: [RK_UCHAR; 17usize],
    pub pfnOpenDecoder: ::std::option::Option<
        unsafe extern "C" fn(
            pDecoderAttr: *mut ::std::os::raw::c_void,
            ppDecoder: *mut *mut ::std::os::raw::c_void,
        ) -> RK_S32,
    >,
    pub pfnDecodeFrm: ::std::option::Option<
        unsafe extern "C" fn(
            pDecoder: *mut ::std::os::raw::c_void,
            pParam: *mut ::std::os::raw::c_void,
        ) -> RK_S32,
    >,
    pub pfnGetFrmInfo: ::std::option::Option<
        unsafe extern "C" fn(
            pDecoder: *mut ::std::os::raw::c_void,
            pInfo: *mut ::std::os::raw::c_void,
        ) -> RK_S32,
    >,
    pub pfnCloseDecoder: ::std::option::Option<
        unsafe extern "C" fn(pDecoder: *mut ::std::os::raw::c_void) -> RK_S32,
    >,
    pub pfnResetDecoder: ::std::option::Option<
        unsafe extern "C" fn(pDecoder: *mut ::std::os::raw::c_void) -> RK_S32,
    >,
}

#[test]
fn bindgen_test_layout_rkADEC_DECODER_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkADEC_DECODER_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkADEC_DECODER_S>(),
        44usize,
        concat!("Size of: ", stringify!(rkADEC_DECODER_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkADEC_DECODER_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkADEC_DECODER_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enType) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkADEC_DECODER_S),
        "::",
        stringify!(enType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).aszName) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkADEC_DECODER_S),
        "::",
        stringify!(aszName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pfnOpenDecoder) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(rkADEC_DECODER_S),
        "::",
        stringify!(pfnOpenDecoder)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pfnDecodeFrm) as usize - ptr as usize },
        28usize,
        concat!(
        "Offset of field: ",
        stringify!(rkADEC_DECODER_S),
        "::",
        stringify!(pfnDecodeFrm)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pfnGetFrmInfo) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(rkADEC_DECODER_S),
        "::",
        stringify!(pfnGetFrmInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pfnCloseDecoder) as usize - ptr as usize },
        36usize,
        concat!(
        "Offset of field: ",
        stringify!(rkADEC_DECODER_S),
        "::",
        stringify!(pfnCloseDecoder)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pfnResetDecoder) as usize - ptr as usize },
        40usize,
        concat!(
        "Offset of field: ",
        stringify!(rkADEC_DECODER_S),
        "::",
        stringify!(pfnResetDecoder)
        )
    );
}

impl Default for rkADEC_DECODER_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type ADEC_DECODER_S = rkADEC_DECODER_S;

pub const rkADEC_DECODER_RESULT_ADEC_DECODER_OK: rkADEC_DECODER_RESULT = 0;
pub const rkADEC_DECODER_RESULT_ADEC_DECODER_TRY_AGAIN: rkADEC_DECODER_RESULT = 1;
pub const rkADEC_DECODER_RESULT_ADEC_DECODER_ERROR: rkADEC_DECODER_RESULT = 2;
pub const rkADEC_DECODER_RESULT_ADEC_DECODER_EOS: rkADEC_DECODER_RESULT = 3;

pub type rkADEC_DECODER_RESULT = ::std::os::raw::c_uint;

pub use self::rkADEC_DECODER_RESULT as ADEC_DECODER_RESULT;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkAENC_ATTR_CODEC_S {
    pub enType: RK_CODEC_ID_E,
    pub enBitwidth: AUDIO_BIT_WIDTH_E,
    pub u32Channels: RK_U32,
    pub u32SampleRate: RK_U32,
    pub u32Resv: [RK_U32; 4usize],
    pub pstResv: *mut ::std::os::raw::c_void,
}

#[test]
fn bindgen_test_layout_rkAENC_ATTR_CODEC_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkAENC_ATTR_CODEC_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAENC_ATTR_CODEC_S>(),
        36usize,
        concat!("Size of: ", stringify!(rkAENC_ATTR_CODEC_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAENC_ATTR_CODEC_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkAENC_ATTR_CODEC_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enType) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAENC_ATTR_CODEC_S),
        "::",
        stringify!(enType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enBitwidth) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAENC_ATTR_CODEC_S),
        "::",
        stringify!(enBitwidth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32Channels) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAENC_ATTR_CODEC_S),
        "::",
        stringify!(u32Channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32SampleRate) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAENC_ATTR_CODEC_S),
        "::",
        stringify!(u32SampleRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32Resv) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAENC_ATTR_CODEC_S),
        "::",
        stringify!(u32Resv)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pstResv) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAENC_ATTR_CODEC_S),
        "::",
        stringify!(pstResv)
        )
    );
}

impl Default for rkAENC_ATTR_CODEC_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type AENC_ATTR_CODEC_S = rkAENC_ATTR_CODEC_S;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkAENC_CHN_ATTR_S {
    pub enType: RK_CODEC_ID_E,
    pub u32BufCount: RK_U32,
    pub stCodecAttr: AENC_ATTR_CODEC_S,
}

#[test]
fn bindgen_test_layout_rkAENC_CHN_ATTR_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkAENC_CHN_ATTR_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAENC_CHN_ATTR_S>(),
        44usize,
        concat!("Size of: ", stringify!(rkAENC_CHN_ATTR_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAENC_CHN_ATTR_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkAENC_CHN_ATTR_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enType) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAENC_CHN_ATTR_S),
        "::",
        stringify!(enType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32BufCount) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAENC_CHN_ATTR_S),
        "::",
        stringify!(u32BufCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stCodecAttr) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAENC_CHN_ATTR_S),
        "::",
        stringify!(stCodecAttr)
        )
    );
}

impl Default for rkAENC_CHN_ATTR_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type AENC_CHN_ATTR_S = rkAENC_CHN_ATTR_S;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkAENC_ENCODER_S {
    pub enType: RK_CODEC_ID_E,
    pub u32MaxFrmLen: RK_U32,
    pub aszName: [RK_CHAR; 17usize],
    pub pfnOpenEncoder: ::std::option::Option<
        unsafe extern "C" fn(
            pEncoderAttr: *mut ::std::os::raw::c_void,
            ppEncoder: *mut *mut ::std::os::raw::c_void,
        ) -> RK_S32,
    >,
    pub pfnEncodeFrm: ::std::option::Option<
        unsafe extern "C" fn(
            pEncoder: *mut ::std::os::raw::c_void,
            pParam: *mut ::std::os::raw::c_void,
        ) -> RK_S32,
    >,
    pub pfnCloseEncoder: ::std::option::Option<
        unsafe extern "C" fn(pEncoder: *mut ::std::os::raw::c_void) -> RK_S32,
    >,
}

#[test]
fn bindgen_test_layout_rkAENC_ENCODER_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkAENC_ENCODER_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAENC_ENCODER_S>(),
        40usize,
        concat!("Size of: ", stringify!(rkAENC_ENCODER_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAENC_ENCODER_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkAENC_ENCODER_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enType) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAENC_ENCODER_S),
        "::",
        stringify!(enType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32MaxFrmLen) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAENC_ENCODER_S),
        "::",
        stringify!(u32MaxFrmLen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).aszName) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAENC_ENCODER_S),
        "::",
        stringify!(aszName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pfnOpenEncoder) as usize - ptr as usize },
        28usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAENC_ENCODER_S),
        "::",
        stringify!(pfnOpenEncoder)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pfnEncodeFrm) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAENC_ENCODER_S),
        "::",
        stringify!(pfnEncodeFrm)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pfnCloseEncoder) as usize - ptr as usize },
        36usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAENC_ENCODER_S),
        "::",
        stringify!(pfnCloseEncoder)
        )
    );
}

impl Default for rkAENC_ENCODER_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type AENC_ENCODER_S = rkAENC_ENCODER_S;

pub const rkEN_AENC_ERR_CODE_E_AENC_ERR_ENCODER_ERR: rkEN_AENC_ERR_CODE_E = 64;
pub const rkEN_AENC_ERR_CODE_E_AENC_ERR_VQE_ERR: rkEN_AENC_ERR_CODE_E = 65;
pub const rkEN_AENC_ERR_CODE_E_AENC_ERR_REGISTER_ERR: rkEN_AENC_ERR_CODE_E = 66;

pub type rkEN_AENC_ERR_CODE_E = ::std::os::raw::c_uint;

pub use self::rkEN_AENC_ERR_CODE_E as EN_AENC_ERR_CODE_E;

pub const rkENC_ENCODER_RESULT_AENC_ENCODER_OK: rkENC_ENCODER_RESULT = 0;
pub const rkENC_ENCODER_RESULT_AENC_ENCODER_TRY_AGAIN: rkENC_ENCODER_RESULT = 1;
pub const rkENC_ENCODER_RESULT_AENC_ENCODER_ERROR: rkENC_ENCODER_RESULT = 2;
pub const rkENC_ENCODER_RESULT_AENC_ENCODER_EOS: rkENC_ENCODER_RESULT = 3;

pub type rkENC_ENCODER_RESULT = ::std::os::raw::c_uint;

pub use self::rkENC_ENCODER_RESULT as AENC_ENCODER_RESULT;

pub const rkAUDIO_FILTER_TYPE_E_AUDIO_FILTER_RESAMPLE: rkAUDIO_FILTER_TYPE_E = 0;
pub const rkAUDIO_FILTER_TYPE_E_AUDIO_FILTER_3A: rkAUDIO_FILTER_TYPE_E = 1;
pub const rkAUDIO_FILTER_TYPE_E_AUDIO_FILTER_BUTT: rkAUDIO_FILTER_TYPE_E = 2;

pub type rkAUDIO_FILTER_TYPE_E = ::std::os::raw::c_uint;

pub use self::rkAUDIO_FILTER_TYPE_E as AUDIO_FILTER_TYPE_E;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkAF_RESAMPLE_ATTR_S {
    pub u32InRate: RK_U32,
    pub u32InChn: RK_U32,
    pub enInBitWidth: AUDIO_BIT_WIDTH_E,
    pub u32OutRate: RK_U32,
    pub u32OutChn: RK_U32,
    pub enOutBitWidth: AUDIO_BIT_WIDTH_E,
}

#[test]
fn bindgen_test_layout_rkAF_RESAMPLE_ATTR_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkAF_RESAMPLE_ATTR_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAF_RESAMPLE_ATTR_S>(),
        24usize,
        concat!("Size of: ", stringify!(rkAF_RESAMPLE_ATTR_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAF_RESAMPLE_ATTR_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkAF_RESAMPLE_ATTR_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32InRate) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAF_RESAMPLE_ATTR_S),
        "::",
        stringify!(u32InRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32InChn) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAF_RESAMPLE_ATTR_S),
        "::",
        stringify!(u32InChn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enInBitWidth) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAF_RESAMPLE_ATTR_S),
        "::",
        stringify!(enInBitWidth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32OutRate) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAF_RESAMPLE_ATTR_S),
        "::",
        stringify!(u32OutRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32OutChn) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAF_RESAMPLE_ATTR_S),
        "::",
        stringify!(u32OutChn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enOutBitWidth) as usize - ptr as usize },
        20usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAF_RESAMPLE_ATTR_S),
        "::",
        stringify!(enOutBitWidth)
        )
    );
}

impl Default for rkAF_RESAMPLE_ATTR_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type AF_RESAMPLE_ATTR_S = rkAF_RESAMPLE_ATTR_S;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkAF_3A_ATTR_S {
    pub cfgPath: [::std::os::raw::c_char; 256usize],
    pub u32SampleRate: RK_U32,
    pub u32Channels: RK_U32,
    pub enBitWidth: AUDIO_BIT_WIDTH_E,
    pub u32ChnLayout: RK_U32,
    pub u32RefLayout: RK_U32,
    pub u32RecLayout: RK_U32,
}

#[test]
fn bindgen_test_layout_rkAF_3A_ATTR_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkAF_3A_ATTR_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAF_3A_ATTR_S>(),
        280usize,
        concat!("Size of: ", stringify!(rkAF_3A_ATTR_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAF_3A_ATTR_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkAF_3A_ATTR_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cfgPath) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAF_3A_ATTR_S),
        "::",
        stringify!(cfgPath)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32SampleRate) as usize - ptr as usize },
        256usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAF_3A_ATTR_S),
        "::",
        stringify!(u32SampleRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32Channels) as usize - ptr as usize },
        260usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAF_3A_ATTR_S),
        "::",
        stringify!(u32Channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enBitWidth) as usize - ptr as usize },
        264usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAF_3A_ATTR_S),
        "::",
        stringify!(enBitWidth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32ChnLayout) as usize - ptr as usize },
        268usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAF_3A_ATTR_S),
        "::",
        stringify!(u32ChnLayout)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32RefLayout) as usize - ptr as usize },
        272usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAF_3A_ATTR_S),
        "::",
        stringify!(u32RefLayout)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32RecLayout) as usize - ptr as usize },
        276usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAF_3A_ATTR_S),
        "::",
        stringify!(u32RecLayout)
        )
    );
}

impl Default for rkAF_3A_ATTR_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type AF_3A_ATTR_S = rkAF_3A_ATTR_S;

#[repr(C)]
#[derive(Copy, Clone)]
pub struct rkAF_ATTR_S {
    pub enType: AUDIO_FILTER_TYPE_E,
    pub u32InBufCount: RK_U32,
    pub u32OutBufCount: RK_U32,
    pub __bindgen_anon_1: rkAF_ATTR_S__bindgen_ty_1,
}

#[repr(C)]
#[derive(Copy, Clone)]
pub union rkAF_ATTR_S__bindgen_ty_1 {
    pub stResAttr: AF_RESAMPLE_ATTR_S,
    pub st3AAttr: AF_3A_ATTR_S,
}

#[test]
fn bindgen_test_layout_rkAF_ATTR_S__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<rkAF_ATTR_S__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAF_ATTR_S__bindgen_ty_1>(),
        280usize,
        concat!("Size of: ", stringify!(rkAF_ATTR_S__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAF_ATTR_S__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(rkAF_ATTR_S__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stResAttr) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAF_ATTR_S__bindgen_ty_1),
        "::",
        stringify!(stResAttr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st3AAttr) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAF_ATTR_S__bindgen_ty_1),
        "::",
        stringify!(st3AAttr)
        )
    );
}

impl Default for rkAF_ATTR_S__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

#[test]
fn bindgen_test_layout_rkAF_ATTR_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkAF_ATTR_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAF_ATTR_S>(),
        292usize,
        concat!("Size of: ", stringify!(rkAF_ATTR_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAF_ATTR_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkAF_ATTR_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enType) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAF_ATTR_S),
        "::",
        stringify!(enType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32InBufCount) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAF_ATTR_S),
        "::",
        stringify!(u32InBufCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32OutBufCount) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAF_ATTR_S),
        "::",
        stringify!(u32OutBufCount)
        )
    );
}

impl Default for rkAF_ATTR_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type AF_ATTR_S = rkAF_ATTR_S;

pub const rkOPERATION_MODE_E_OPERATION_MODE_AUTO: rkOPERATION_MODE_E = 0;
pub const rkOPERATION_MODE_E_OPERATION_MODE_MANUAL: rkOPERATION_MODE_E = 1;
pub const rkOPERATION_MODE_E_OPERATION_MODE_BUTT: rkOPERATION_MODE_E = 2;

pub type rkOPERATION_MODE_E = ::std::os::raw::c_uint;

pub use self::rkOPERATION_MODE_E as OPERATION_MODE_E;

pub const rkROTATION_E_ROTATION_0: rkROTATION_E = 0;
pub const rkROTATION_E_ROTATION_90: rkROTATION_E = 1;
pub const rkROTATION_E_ROTATION_180: rkROTATION_E = 2;
pub const rkROTATION_E_ROTATION_270: rkROTATION_E = 3;
pub const rkROTATION_E_ROTATION_BUTT: rkROTATION_E = 4;

pub type rkROTATION_E = ::std::os::raw::c_uint;

pub use self::rkROTATION_E as ROTATION_E;

pub const rkMIRROR_E_MIRROR_NONE: rkMIRROR_E = 0;
pub const rkMIRROR_E_MIRROR_HORIZONTAL: rkMIRROR_E = 1;
pub const rkMIRROR_E_MIRROR_VERTICAL: rkMIRROR_E = 2;
pub const rkMIRROR_E_MIRROR_BOTH: rkMIRROR_E = 3;
pub const rkMIRROR_E_MIRROR_BUTT: rkMIRROR_E = 4;

pub type rkMIRROR_E = ::std::os::raw::c_uint;

pub use self::rkMIRROR_E as MIRROR_E;

pub const rkMB_SOURCE_E_MB_SOURCE_COMMON: rkMB_SOURCE_E = 0;
pub const rkMB_SOURCE_E_MB_SOURCE_MODULE: rkMB_SOURCE_E = 1;
pub const rkMB_SOURCE_E_MB_SOURCE_PRIVATE: rkMB_SOURCE_E = 2;
pub const rkMB_SOURCE_E_MB_SOURCE_USER: rkMB_SOURCE_E = 3;
pub const rkMB_SOURCE_E_MB_SOURCE_BUTT: rkMB_SOURCE_E = 4;

pub type rkMB_SOURCE_E = ::std::os::raw::c_uint;

pub use self::rkMB_SOURCE_E as MB_SOURCE_E;

pub const rkDATA_RATE_E_DATA_RATE_X1: rkDATA_RATE_E = 0;
pub const rkDATA_RATE_E_DATA_RATE_X2: rkDATA_RATE_E = 1;
pub const rkDATA_RATE_E_DATA_RATE_BUTT: rkDATA_RATE_E = 2;

pub type rkDATA_RATE_E = ::std::os::raw::c_uint;

pub use self::rkDATA_RATE_E as DATA_RATE_E;

#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rkBORDER_S {
    pub u32TopWidth: RK_U32,
    pub u32BottomWidth: RK_U32,
    pub u32LeftWidth: RK_U32,
    pub u32RightWidth: RK_U32,
    pub u32Color: RK_U32,
}

#[test]
fn bindgen_test_layout_rkBORDER_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkBORDER_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkBORDER_S>(),
        20usize,
        concat!("Size of: ", stringify!(rkBORDER_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkBORDER_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkBORDER_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32TopWidth) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkBORDER_S),
        "::",
        stringify!(u32TopWidth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32BottomWidth) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkBORDER_S),
        "::",
        stringify!(u32BottomWidth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32LeftWidth) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkBORDER_S),
        "::",
        stringify!(u32LeftWidth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32RightWidth) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(rkBORDER_S),
        "::",
        stringify!(u32RightWidth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32Color) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(rkBORDER_S),
        "::",
        stringify!(u32Color)
        )
    );
}

pub type BORDER_S = rkBORDER_S;

#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rkPOINT_S {
    pub s32X: RK_S32,
    pub s32Y: RK_S32,
}

#[test]
fn bindgen_test_layout_rkPOINT_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkPOINT_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkPOINT_S>(),
        8usize,
        concat!("Size of: ", stringify!(rkPOINT_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkPOINT_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkPOINT_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32X) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkPOINT_S),
        "::",
        stringify!(s32X)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32Y) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkPOINT_S),
        "::",
        stringify!(s32Y)
        )
    );
}

pub type POINT_S = rkPOINT_S;

#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rkSIZE_S {
    pub u32Width: RK_U32,
    pub u32Height: RK_U32,
}

#[test]
fn bindgen_test_layout_rkSIZE_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkSIZE_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkSIZE_S>(),
        8usize,
        concat!("Size of: ", stringify!(rkSIZE_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkSIZE_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkSIZE_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32Width) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkSIZE_S),
        "::",
        stringify!(u32Width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32Height) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkSIZE_S),
        "::",
        stringify!(u32Height)
        )
    );
}

pub type SIZE_S = rkSIZE_S;

#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rkRECT_S {
    pub s32X: RK_S32,
    pub s32Y: RK_S32,
    pub u32Width: RK_U32,
    pub u32Height: RK_U32,
}

#[test]
fn bindgen_test_layout_rkRECT_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkRECT_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkRECT_S>(),
        16usize,
        concat!("Size of: ", stringify!(rkRECT_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkRECT_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkRECT_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32X) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkRECT_S),
        "::",
        stringify!(s32X)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32Y) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkRECT_S),
        "::",
        stringify!(s32Y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32Width) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkRECT_S),
        "::",
        stringify!(u32Width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32Height) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(rkRECT_S),
        "::",
        stringify!(u32Height)
        )
    );
}

pub type RECT_S = rkRECT_S;

#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct rkVIDEO_REGION_INFO_S {
    pub u32RegionNum: RK_U32,
    pub __bindgen_padding_0: [u32; 3usize],
    pub pstRegion: *mut RECT_S,
}

#[test]
fn bindgen_test_layout_rkVIDEO_REGION_INFO_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkVIDEO_REGION_INFO_S> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkVIDEO_REGION_INFO_S>(),
        32usize,
        concat!("Size of: ", stringify!(rkVIDEO_REGION_INFO_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkVIDEO_REGION_INFO_S>(),
        16usize,
        concat!("Alignment of ", stringify!(rkVIDEO_REGION_INFO_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32RegionNum) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVIDEO_REGION_INFO_S),
        "::",
        stringify!(u32RegionNum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pstRegion) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVIDEO_REGION_INFO_S),
        "::",
        stringify!(pstRegion)
        )
    );
}

impl Default for rkVIDEO_REGION_INFO_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type VIDEO_REGION_INFO_S = rkVIDEO_REGION_INFO_S;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkCROP_INFO_S {
    pub bEnable: RK_BOOL,
    pub stRect: RECT_S,
}

#[test]
fn bindgen_test_layout_rkCROP_INFO_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkCROP_INFO_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkCROP_INFO_S>(),
        20usize,
        concat!("Size of: ", stringify!(rkCROP_INFO_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkCROP_INFO_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkCROP_INFO_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bEnable) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkCROP_INFO_S),
        "::",
        stringify!(bEnable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stRect) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkCROP_INFO_S),
        "::",
        stringify!(stRect)
        )
    );
}

impl Default for rkCROP_INFO_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type CROP_INFO_S = rkCROP_INFO_S;

#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rkFRAME_RATE_CTRL_S {
    pub s32SrcFrameRate: RK_S32,
    pub s32DstFrameRate: RK_S32,
}

#[test]
fn bindgen_test_layout_rkFRAME_RATE_CTRL_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkFRAME_RATE_CTRL_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkFRAME_RATE_CTRL_S>(),
        8usize,
        concat!("Size of: ", stringify!(rkFRAME_RATE_CTRL_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkFRAME_RATE_CTRL_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkFRAME_RATE_CTRL_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32SrcFrameRate) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkFRAME_RATE_CTRL_S),
        "::",
        stringify!(s32SrcFrameRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32DstFrameRate) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkFRAME_RATE_CTRL_S),
        "::",
        stringify!(s32DstFrameRate)
        )
    );
}

pub type FRAME_RATE_CTRL_S = rkFRAME_RATE_CTRL_S;

pub const rkASPECT_RATIO_E_ASPECT_RATIO_NONE: rkASPECT_RATIO_E = 0;
pub const rkASPECT_RATIO_E_ASPECT_RATIO_AUTO: rkASPECT_RATIO_E = 1;
pub const rkASPECT_RATIO_E_ASPECT_RATIO_MANUAL: rkASPECT_RATIO_E = 2;
pub const rkASPECT_RATIO_E_ASPECT_RATIO_BUTT: rkASPECT_RATIO_E = 3;

pub type rkASPECT_RATIO_E = ::std::os::raw::c_uint;

pub use self::rkASPECT_RATIO_E as ASPECT_RATIO_E;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkASPECT_RATIO_S {
    pub enMode: ASPECT_RATIO_E,
    pub u32BgColor: RK_U32,
    pub stVideoRect: RECT_S,
}

#[test]
fn bindgen_test_layout_rkASPECT_RATIO_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkASPECT_RATIO_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkASPECT_RATIO_S>(),
        24usize,
        concat!("Size of: ", stringify!(rkASPECT_RATIO_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkASPECT_RATIO_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkASPECT_RATIO_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enMode) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkASPECT_RATIO_S),
        "::",
        stringify!(enMode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32BgColor) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkASPECT_RATIO_S),
        "::",
        stringify!(u32BgColor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stVideoRect) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkASPECT_RATIO_S),
        "::",
        stringify!(stVideoRect)
        )
    );
}

impl Default for rkASPECT_RATIO_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type ASPECT_RATIO_S = rkASPECT_RATIO_S;

pub const rkPIXEL_FORMAT_E_RK_FMT_YUV420SP: rkPIXEL_FORMAT_E = 0;
pub const rkPIXEL_FORMAT_E_RK_FMT_YUV420SP_10BIT: rkPIXEL_FORMAT_E = 1;
pub const rkPIXEL_FORMAT_E_RK_FMT_YUV422SP: rkPIXEL_FORMAT_E = 2;
#[doc = "< Not part of ABI"]
pub const rkPIXEL_FORMAT_E_RK_FMT_YUV422SP_10BIT: rkPIXEL_FORMAT_E = 3;
pub const rkPIXEL_FORMAT_E_RK_FMT_YUV420P: rkPIXEL_FORMAT_E = 4;
pub const rkPIXEL_FORMAT_E_RK_FMT_YUV420P_VU: rkPIXEL_FORMAT_E = 5;
pub const rkPIXEL_FORMAT_E_RK_FMT_YUV420SP_VU: rkPIXEL_FORMAT_E = 6;
pub const rkPIXEL_FORMAT_E_RK_FMT_YUV422P: rkPIXEL_FORMAT_E = 7;
pub const rkPIXEL_FORMAT_E_RK_FMT_YUV422SP_VU: rkPIXEL_FORMAT_E = 8;
pub const rkPIXEL_FORMAT_E_RK_FMT_YUV422_YUYV: rkPIXEL_FORMAT_E = 9;
pub const rkPIXEL_FORMAT_E_RK_FMT_YUV422_UYVY: rkPIXEL_FORMAT_E = 10;
pub const rkPIXEL_FORMAT_E_RK_FMT_YUV400SP: rkPIXEL_FORMAT_E = 11;
pub const rkPIXEL_FORMAT_E_RK_FMT_YUV440SP: rkPIXEL_FORMAT_E = 12;
pub const rkPIXEL_FORMAT_E_RK_FMT_YUV411SP: rkPIXEL_FORMAT_E = 13;
pub const rkPIXEL_FORMAT_E_RK_FMT_YUV444: rkPIXEL_FORMAT_E = 14;
pub const rkPIXEL_FORMAT_E_RK_FMT_YUV444SP: rkPIXEL_FORMAT_E = 15;
pub const rkPIXEL_FORMAT_E_RK_FMT_YUV444P: rkPIXEL_FORMAT_E = 16;
pub const rkPIXEL_FORMAT_E_RK_FMT_YUV422_YVYU: rkPIXEL_FORMAT_E = 17;
pub const rkPIXEL_FORMAT_E_RK_FMT_YUV422_VYUY: rkPIXEL_FORMAT_E = 18;
pub const rkPIXEL_FORMAT_E_RK_FMT_YUV_BUTT: rkPIXEL_FORMAT_E = 19;
pub const rkPIXEL_FORMAT_E_RK_FMT_RGB565: rkPIXEL_FORMAT_E = 65536;
pub const rkPIXEL_FORMAT_E_RK_FMT_BGR565: rkPIXEL_FORMAT_E = 65537;
pub const rkPIXEL_FORMAT_E_RK_FMT_RGB555: rkPIXEL_FORMAT_E = 65538;
pub const rkPIXEL_FORMAT_E_RK_FMT_BGR555: rkPIXEL_FORMAT_E = 65539;
pub const rkPIXEL_FORMAT_E_RK_FMT_RGB444: rkPIXEL_FORMAT_E = 65540;
pub const rkPIXEL_FORMAT_E_RK_FMT_BGR444: rkPIXEL_FORMAT_E = 65541;
pub const rkPIXEL_FORMAT_E_RK_FMT_RGB888: rkPIXEL_FORMAT_E = 65542;
pub const rkPIXEL_FORMAT_E_RK_FMT_BGR888: rkPIXEL_FORMAT_E = 65543;
pub const rkPIXEL_FORMAT_E_RK_FMT_RGB101010: rkPIXEL_FORMAT_E = 65544;
pub const rkPIXEL_FORMAT_E_RK_FMT_BGR101010: rkPIXEL_FORMAT_E = 65545;
pub const rkPIXEL_FORMAT_E_RK_FMT_ARGB1555: rkPIXEL_FORMAT_E = 65546;
pub const rkPIXEL_FORMAT_E_RK_FMT_ABGR1555: rkPIXEL_FORMAT_E = 65547;
pub const rkPIXEL_FORMAT_E_RK_FMT_ARGB4444: rkPIXEL_FORMAT_E = 65548;
pub const rkPIXEL_FORMAT_E_RK_FMT_ABGR4444: rkPIXEL_FORMAT_E = 65549;
pub const rkPIXEL_FORMAT_E_RK_FMT_ARGB8565: rkPIXEL_FORMAT_E = 65550;
pub const rkPIXEL_FORMAT_E_RK_FMT_ABGR8565: rkPIXEL_FORMAT_E = 65551;
pub const rkPIXEL_FORMAT_E_RK_FMT_ARGB8888: rkPIXEL_FORMAT_E = 65552;
pub const rkPIXEL_FORMAT_E_RK_FMT_ABGR8888: rkPIXEL_FORMAT_E = 65553;
pub const rkPIXEL_FORMAT_E_RK_FMT_BGRA8888: rkPIXEL_FORMAT_E = 65554;
pub const rkPIXEL_FORMAT_E_RK_FMT_RGBA8888: rkPIXEL_FORMAT_E = 65555;
pub const rkPIXEL_FORMAT_E_RK_FMT_RGBA5551: rkPIXEL_FORMAT_E = 65556;
pub const rkPIXEL_FORMAT_E_RK_FMT_BGRA5551: rkPIXEL_FORMAT_E = 65557;
pub const rkPIXEL_FORMAT_E_RK_FMT_BGRA4444: rkPIXEL_FORMAT_E = 65558;
pub const rkPIXEL_FORMAT_E_RK_FMT_RGBA4444: rkPIXEL_FORMAT_E = 65559;
pub const rkPIXEL_FORMAT_E_RK_FMT_XBGR8888: rkPIXEL_FORMAT_E = 65560;
pub const rkPIXEL_FORMAT_E_RK_FMT_RGB_BUTT: rkPIXEL_FORMAT_E = 65561;
pub const rkPIXEL_FORMAT_E_RK_FMT_2BPP: rkPIXEL_FORMAT_E = 65562;
pub const rkPIXEL_FORMAT_E_RK_FMT_RGB_BAYER_SBGGR_8BPP: rkPIXEL_FORMAT_E = 131072;
pub const rkPIXEL_FORMAT_E_RK_FMT_RGB_BAYER_SGBRG_8BPP: rkPIXEL_FORMAT_E = 131073;
pub const rkPIXEL_FORMAT_E_RK_FMT_RGB_BAYER_SGRBG_8BPP: rkPIXEL_FORMAT_E = 131074;
pub const rkPIXEL_FORMAT_E_RK_FMT_RGB_BAYER_SRGGB_8BPP: rkPIXEL_FORMAT_E = 131075;
pub const rkPIXEL_FORMAT_E_RK_FMT_RGB_BAYER_SBGGR_10BPP: rkPIXEL_FORMAT_E = 131076;
pub const rkPIXEL_FORMAT_E_RK_FMT_RGB_BAYER_SGBRG_10BPP: rkPIXEL_FORMAT_E = 131077;
pub const rkPIXEL_FORMAT_E_RK_FMT_RGB_BAYER_SGRBG_10BPP: rkPIXEL_FORMAT_E = 131078;
pub const rkPIXEL_FORMAT_E_RK_FMT_RGB_BAYER_SRGGB_10BPP: rkPIXEL_FORMAT_E = 131079;
pub const rkPIXEL_FORMAT_E_RK_FMT_RGB_BAYER_SBGGR_12BPP: rkPIXEL_FORMAT_E = 131080;
pub const rkPIXEL_FORMAT_E_RK_FMT_RGB_BAYER_SGBRG_12BPP: rkPIXEL_FORMAT_E = 131081;
pub const rkPIXEL_FORMAT_E_RK_FMT_RGB_BAYER_SGRBG_12BPP: rkPIXEL_FORMAT_E = 131082;
pub const rkPIXEL_FORMAT_E_RK_FMT_RGB_BAYER_SRGGB_12BPP: rkPIXEL_FORMAT_E = 131083;
pub const rkPIXEL_FORMAT_E_RK_FMT_RGB_BAYER_14BPP: rkPIXEL_FORMAT_E = 131084;
pub const rkPIXEL_FORMAT_E_RK_FMT_RGB_BAYER_SBGGR_16BPP: rkPIXEL_FORMAT_E = 131085;
pub const rkPIXEL_FORMAT_E_RK_FMT_RGB_BAYER_BUTT: rkPIXEL_FORMAT_E = 131086;
pub const rkPIXEL_FORMAT_E_RK_FMT_BUTT: rkPIXEL_FORMAT_E = 131086;

pub type rkPIXEL_FORMAT_E = ::std::os::raw::c_uint;

pub use self::rkPIXEL_FORMAT_E as PIXEL_FORMAT_E;

pub const rkVIDEO_PROC_DEV_TYPE_E_VIDEO_PROC_DEV_GPU: rkVIDEO_PROC_DEV_TYPE_E = 0;
pub const rkVIDEO_PROC_DEV_TYPE_E_VIDEO_PROC_DEV_RGA: rkVIDEO_PROC_DEV_TYPE_E = 1;
pub const rkVIDEO_PROC_DEV_TYPE_E_VIDEO_PROC_DEV_BUTT: rkVIDEO_PROC_DEV_TYPE_E = 2;

pub type rkVIDEO_PROC_DEV_TYPE_E = ::std::os::raw::c_uint;

pub use self::rkVIDEO_PROC_DEV_TYPE_E as VIDEO_PROC_DEV_TYPE_E;

pub const rkVIDEO_FIELD_E_VIDEO_FIELD_TOP: rkVIDEO_FIELD_E = 1;
pub const rkVIDEO_FIELD_E_VIDEO_FIELD_BOTTOM: rkVIDEO_FIELD_E = 2;
pub const rkVIDEO_FIELD_E_VIDEO_FIELD_INTERLACED: rkVIDEO_FIELD_E = 3;
pub const rkVIDEO_FIELD_E_VIDEO_FIELD_FRAME: rkVIDEO_FIELD_E = 4;
pub const rkVIDEO_FIELD_E_VIDEO_FIELD_BUTT: rkVIDEO_FIELD_E = 5;

pub type rkVIDEO_FIELD_E = ::std::os::raw::c_uint;

pub use self::rkVIDEO_FIELD_E as VIDEO_FIELD_E;

pub const rkVIDEO_FORMAT_E_VIDEO_FORMAT_LINEAR: rkVIDEO_FORMAT_E = 0;
pub const rkVIDEO_FORMAT_E_VIDEO_FORMAT_TILE_64x16: rkVIDEO_FORMAT_E = 1;
pub const rkVIDEO_FORMAT_E_VIDEO_FORMAT_TILE_16x8: rkVIDEO_FORMAT_E = 2;
pub const rkVIDEO_FORMAT_E_VIDEO_FORMAT_LINEAR_DISCRETE: rkVIDEO_FORMAT_E = 3;
pub const rkVIDEO_FORMAT_E_VIDEO_FORMAT_BUTT: rkVIDEO_FORMAT_E = 4;

pub type rkVIDEO_FORMAT_E = ::std::os::raw::c_uint;

pub use self::rkVIDEO_FORMAT_E as VIDEO_FORMAT_E;

pub const rkCOMPRESS_MODE_E_COMPRESS_MODE_NONE: rkCOMPRESS_MODE_E = 0;
pub const rkCOMPRESS_MODE_E_COMPRESS_AFBC_16x16: rkCOMPRESS_MODE_E = 1;
pub const rkCOMPRESS_MODE_E_COMPRESS_MODE_BUTT: rkCOMPRESS_MODE_E = 2;

pub type rkCOMPRESS_MODE_E = ::std::os::raw::c_uint;

pub use self::rkCOMPRESS_MODE_E as COMPRESS_MODE_E;

pub const rkVIDEO_DISPLAY_MODE_E_VIDEO_DISPLAY_MODE_PREVIEW: rkVIDEO_DISPLAY_MODE_E = 0;
pub const rkVIDEO_DISPLAY_MODE_E_VIDEO_DISPLAY_MODE_PLAYBACK: rkVIDEO_DISPLAY_MODE_E = 1;
pub const rkVIDEO_DISPLAY_MODE_E_VIDEO_DISPLAY_MODE_BUTT: rkVIDEO_DISPLAY_MODE_E = 2;

pub type rkVIDEO_DISPLAY_MODE_E = ::std::os::raw::c_uint;

pub use self::rkVIDEO_DISPLAY_MODE_E as VIDEO_DISPLAY_MODE_E;

#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rkLUMA_INFO_S {
    pub u64LumaPixSum: RK_U64,
    pub u32LumaPixAverage: RK_U32,
    pub u64PTS: RK_U64,
}

#[test]
fn bindgen_test_layout_rkLUMA_INFO_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkLUMA_INFO_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkLUMA_INFO_S>(),
        24usize,
        concat!("Size of: ", stringify!(rkLUMA_INFO_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkLUMA_INFO_S>(),
        8usize,
        concat!("Alignment of ", stringify!(rkLUMA_INFO_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u64LumaPixSum) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkLUMA_INFO_S),
        "::",
        stringify!(u64LumaPixSum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32LumaPixAverage) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkLUMA_INFO_S),
        "::",
        stringify!(u32LumaPixAverage)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u64PTS) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(rkLUMA_INFO_S),
        "::",
        stringify!(u64PTS)
        )
    );
}

pub type LUMA_INFO_S = rkLUMA_INFO_S;

#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rkISP_DCF_CONST_INFO_S {
    pub au8ImageDescription: [RK_U8; 32usize],
    pub au8Make: [RK_U8; 32usize],
    pub au8Model: [RK_U8; 32usize],
    pub au8Software: [RK_U8; 32usize],
    pub u8LightSource: RK_U8,
    pub u32FocalLength: RK_U32,
    pub u8SceneType: RK_U8,
    pub u8CustomRendered: RK_U8,
    pub u8FocalLengthIn35mmFilm: RK_U8,
    pub u8SceneCaptureType: RK_U8,
    pub u8GainControl: RK_U8,
    pub u8Contrast: RK_U8,
    pub u8Saturation: RK_U8,
    pub u8Sharpness: RK_U8,
    pub u8MeteringMode: RK_U8,
}

#[test]
fn bindgen_test_layout_rkISP_DCF_CONST_INFO_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkISP_DCF_CONST_INFO_S> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkISP_DCF_CONST_INFO_S>(),
        148usize,
        concat!("Size of: ", stringify!(rkISP_DCF_CONST_INFO_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkISP_DCF_CONST_INFO_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkISP_DCF_CONST_INFO_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).au8ImageDescription) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkISP_DCF_CONST_INFO_S),
        "::",
        stringify!(au8ImageDescription)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).au8Make) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(rkISP_DCF_CONST_INFO_S),
        "::",
        stringify!(au8Make)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).au8Model) as usize - ptr as usize },
        64usize,
        concat!(
        "Offset of field: ",
        stringify!(rkISP_DCF_CONST_INFO_S),
        "::",
        stringify!(au8Model)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).au8Software) as usize - ptr as usize },
        96usize,
        concat!(
        "Offset of field: ",
        stringify!(rkISP_DCF_CONST_INFO_S),
        "::",
        stringify!(au8Software)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u8LightSource) as usize - ptr as usize },
        128usize,
        concat!(
        "Offset of field: ",
        stringify!(rkISP_DCF_CONST_INFO_S),
        "::",
        stringify!(u8LightSource)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32FocalLength) as usize - ptr as usize },
        132usize,
        concat!(
        "Offset of field: ",
        stringify!(rkISP_DCF_CONST_INFO_S),
        "::",
        stringify!(u32FocalLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u8SceneType) as usize - ptr as usize },
        136usize,
        concat!(
        "Offset of field: ",
        stringify!(rkISP_DCF_CONST_INFO_S),
        "::",
        stringify!(u8SceneType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u8CustomRendered) as usize - ptr as usize },
        137usize,
        concat!(
        "Offset of field: ",
        stringify!(rkISP_DCF_CONST_INFO_S),
        "::",
        stringify!(u8CustomRendered)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u8FocalLengthIn35mmFilm) as usize - ptr as usize },
        138usize,
        concat!(
        "Offset of field: ",
        stringify!(rkISP_DCF_CONST_INFO_S),
        "::",
        stringify!(u8FocalLengthIn35mmFilm)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u8SceneCaptureType) as usize - ptr as usize },
        139usize,
        concat!(
        "Offset of field: ",
        stringify!(rkISP_DCF_CONST_INFO_S),
        "::",
        stringify!(u8SceneCaptureType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u8GainControl) as usize - ptr as usize },
        140usize,
        concat!(
        "Offset of field: ",
        stringify!(rkISP_DCF_CONST_INFO_S),
        "::",
        stringify!(u8GainControl)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u8Contrast) as usize - ptr as usize },
        141usize,
        concat!(
        "Offset of field: ",
        stringify!(rkISP_DCF_CONST_INFO_S),
        "::",
        stringify!(u8Contrast)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u8Saturation) as usize - ptr as usize },
        142usize,
        concat!(
        "Offset of field: ",
        stringify!(rkISP_DCF_CONST_INFO_S),
        "::",
        stringify!(u8Saturation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u8Sharpness) as usize - ptr as usize },
        143usize,
        concat!(
        "Offset of field: ",
        stringify!(rkISP_DCF_CONST_INFO_S),
        "::",
        stringify!(u8Sharpness)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u8MeteringMode) as usize - ptr as usize },
        144usize,
        concat!(
        "Offset of field: ",
        stringify!(rkISP_DCF_CONST_INFO_S),
        "::",
        stringify!(u8MeteringMode)
        )
    );
}

pub type ISP_DCF_CONST_INFO_S = rkISP_DCF_CONST_INFO_S;

#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rkISP_DCF_UPDATE_INFO_S {
    pub u32ISOSpeedRatings: RK_U32,
    pub u32ExposureTime: RK_U32,
    pub u32ExposureBiasValue: RK_U32,
    pub u8ExposureProgram: RK_U8,
    pub u32FNumber: RK_U32,
    pub u32MaxApertureValue: RK_U32,
    pub u8ExposureMode: RK_U8,
    pub u8WhiteBalance: RK_U8,
}

#[test]
fn bindgen_test_layout_rkISP_DCF_UPDATE_INFO_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkISP_DCF_UPDATE_INFO_S> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkISP_DCF_UPDATE_INFO_S>(),
        28usize,
        concat!("Size of: ", stringify!(rkISP_DCF_UPDATE_INFO_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkISP_DCF_UPDATE_INFO_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkISP_DCF_UPDATE_INFO_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32ISOSpeedRatings) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkISP_DCF_UPDATE_INFO_S),
        "::",
        stringify!(u32ISOSpeedRatings)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32ExposureTime) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkISP_DCF_UPDATE_INFO_S),
        "::",
        stringify!(u32ExposureTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32ExposureBiasValue) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkISP_DCF_UPDATE_INFO_S),
        "::",
        stringify!(u32ExposureBiasValue)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u8ExposureProgram) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(rkISP_DCF_UPDATE_INFO_S),
        "::",
        stringify!(u8ExposureProgram)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32FNumber) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(rkISP_DCF_UPDATE_INFO_S),
        "::",
        stringify!(u32FNumber)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32MaxApertureValue) as usize - ptr as usize },
        20usize,
        concat!(
        "Offset of field: ",
        stringify!(rkISP_DCF_UPDATE_INFO_S),
        "::",
        stringify!(u32MaxApertureValue)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u8ExposureMode) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(rkISP_DCF_UPDATE_INFO_S),
        "::",
        stringify!(u8ExposureMode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u8WhiteBalance) as usize - ptr as usize },
        25usize,
        concat!(
        "Offset of field: ",
        stringify!(rkISP_DCF_UPDATE_INFO_S),
        "::",
        stringify!(u8WhiteBalance)
        )
    );
}

pub type ISP_DCF_UPDATE_INFO_S = rkISP_DCF_UPDATE_INFO_S;

#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rkISP_DCF_INFO_S {
    pub stIspDCFConstInfo: ISP_DCF_CONST_INFO_S,
    pub stIspDCFUpdateInfo: ISP_DCF_UPDATE_INFO_S,
}

#[test]
fn bindgen_test_layout_rkISP_DCF_INFO_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkISP_DCF_INFO_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkISP_DCF_INFO_S>(),
        176usize,
        concat!("Size of: ", stringify!(rkISP_DCF_INFO_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkISP_DCF_INFO_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkISP_DCF_INFO_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stIspDCFConstInfo) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkISP_DCF_INFO_S),
        "::",
        stringify!(stIspDCFConstInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stIspDCFUpdateInfo) as usize - ptr as usize },
        148usize,
        concat!(
        "Offset of field: ",
        stringify!(rkISP_DCF_INFO_S),
        "::",
        stringify!(stIspDCFUpdateInfo)
        )
    );
}

pub type ISP_DCF_INFO_S = rkISP_DCF_INFO_S;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkJPEG_DCF_S {
    pub au8CaptureTime: [RK_U8; 20usize],
    pub bFlash: RK_BOOL,
    pub u32DigitalZoomRatio: RK_U32,
    pub stIspDCFInfo: ISP_DCF_INFO_S,
}

#[test]
fn bindgen_test_layout_rkJPEG_DCF_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkJPEG_DCF_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkJPEG_DCF_S>(),
        204usize,
        concat!("Size of: ", stringify!(rkJPEG_DCF_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkJPEG_DCF_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkJPEG_DCF_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).au8CaptureTime) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkJPEG_DCF_S),
        "::",
        stringify!(au8CaptureTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bFlash) as usize - ptr as usize },
        20usize,
        concat!(
        "Offset of field: ",
        stringify!(rkJPEG_DCF_S),
        "::",
        stringify!(bFlash)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32DigitalZoomRatio) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(rkJPEG_DCF_S),
        "::",
        stringify!(u32DigitalZoomRatio)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stIspDCFInfo) as usize - ptr as usize },
        28usize,
        concat!(
        "Offset of field: ",
        stringify!(rkJPEG_DCF_S),
        "::",
        stringify!(stIspDCFInfo)
        )
    );
}

impl Default for rkJPEG_DCF_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type JPEG_DCF_S = rkJPEG_DCF_S;

#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rkISP_FRAME_INFO_S {
    pub u32ISO: RK_U32,
    pub u32ExposureTime: RK_U32,
    pub u32IspDgain: RK_U32,
    pub u32Again: RK_U32,
    pub u32Dgain: RK_U32,
    pub au32Ratio: [RK_U32; 3usize],
    pub u32IspNrStrength: RK_U32,
    pub u32FNumber: RK_U32,
    pub u32SensorID: RK_U32,
    pub u32SensorMode: RK_U32,
    pub u32HmaxTimes: RK_U32,
    pub u32Vmax: RK_U32,
    pub u32VcNum: RK_U32,
}

#[test]
fn bindgen_test_layout_rkISP_FRAME_INFO_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkISP_FRAME_INFO_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkISP_FRAME_INFO_S>(),
        60usize,
        concat!("Size of: ", stringify!(rkISP_FRAME_INFO_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkISP_FRAME_INFO_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkISP_FRAME_INFO_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32ISO) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkISP_FRAME_INFO_S),
        "::",
        stringify!(u32ISO)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32ExposureTime) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkISP_FRAME_INFO_S),
        "::",
        stringify!(u32ExposureTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32IspDgain) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkISP_FRAME_INFO_S),
        "::",
        stringify!(u32IspDgain)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32Again) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(rkISP_FRAME_INFO_S),
        "::",
        stringify!(u32Again)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32Dgain) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(rkISP_FRAME_INFO_S),
        "::",
        stringify!(u32Dgain)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).au32Ratio) as usize - ptr as usize },
        20usize,
        concat!(
        "Offset of field: ",
        stringify!(rkISP_FRAME_INFO_S),
        "::",
        stringify!(au32Ratio)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32IspNrStrength) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(rkISP_FRAME_INFO_S),
        "::",
        stringify!(u32IspNrStrength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32FNumber) as usize - ptr as usize },
        36usize,
        concat!(
        "Offset of field: ",
        stringify!(rkISP_FRAME_INFO_S),
        "::",
        stringify!(u32FNumber)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32SensorID) as usize - ptr as usize },
        40usize,
        concat!(
        "Offset of field: ",
        stringify!(rkISP_FRAME_INFO_S),
        "::",
        stringify!(u32SensorID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32SensorMode) as usize - ptr as usize },
        44usize,
        concat!(
        "Offset of field: ",
        stringify!(rkISP_FRAME_INFO_S),
        "::",
        stringify!(u32SensorMode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32HmaxTimes) as usize - ptr as usize },
        48usize,
        concat!(
        "Offset of field: ",
        stringify!(rkISP_FRAME_INFO_S),
        "::",
        stringify!(u32HmaxTimes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32Vmax) as usize - ptr as usize },
        52usize,
        concat!(
        "Offset of field: ",
        stringify!(rkISP_FRAME_INFO_S),
        "::",
        stringify!(u32Vmax)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32VcNum) as usize - ptr as usize },
        56usize,
        concat!(
        "Offset of field: ",
        stringify!(rkISP_FRAME_INFO_S),
        "::",
        stringify!(u32VcNum)
        )
    );
}

pub type ISP_FRAME_INFO_S = rkISP_FRAME_INFO_S;

#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rkDNG_RATIONAL_S {
    pub u32Numerator: RK_U32,
    pub u32Denominator: RK_U32,
}

#[test]
fn bindgen_test_layout_rkDNG_RATIONAL_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkDNG_RATIONAL_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkDNG_RATIONAL_S>(),
        8usize,
        concat!("Size of: ", stringify!(rkDNG_RATIONAL_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkDNG_RATIONAL_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkDNG_RATIONAL_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32Numerator) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkDNG_RATIONAL_S),
        "::",
        stringify!(u32Numerator)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32Denominator) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkDNG_RATIONAL_S),
        "::",
        stringify!(u32Denominator)
        )
    );
}

pub type DNG_RATIONAL_S = rkDNG_RATIONAL_S;

#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rkDNG_IMAGE_DYNAMIC_INFO_S {
    pub au32BlackLevel: [RK_U32; 4usize],
    pub astAsShotNeutral: [DNG_RATIONAL_S; 3usize],
    pub adNoiseProfile: [RK_DOUBLE; 6usize],
}

#[test]
fn bindgen_test_layout_rkDNG_IMAGE_DYNAMIC_INFO_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkDNG_IMAGE_DYNAMIC_INFO_S> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkDNG_IMAGE_DYNAMIC_INFO_S>(),
        88usize,
        concat!("Size of: ", stringify!(rkDNG_IMAGE_DYNAMIC_INFO_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkDNG_IMAGE_DYNAMIC_INFO_S>(),
        8usize,
        concat!("Alignment of ", stringify!(rkDNG_IMAGE_DYNAMIC_INFO_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).au32BlackLevel) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkDNG_IMAGE_DYNAMIC_INFO_S),
        "::",
        stringify!(au32BlackLevel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).astAsShotNeutral) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(rkDNG_IMAGE_DYNAMIC_INFO_S),
        "::",
        stringify!(astAsShotNeutral)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).adNoiseProfile) as usize - ptr as usize },
        40usize,
        concat!(
        "Offset of field: ",
        stringify!(rkDNG_IMAGE_DYNAMIC_INFO_S),
        "::",
        stringify!(adNoiseProfile)
        )
    );
}

pub type DNG_IMAGE_DYNAMIC_INFO_S = rkDNG_IMAGE_DYNAMIC_INFO_S;

#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rkISP_HDR_INFO_S {
    pub u32ColorTemp: RK_U32,
    pub au16CCM: [RK_U16; 9usize],
    pub u8Saturation: RK_U8,
}

#[test]
fn bindgen_test_layout_rkISP_HDR_INFO_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkISP_HDR_INFO_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkISP_HDR_INFO_S>(),
        24usize,
        concat!("Size of: ", stringify!(rkISP_HDR_INFO_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkISP_HDR_INFO_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkISP_HDR_INFO_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32ColorTemp) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkISP_HDR_INFO_S),
        "::",
        stringify!(u32ColorTemp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).au16CCM) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkISP_HDR_INFO_S),
        "::",
        stringify!(au16CCM)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u8Saturation) as usize - ptr as usize },
        22usize,
        concat!(
        "Offset of field: ",
        stringify!(rkISP_HDR_INFO_S),
        "::",
        stringify!(u8Saturation)
        )
    );
}

pub type ISP_HDR_INFO_S = rkISP_HDR_INFO_S;

#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rkISP_ATTACH_INFO_S {
    pub stIspHdr: ISP_HDR_INFO_S,
    pub u32ISO: RK_U32,
    pub u8SnsWDRMode: RK_U8,
}

#[test]
fn bindgen_test_layout_rkISP_ATTACH_INFO_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkISP_ATTACH_INFO_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkISP_ATTACH_INFO_S>(),
        32usize,
        concat!("Size of: ", stringify!(rkISP_ATTACH_INFO_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkISP_ATTACH_INFO_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkISP_ATTACH_INFO_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stIspHdr) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkISP_ATTACH_INFO_S),
        "::",
        stringify!(stIspHdr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32ISO) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(rkISP_ATTACH_INFO_S),
        "::",
        stringify!(u32ISO)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u8SnsWDRMode) as usize - ptr as usize },
        28usize,
        concat!(
        "Offset of field: ",
        stringify!(rkISP_ATTACH_INFO_S),
        "::",
        stringify!(u8SnsWDRMode)
        )
    );
}

pub type ISP_ATTACH_INFO_S = rkISP_ATTACH_INFO_S;

pub const rkFRAME_FLAG_E_FRAME_FLAG_SNAP_FLASH: rkFRAME_FLAG_E = 1;
pub const rkFRAME_FLAG_E_FRAME_FLAG_SNAP_CUR: rkFRAME_FLAG_E = 2;
pub const rkFRAME_FLAG_E_FRAME_FLAG_SNAP_REF: rkFRAME_FLAG_E = 4;
pub const rkFRAME_FLAG_E_FRAME_FLAG_SNAP_END: rkFRAME_FLAG_E = -2147483648;
pub const rkFRAME_FLAG_E_FRAME_FLAG_BUTT: rkFRAME_FLAG_E = -2147483647;

pub type rkFRAME_FLAG_E = ::std::os::raw::c_int;

pub use self::rkFRAME_FLAG_E as FRAME_FLAG_E;

#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rkISP_CONFIG_INFO_S {
    pub u32ISO: RK_U32,
    pub u32IspDgain: RK_U32,
    pub u32ExposureTime: RK_U32,
    pub au32WhiteBalanceGain: [RK_U32; 4usize],
    pub u32ColorTemperature: RK_U32,
    pub au16CapCCM: [RK_U16; 9usize],
}

#[test]
fn bindgen_test_layout_rkISP_CONFIG_INFO_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkISP_CONFIG_INFO_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkISP_CONFIG_INFO_S>(),
        52usize,
        concat!("Size of: ", stringify!(rkISP_CONFIG_INFO_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkISP_CONFIG_INFO_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkISP_CONFIG_INFO_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32ISO) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkISP_CONFIG_INFO_S),
        "::",
        stringify!(u32ISO)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32IspDgain) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkISP_CONFIG_INFO_S),
        "::",
        stringify!(u32IspDgain)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32ExposureTime) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkISP_CONFIG_INFO_S),
        "::",
        stringify!(u32ExposureTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).au32WhiteBalanceGain) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(rkISP_CONFIG_INFO_S),
        "::",
        stringify!(au32WhiteBalanceGain)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32ColorTemperature) as usize - ptr as usize },
        28usize,
        concat!(
        "Offset of field: ",
        stringify!(rkISP_CONFIG_INFO_S),
        "::",
        stringify!(u32ColorTemperature)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).au16CapCCM) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(rkISP_CONFIG_INFO_S),
        "::",
        stringify!(au16CapCCM)
        )
    );
}

pub type ISP_CONFIG_INFO_S = rkISP_CONFIG_INFO_S;

#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct rkVIDEO_SUPPLEMENT_S {
    pub u64JpegDCFPhyAddr: RK_U64,
    pub u64IspInfoPhyAddr: RK_U64,
    pub u64LowDelayPhyAddr: RK_U64,
    pub u64MotionDataPhyAddr: RK_U64,
    pub u64FrameDNGPhyAddr: RK_U64,
    pub __bindgen_padding_0: [u32; 2usize],
    pub pJpegDCFVirAddr: *mut ::std::os::raw::c_void,
    pub __bindgen_padding_1: [u32; 3usize],
    pub pIspInfoVirAddr: *mut ::std::os::raw::c_void,
    pub __bindgen_padding_2: [u32; 3usize],
    pub pLowDelayVirAddr: *mut ::std::os::raw::c_void,
    pub __bindgen_padding_3: [u32; 3usize],
    pub pMotionDataVirAddr: *mut ::std::os::raw::c_void,
    pub __bindgen_padding_4: [u32; 3usize],
    pub pFrameDNGVirAddr: *mut ::std::os::raw::c_void,
}

#[test]
fn bindgen_test_layout_rkVIDEO_SUPPLEMENT_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkVIDEO_SUPPLEMENT_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkVIDEO_SUPPLEMENT_S>(),
        128usize,
        concat!("Size of: ", stringify!(rkVIDEO_SUPPLEMENT_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkVIDEO_SUPPLEMENT_S>(),
        16usize,
        concat!("Alignment of ", stringify!(rkVIDEO_SUPPLEMENT_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u64JpegDCFPhyAddr) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVIDEO_SUPPLEMENT_S),
        "::",
        stringify!(u64JpegDCFPhyAddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u64IspInfoPhyAddr) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVIDEO_SUPPLEMENT_S),
        "::",
        stringify!(u64IspInfoPhyAddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u64LowDelayPhyAddr) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVIDEO_SUPPLEMENT_S),
        "::",
        stringify!(u64LowDelayPhyAddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u64MotionDataPhyAddr) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVIDEO_SUPPLEMENT_S),
        "::",
        stringify!(u64MotionDataPhyAddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u64FrameDNGPhyAddr) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVIDEO_SUPPLEMENT_S),
        "::",
        stringify!(u64FrameDNGPhyAddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pJpegDCFVirAddr) as usize - ptr as usize },
        48usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVIDEO_SUPPLEMENT_S),
        "::",
        stringify!(pJpegDCFVirAddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pIspInfoVirAddr) as usize - ptr as usize },
        64usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVIDEO_SUPPLEMENT_S),
        "::",
        stringify!(pIspInfoVirAddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pLowDelayVirAddr) as usize - ptr as usize },
        80usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVIDEO_SUPPLEMENT_S),
        "::",
        stringify!(pLowDelayVirAddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pMotionDataVirAddr) as usize - ptr as usize },
        96usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVIDEO_SUPPLEMENT_S),
        "::",
        stringify!(pMotionDataVirAddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pFrameDNGVirAddr) as usize - ptr as usize },
        112usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVIDEO_SUPPLEMENT_S),
        "::",
        stringify!(pFrameDNGVirAddr)
        )
    );
}

impl Default for rkVIDEO_SUPPLEMENT_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type VIDEO_SUPPLEMENT_S = rkVIDEO_SUPPLEMENT_S;

pub const rkCOLOR_GAMUT_E_COLOR_GAMUT_BT601: rkCOLOR_GAMUT_E = 0;
pub const rkCOLOR_GAMUT_E_COLOR_GAMUT_BT709: rkCOLOR_GAMUT_E = 1;
pub const rkCOLOR_GAMUT_E_COLOR_GAMUT_BT2020: rkCOLOR_GAMUT_E = 2;
pub const rkCOLOR_GAMUT_E_COLOR_GAMUT_USER: rkCOLOR_GAMUT_E = 3;
pub const rkCOLOR_GAMUT_E_COLOR_GAMUT_BUTT: rkCOLOR_GAMUT_E = 4;

pub type rkCOLOR_GAMUT_E = ::std::os::raw::c_uint;

pub use self::rkCOLOR_GAMUT_E as COLOR_GAMUT_E;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkISP_COLORGAMMUT_INFO_S {
    pub enColorGamut: COLOR_GAMUT_E,
}

#[test]
fn bindgen_test_layout_rkISP_COLORGAMMUT_INFO_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkISP_COLORGAMMUT_INFO_S> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkISP_COLORGAMMUT_INFO_S>(),
        4usize,
        concat!("Size of: ", stringify!(rkISP_COLORGAMMUT_INFO_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkISP_COLORGAMMUT_INFO_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkISP_COLORGAMMUT_INFO_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enColorGamut) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkISP_COLORGAMMUT_INFO_S),
        "::",
        stringify!(enColorGamut)
        )
    );
}

impl Default for rkISP_COLORGAMMUT_INFO_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type ISP_COLORGAMMUT_INFO_S = rkISP_COLORGAMMUT_INFO_S;

pub const rkDYNAMIC_RANGE_E_DYNAMIC_RANGE_SDR8: rkDYNAMIC_RANGE_E = 0;
pub const rkDYNAMIC_RANGE_E_DYNAMIC_RANGE_SDR10: rkDYNAMIC_RANGE_E = 1;
pub const rkDYNAMIC_RANGE_E_DYNAMIC_RANGE_HDR10: rkDYNAMIC_RANGE_E = 2;
pub const rkDYNAMIC_RANGE_E_DYNAMIC_RANGE_HLG: rkDYNAMIC_RANGE_E = 3;
pub const rkDYNAMIC_RANGE_E_DYNAMIC_RANGE_SLF: rkDYNAMIC_RANGE_E = 4;
pub const rkDYNAMIC_RANGE_E_DYNAMIC_RANGE_XDR: rkDYNAMIC_RANGE_E = 5;
pub const rkDYNAMIC_RANGE_E_DYNAMIC_RANGE_BUTT: rkDYNAMIC_RANGE_E = 6;

pub type rkDYNAMIC_RANGE_E = ::std::os::raw::c_uint;

pub use self::rkDYNAMIC_RANGE_E as DYNAMIC_RANGE_E;

pub const rkDATA_BITWIDTH_E_DATA_BITWIDTH_8: rkDATA_BITWIDTH_E = 0;
pub const rkDATA_BITWIDTH_E_DATA_BITWIDTH_10: rkDATA_BITWIDTH_E = 1;
pub const rkDATA_BITWIDTH_E_DATA_BITWIDTH_12: rkDATA_BITWIDTH_E = 2;
pub const rkDATA_BITWIDTH_E_DATA_BITWIDTH_14: rkDATA_BITWIDTH_E = 3;
pub const rkDATA_BITWIDTH_E_DATA_BITWIDTH_16: rkDATA_BITWIDTH_E = 4;
pub const rkDATA_BITWIDTH_E_DATA_BITWIDTH_BUTT: rkDATA_BITWIDTH_E = 5;

pub type rkDATA_BITWIDTH_E = ::std::os::raw::c_uint;

pub use self::rkDATA_BITWIDTH_E as DATA_BITWIDTH_E;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkVIDEO_FRAME_S {
    pub pMbBlk: MB_BLK,
    pub u32Width: RK_U32,
    pub u32Height: RK_U32,
    pub u32VirWidth: RK_U32,
    pub u32VirHeight: RK_U32,
    pub enField: VIDEO_FIELD_E,
    pub enPixelFormat: PIXEL_FORMAT_E,
    pub enVideoFormat: VIDEO_FORMAT_E,
    pub enCompressMode: COMPRESS_MODE_E,
    pub enDynamicRange: DYNAMIC_RANGE_E,
    pub enColorGamut: COLOR_GAMUT_E,
    pub pVirAddr: [*mut ::std::os::raw::c_void; 2usize],
    pub u32TimeRef: RK_U32,
    pub u64PTS: RK_U64,
    pub u64PrivateData: RK_U64,
    pub u32FrameFlag: RK_U32,
}

#[test]
fn bindgen_test_layout_rkVIDEO_FRAME_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkVIDEO_FRAME_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkVIDEO_FRAME_S>(),
        80usize,
        concat!("Size of: ", stringify!(rkVIDEO_FRAME_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkVIDEO_FRAME_S>(),
        8usize,
        concat!("Alignment of ", stringify!(rkVIDEO_FRAME_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pMbBlk) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVIDEO_FRAME_S),
        "::",
        stringify!(pMbBlk)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32Width) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVIDEO_FRAME_S),
        "::",
        stringify!(u32Width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32Height) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVIDEO_FRAME_S),
        "::",
        stringify!(u32Height)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32VirWidth) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVIDEO_FRAME_S),
        "::",
        stringify!(u32VirWidth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32VirHeight) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVIDEO_FRAME_S),
        "::",
        stringify!(u32VirHeight)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enField) as usize - ptr as usize },
        20usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVIDEO_FRAME_S),
        "::",
        stringify!(enField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enPixelFormat) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVIDEO_FRAME_S),
        "::",
        stringify!(enPixelFormat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enVideoFormat) as usize - ptr as usize },
        28usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVIDEO_FRAME_S),
        "::",
        stringify!(enVideoFormat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enCompressMode) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVIDEO_FRAME_S),
        "::",
        stringify!(enCompressMode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enDynamicRange) as usize - ptr as usize },
        36usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVIDEO_FRAME_S),
        "::",
        stringify!(enDynamicRange)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enColorGamut) as usize - ptr as usize },
        40usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVIDEO_FRAME_S),
        "::",
        stringify!(enColorGamut)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVirAddr) as usize - ptr as usize },
        44usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVIDEO_FRAME_S),
        "::",
        stringify!(pVirAddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32TimeRef) as usize - ptr as usize },
        52usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVIDEO_FRAME_S),
        "::",
        stringify!(u32TimeRef)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u64PTS) as usize - ptr as usize },
        56usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVIDEO_FRAME_S),
        "::",
        stringify!(u64PTS)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u64PrivateData) as usize - ptr as usize },
        64usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVIDEO_FRAME_S),
        "::",
        stringify!(u64PrivateData)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32FrameFlag) as usize - ptr as usize },
        72usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVIDEO_FRAME_S),
        "::",
        stringify!(u32FrameFlag)
        )
    );
}

impl Default for rkVIDEO_FRAME_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type VIDEO_FRAME_S = rkVIDEO_FRAME_S;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkVIDEO_FRAME_INFO_S {
    pub stVFrame: VIDEO_FRAME_S,
}

#[test]
fn bindgen_test_layout_rkVIDEO_FRAME_INFO_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkVIDEO_FRAME_INFO_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkVIDEO_FRAME_INFO_S>(),
        80usize,
        concat!("Size of: ", stringify!(rkVIDEO_FRAME_INFO_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkVIDEO_FRAME_INFO_S>(),
        8usize,
        concat!("Alignment of ", stringify!(rkVIDEO_FRAME_INFO_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stVFrame) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVIDEO_FRAME_INFO_S),
        "::",
        stringify!(stVFrame)
        )
    );
}

impl Default for rkVIDEO_FRAME_INFO_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type VIDEO_FRAME_INFO_S = rkVIDEO_FRAME_INFO_S;

#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rkMB_PIC_CAL_S {
    pub u32MBSize: RK_U32,
    pub u32VirWidth: RK_U32,
    pub u32VirHeight: RK_U32,
}

#[test]
fn bindgen_test_layout_rkMB_PIC_CAL_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkMB_PIC_CAL_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkMB_PIC_CAL_S>(),
        12usize,
        concat!("Size of: ", stringify!(rkMB_PIC_CAL_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkMB_PIC_CAL_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkMB_PIC_CAL_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32MBSize) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkMB_PIC_CAL_S),
        "::",
        stringify!(u32MBSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32VirWidth) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkMB_PIC_CAL_S),
        "::",
        stringify!(u32VirWidth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32VirHeight) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkMB_PIC_CAL_S),
        "::",
        stringify!(u32VirHeight)
        )
    );
}

pub type MB_PIC_CAL_S = rkMB_PIC_CAL_S;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkPIC_BUF_ATTR_S {
    pub u32Width: RK_U32,
    pub u32Height: RK_U32,
    pub enPixelFormat: PIXEL_FORMAT_E,
    pub enCompMode: COMPRESS_MODE_E,
}

#[test]
fn bindgen_test_layout_rkPIC_BUF_ATTR_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkPIC_BUF_ATTR_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkPIC_BUF_ATTR_S>(),
        16usize,
        concat!("Size of: ", stringify!(rkPIC_BUF_ATTR_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkPIC_BUF_ATTR_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkPIC_BUF_ATTR_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32Width) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkPIC_BUF_ATTR_S),
        "::",
        stringify!(u32Width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32Height) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkPIC_BUF_ATTR_S),
        "::",
        stringify!(u32Height)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enPixelFormat) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkPIC_BUF_ATTR_S),
        "::",
        stringify!(enPixelFormat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enCompMode) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(rkPIC_BUF_ATTR_S),
        "::",
        stringify!(enCompMode)
        )
    );
}

impl Default for rkPIC_BUF_ATTR_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type PIC_BUF_ATTR_S = rkPIC_BUF_ATTR_S;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkVDEC_PIC_BUF_ATTR_S {
    pub enCodecType: RK_CODEC_ID_E,
    pub stPicBufAttr: PIC_BUF_ATTR_S,
}

#[test]
fn bindgen_test_layout_rkVDEC_PIC_BUF_ATTR_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkVDEC_PIC_BUF_ATTR_S> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkVDEC_PIC_BUF_ATTR_S>(),
        20usize,
        concat!("Size of: ", stringify!(rkVDEC_PIC_BUF_ATTR_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkVDEC_PIC_BUF_ATTR_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkVDEC_PIC_BUF_ATTR_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enCodecType) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVDEC_PIC_BUF_ATTR_S),
        "::",
        stringify!(enCodecType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stPicBufAttr) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVDEC_PIC_BUF_ATTR_S),
        "::",
        stringify!(stPicBufAttr)
        )
    );
}

impl Default for rkVDEC_PIC_BUF_ATTR_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type VDEC_PIC_BUF_ATTR_S = rkVDEC_PIC_BUF_ATTR_S;

#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct rkBITMAP_S {
    pub enPixelFormat: PIXEL_FORMAT_E,
    pub u32Width: RK_U32,
    pub u32Height: RK_U32,
    pub __bindgen_padding_0: u32,
    pub pData: *mut ::std::os::raw::c_void,
}

#[test]
fn bindgen_test_layout_rkBITMAP_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkBITMAP_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkBITMAP_S>(),
        32usize,
        concat!("Size of: ", stringify!(rkBITMAP_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkBITMAP_S>(),
        16usize,
        concat!("Alignment of ", stringify!(rkBITMAP_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enPixelFormat) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkBITMAP_S),
        "::",
        stringify!(enPixelFormat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32Width) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkBITMAP_S),
        "::",
        stringify!(u32Width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32Height) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkBITMAP_S),
        "::",
        stringify!(u32Height)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pData) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(rkBITMAP_S),
        "::",
        stringify!(pData)
        )
    );
}

impl Default for rkBITMAP_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type BITMAP_S = rkBITMAP_S;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkLDC_ATTR_S {
    pub bAspect: RK_BOOL,
    pub s32XRatio: RK_S32,
    pub s32YRatio: RK_S32,
    pub s32XYRatio: RK_S32,
    pub s32CenterXOffset: RK_S32,
    pub s32CenterYOffset: RK_S32,
    pub s32DistortionRatio: RK_S32,
}

#[test]
fn bindgen_test_layout_rkLDC_ATTR_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkLDC_ATTR_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkLDC_ATTR_S>(),
        28usize,
        concat!("Size of: ", stringify!(rkLDC_ATTR_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkLDC_ATTR_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkLDC_ATTR_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bAspect) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkLDC_ATTR_S),
        "::",
        stringify!(bAspect)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32XRatio) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkLDC_ATTR_S),
        "::",
        stringify!(s32XRatio)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32YRatio) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkLDC_ATTR_S),
        "::",
        stringify!(s32YRatio)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32XYRatio) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(rkLDC_ATTR_S),
        "::",
        stringify!(s32XYRatio)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32CenterXOffset) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(rkLDC_ATTR_S),
        "::",
        stringify!(s32CenterXOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32CenterYOffset) as usize - ptr as usize },
        20usize,
        concat!(
        "Offset of field: ",
        stringify!(rkLDC_ATTR_S),
        "::",
        stringify!(s32CenterYOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32DistortionRatio) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(rkLDC_ATTR_S),
        "::",
        stringify!(s32DistortionRatio)
        )
    );
}

impl Default for rkLDC_ATTR_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type LDC_ATTR_S = rkLDC_ATTR_S;

#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rkLDCV2_ATTR_S {
    pub s32FocalLenX: RK_S32,
    pub s32FocalLenY: RK_S32,
    pub s32CoorShiftX: RK_S32,
    pub s32CoorShiftY: RK_S32,
    pub as32SrcCaliRatio: [[RK_S32; 4usize]; 2usize],
    pub s32SrcJunPt: RK_S32,
    pub as32DstCaliRatio: [[RK_S32; 4usize]; 3usize],
    pub as32DstJunPt: [RK_S32; 2usize],
    pub s32MaxDu: RK_S32,
}

#[test]
fn bindgen_test_layout_rkLDCV2_ATTR_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkLDCV2_ATTR_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkLDCV2_ATTR_S>(),
        112usize,
        concat!("Size of: ", stringify!(rkLDCV2_ATTR_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkLDCV2_ATTR_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkLDCV2_ATTR_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32FocalLenX) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkLDCV2_ATTR_S),
        "::",
        stringify!(s32FocalLenX)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32FocalLenY) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkLDCV2_ATTR_S),
        "::",
        stringify!(s32FocalLenY)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32CoorShiftX) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkLDCV2_ATTR_S),
        "::",
        stringify!(s32CoorShiftX)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32CoorShiftY) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(rkLDCV2_ATTR_S),
        "::",
        stringify!(s32CoorShiftY)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).as32SrcCaliRatio) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(rkLDCV2_ATTR_S),
        "::",
        stringify!(as32SrcCaliRatio)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32SrcJunPt) as usize - ptr as usize },
        48usize,
        concat!(
        "Offset of field: ",
        stringify!(rkLDCV2_ATTR_S),
        "::",
        stringify!(s32SrcJunPt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).as32DstCaliRatio) as usize - ptr as usize },
        52usize,
        concat!(
        "Offset of field: ",
        stringify!(rkLDCV2_ATTR_S),
        "::",
        stringify!(as32DstCaliRatio)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).as32DstJunPt) as usize - ptr as usize },
        100usize,
        concat!(
        "Offset of field: ",
        stringify!(rkLDCV2_ATTR_S),
        "::",
        stringify!(as32DstJunPt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32MaxDu) as usize - ptr as usize },
        108usize,
        concat!(
        "Offset of field: ",
        stringify!(rkLDCV2_ATTR_S),
        "::",
        stringify!(s32MaxDu)
        )
    );
}

pub type LDCV2_ATTR_S = rkLDCV2_ATTR_S;

pub const rkLDC_VIEW_TYPE_E_LDC_VIEW_TYPE_ALL: rkLDC_VIEW_TYPE_E = 0;
pub const rkLDC_VIEW_TYPE_E_LDC_VIEW_TYPE_CROP: rkLDC_VIEW_TYPE_E = 1;
pub const rkLDC_VIEW_TYPE_E_LDC_VIEW_TYPE_BUTT: rkLDC_VIEW_TYPE_E = 2;

pub type rkLDC_VIEW_TYPE_E = ::std::os::raw::c_uint;

pub use self::rkLDC_VIEW_TYPE_E as LDC_VIEW_TYPE_E;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkLDCV3_ATTR_S {
    pub enViewType: LDC_VIEW_TYPE_E,
    pub s32CenterXOffset: RK_S32,
    pub s32CenterYOffset: RK_S32,
    pub s32DistortionRatio: RK_S32,
    pub s32MinRatio: RK_S32,
}

#[test]
fn bindgen_test_layout_rkLDCV3_ATTR_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkLDCV3_ATTR_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkLDCV3_ATTR_S>(),
        20usize,
        concat!("Size of: ", stringify!(rkLDCV3_ATTR_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkLDCV3_ATTR_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkLDCV3_ATTR_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enViewType) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkLDCV3_ATTR_S),
        "::",
        stringify!(enViewType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32CenterXOffset) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkLDCV3_ATTR_S),
        "::",
        stringify!(s32CenterXOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32CenterYOffset) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkLDCV3_ATTR_S),
        "::",
        stringify!(s32CenterYOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32DistortionRatio) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(rkLDCV3_ATTR_S),
        "::",
        stringify!(s32DistortionRatio)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32MinRatio) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(rkLDCV3_ATTR_S),
        "::",
        stringify!(s32MinRatio)
        )
    );
}

impl Default for rkLDCV3_ATTR_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type LDCV3_ATTR_S = rkLDCV3_ATTR_S;

pub const rkROTATION_VIEW_TYPE_E_ROTATION_VIEW_TYPE_ALL: rkROTATION_VIEW_TYPE_E = 0;
pub const rkROTATION_VIEW_TYPE_E_ROTATION_VIEW_TYPE_TYPICAL: rkROTATION_VIEW_TYPE_E = 1;
pub const rkROTATION_VIEW_TYPE_E_ROTATION_VIEW_TYPE_INSIDE: rkROTATION_VIEW_TYPE_E = 2;
pub const rkROTATION_VIEW_TYPE_E_ROTATION_VIEW_TYPE_BUTT: rkROTATION_VIEW_TYPE_E = 3;

pub type rkROTATION_VIEW_TYPE_E = ::std::os::raw::c_uint;

pub use self::rkROTATION_VIEW_TYPE_E as ROTATION_VIEW_TYPE_E;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkROTATION_EX_S {
    pub enViewType: ROTATION_VIEW_TYPE_E,
    pub u32Angle: RK_U32,
    pub s32CenterXOffset: RK_S32,
    pub s32CenterYOffset: RK_S32,
    pub stDestSize: SIZE_S,
}

#[test]
fn bindgen_test_layout_rkROTATION_EX_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkROTATION_EX_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkROTATION_EX_S>(),
        24usize,
        concat!("Size of: ", stringify!(rkROTATION_EX_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkROTATION_EX_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkROTATION_EX_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enViewType) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkROTATION_EX_S),
        "::",
        stringify!(enViewType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32Angle) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkROTATION_EX_S),
        "::",
        stringify!(u32Angle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32CenterXOffset) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkROTATION_EX_S),
        "::",
        stringify!(s32CenterXOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32CenterYOffset) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(rkROTATION_EX_S),
        "::",
        stringify!(s32CenterYOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stDestSize) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(rkROTATION_EX_S),
        "::",
        stringify!(stDestSize)
        )
    );
}

impl Default for rkROTATION_EX_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type ROTATION_EX_S = rkROTATION_EX_S;

pub const rkWDR_MODE_E_WDR_MODE_NONE: rkWDR_MODE_E = 0;
pub const rkWDR_MODE_E_WDR_MODE_BUILT_IN: rkWDR_MODE_E = 1;
pub const rkWDR_MODE_E_WDR_MODE_QUDRA: rkWDR_MODE_E = 2;
pub const rkWDR_MODE_E_WDR_MODE_2To1_LINE: rkWDR_MODE_E = 3;
pub const rkWDR_MODE_E_WDR_MODE_2To1_FRAME: rkWDR_MODE_E = 4;
pub const rkWDR_MODE_E_WDR_MODE_2To1_FRAME_FULL_RATE: rkWDR_MODE_E = 5;
pub const rkWDR_MODE_E_WDR_MODE_3To1_LINE: rkWDR_MODE_E = 6;
pub const rkWDR_MODE_E_WDR_MODE_3To1_FRAME: rkWDR_MODE_E = 7;
pub const rkWDR_MODE_E_WDR_MODE_3To1_FRAME_FULL_RATE: rkWDR_MODE_E = 8;
pub const rkWDR_MODE_E_WDR_MODE_4To1_LINE: rkWDR_MODE_E = 9;
pub const rkWDR_MODE_E_WDR_MODE_4To1_FRAME: rkWDR_MODE_E = 10;
pub const rkWDR_MODE_E_WDR_MODE_4To1_FRAME_FULL_RATE: rkWDR_MODE_E = 11;
pub const rkWDR_MODE_E_WDR_MODE_BUTT: rkWDR_MODE_E = 12;

pub type rkWDR_MODE_E = ::std::os::raw::c_uint;

pub use self::rkWDR_MODE_E as WDR_MODE_E;

pub const rkFRAME_INTERRUPT_TYPE_E_FRAME_INTERRUPT_START: rkFRAME_INTERRUPT_TYPE_E = 0;
pub const rkFRAME_INTERRUPT_TYPE_E_FRAME_INTERRUPT_EARLY: rkFRAME_INTERRUPT_TYPE_E = 1;
pub const rkFRAME_INTERRUPT_TYPE_E_FRAME_INTERRUPT_EARLY_END: rkFRAME_INTERRUPT_TYPE_E = 2;
pub const rkFRAME_INTERRUPT_TYPE_E_FRAME_INTERRUPT_BUTT: rkFRAME_INTERRUPT_TYPE_E = 3;

pub type rkFRAME_INTERRUPT_TYPE_E = ::std::os::raw::c_uint;

pub use self::rkFRAME_INTERRUPT_TYPE_E as FRAME_INTERRUPT_TYPE_E;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkFRAME_INTERRUPT_ATTR_S {
    pub enIntType: FRAME_INTERRUPT_TYPE_E,
    pub u32EarlyLine: RK_U32,
}

#[test]
fn bindgen_test_layout_rkFRAME_INTERRUPT_ATTR_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkFRAME_INTERRUPT_ATTR_S> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkFRAME_INTERRUPT_ATTR_S>(),
        8usize,
        concat!("Size of: ", stringify!(rkFRAME_INTERRUPT_ATTR_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkFRAME_INTERRUPT_ATTR_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkFRAME_INTERRUPT_ATTR_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enIntType) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkFRAME_INTERRUPT_ATTR_S),
        "::",
        stringify!(enIntType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32EarlyLine) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkFRAME_INTERRUPT_ATTR_S),
        "::",
        stringify!(u32EarlyLine)
        )
    );
}

impl Default for rkFRAME_INTERRUPT_ATTR_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type FRAME_INTERRUPT_ATTR_S = rkFRAME_INTERRUPT_ATTR_S;

pub const rkAVS_LUT_ACCURACY_E_AVS_LUT_ACCURACY_HIGH: rkAVS_LUT_ACCURACY_E = 0;
pub const rkAVS_LUT_ACCURACY_E_AVS_LUT_ACCURACY_LOW: rkAVS_LUT_ACCURACY_E = 1;
pub const rkAVS_LUT_ACCURACY_E_AVS_LUT_ACCURACY_BUTT: rkAVS_LUT_ACCURACY_E = 2;

pub type rkAVS_LUT_ACCURACY_E = ::std::os::raw::c_uint;

pub use self::rkAVS_LUT_ACCURACY_E as AVS_LUT_ACCURACY_E;

pub const rkAVS_LUT_STEP_E_AVS_LUT_STEP_HIGH: rkAVS_LUT_STEP_E = 0;
pub const rkAVS_LUT_STEP_E_AVS_LUT_STEP_MEDIUM: rkAVS_LUT_STEP_E = 1;
pub const rkAVS_LUT_STEP_E_AVS_LUT_STEP_LOW: rkAVS_LUT_STEP_E = 2;
pub const rkAVS_LUT_STEP_E_AVS_LUT_STEP_BUTT: rkAVS_LUT_STEP_E = 3;

pub type rkAVS_LUT_STEP_E = ::std::os::raw::c_uint;

pub use self::rkAVS_LUT_STEP_E as AVS_LUT_STEP_E;

pub const rkAVS_FUSE_WIDTH_E_AVS_FUSE_WIDTH_HIGH: rkAVS_FUSE_WIDTH_E = 0;
pub const rkAVS_FUSE_WIDTH_E_AVS_FUSE_WIDTH_MEDIUM: rkAVS_FUSE_WIDTH_E = 1;
pub const rkAVS_FUSE_WIDTH_E_AVS_FUSE_WIDTH_LOW: rkAVS_FUSE_WIDTH_E = 2;
pub const rkAVS_FUSE_WIDTH_E_AVS_FUSE_WIDTH_BUTT: rkAVS_FUSE_WIDTH_E = 3;

pub type rkAVS_FUSE_WIDTH_E = ::std::os::raw::c_uint;

pub use self::rkAVS_FUSE_WIDTH_E as AVS_FUSE_WIDTH_E;

pub const rkAVS_PROJECTION_MODE_E_AVS_PROJECTION_EQUIRECTANGULAR: rkAVS_PROJECTION_MODE_E = 0;
pub const rkAVS_PROJECTION_MODE_E_AVS_PROJECTION_RECTILINEAR: rkAVS_PROJECTION_MODE_E = 1;
pub const rkAVS_PROJECTION_MODE_E_AVS_PROJECTION_CYLINDRICAL: rkAVS_PROJECTION_MODE_E = 2;
pub const rkAVS_PROJECTION_MODE_E_AVS_PROJECTION_CUBE_MAP: rkAVS_PROJECTION_MODE_E = 3;
pub const rkAVS_PROJECTION_MODE_E_AVS_PROJECTION_EQUIRECTANGULAR_TRANS: rkAVS_PROJECTION_MODE_E = 4;
pub const rkAVS_PROJECTION_MODE_E_AVS_PROJECTION_BUTT: rkAVS_PROJECTION_MODE_E = 5;

pub type rkAVS_PROJECTION_MODE_E = ::std::os::raw::c_uint;

pub use self::rkAVS_PROJECTION_MODE_E as AVS_PROJECTION_MODE_E;

pub const rkAVS_GAIN_MODE_E_AVS_GAIN_MODE_MANUAL: rkAVS_GAIN_MODE_E = 0;
pub const rkAVS_GAIN_MODE_E_AVS_GAIN_MODE_AUTO: rkAVS_GAIN_MODE_E = 1;
pub const rkAVS_GAIN_MODE_E_AVS_GAIN_MODE_BUTT: rkAVS_GAIN_MODE_E = 2;

pub type rkAVS_GAIN_MODE_E = ::std::os::raw::c_uint;

pub use self::rkAVS_GAIN_MODE_E as AVS_GAIN_MODE_E;

pub const rkAVS_MODE_E_AVS_MODE_BLEND: rkAVS_MODE_E = 0;
pub const rkAVS_MODE_E_AVS_MODE_NOBLEND_VER: rkAVS_MODE_E = 1;
pub const rkAVS_MODE_E_AVS_MODE_NOBLEND_HOR: rkAVS_MODE_E = 2;
pub const rkAVS_MODE_E_AVS_MODE_NOBLEND_QR: rkAVS_MODE_E = 3;
pub const rkAVS_MODE_E_AVS_MODE_BUTT: rkAVS_MODE_E = 4;

pub type rkAVS_MODE_E = ::std::os::raw::c_uint;

pub use self::rkAVS_MODE_E as AVS_MODE_E;

pub const rkAVS_PARAM_SOURCE_E_AVS_PARAM_SOURCE_LUT: rkAVS_PARAM_SOURCE_E = 0;
pub const rkAVS_PARAM_SOURCE_E_AVS_PARAM_SOURCE_CALIB: rkAVS_PARAM_SOURCE_E = 1;
pub const rkAVS_PARAM_SOURCE_E_AVS_PARAM_SOURCE_MODE_BUT: rkAVS_PARAM_SOURCE_E = 2;

pub type rkAVS_PARAM_SOURCE_E = ::std::os::raw::c_uint;

pub use self::rkAVS_PARAM_SOURCE_E as AVS_PARAM_SOURCE_E;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkAVS_GAIN_ATTR_S {
    pub enMode: AVS_GAIN_MODE_E,
    pub s32Coef: [RK_S32; 2usize],
}

#[test]
fn bindgen_test_layout_rkAVS_GAIN_ATTR_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkAVS_GAIN_ATTR_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAVS_GAIN_ATTR_S>(),
        12usize,
        concat!("Size of: ", stringify!(rkAVS_GAIN_ATTR_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAVS_GAIN_ATTR_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkAVS_GAIN_ATTR_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enMode) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_GAIN_ATTR_S),
        "::",
        stringify!(enMode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32Coef) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_GAIN_ATTR_S),
        "::",
        stringify!(s32Coef)
        )
    );
}

impl Default for rkAVS_GAIN_ATTR_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type AVS_GAIN_ATTR_S = rkAVS_GAIN_ATTR_S;

#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rkAVS_ROTATION_S {
    pub s32Yaw: RK_S32,
    pub s32Pitch: RK_S32,
    pub s32Roll: RK_S32,
}

#[test]
fn bindgen_test_layout_rkAVS_ROTATION_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkAVS_ROTATION_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAVS_ROTATION_S>(),
        12usize,
        concat!("Size of: ", stringify!(rkAVS_ROTATION_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAVS_ROTATION_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkAVS_ROTATION_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32Yaw) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_ROTATION_S),
        "::",
        stringify!(s32Yaw)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32Pitch) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_ROTATION_S),
        "::",
        stringify!(s32Pitch)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32Roll) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_ROTATION_S),
        "::",
        stringify!(s32Roll)
        )
    );
}

pub type AVS_ROTATION_S = rkAVS_ROTATION_S;

#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rkAVS_FOV_S {
    pub u32FOVX: RK_U32,
    pub u32FOVY: RK_U32,
}

#[test]
fn bindgen_test_layout_rkAVS_FOV_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkAVS_FOV_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAVS_FOV_S>(),
        8usize,
        concat!("Size of: ", stringify!(rkAVS_FOV_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAVS_FOV_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkAVS_FOV_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32FOVX) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_FOV_S),
        "::",
        stringify!(u32FOVX)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32FOVY) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_FOV_S),
        "::",
        stringify!(u32FOVY)
        )
    );
}

pub type AVS_FOV_S = rkAVS_FOV_S;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkAVS_LUT_STEP_S {
    pub enStepX: AVS_LUT_STEP_E,
    pub enStepY: AVS_LUT_STEP_E,
}

#[test]
fn bindgen_test_layout_rkAVS_LUT_STEP_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkAVS_LUT_STEP_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAVS_LUT_STEP_S>(),
        8usize,
        concat!("Size of: ", stringify!(rkAVS_LUT_STEP_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAVS_LUT_STEP_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkAVS_LUT_STEP_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enStepX) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_LUT_STEP_S),
        "::",
        stringify!(enStepX)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enStepY) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_LUT_STEP_S),
        "::",
        stringify!(enStepY)
        )
    );
}

impl Default for rkAVS_LUT_STEP_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type AVS_STEP_ATTR_S = rkAVS_LUT_STEP_S;

#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rkAVS_SPLIT_ATTR_S {
    pub u32PipeNum: RK_U32,
    pub AVSPipe: [AVS_PIPE; 6usize],
}

#[test]
fn bindgen_test_layout_rkAVS_SPLIT_ATTR_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkAVS_SPLIT_ATTR_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAVS_SPLIT_ATTR_S>(),
        28usize,
        concat!("Size of: ", stringify!(rkAVS_SPLIT_ATTR_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAVS_SPLIT_ATTR_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkAVS_SPLIT_ATTR_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32PipeNum) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_SPLIT_ATTR_S),
        "::",
        stringify!(u32PipeNum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AVSPipe) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_SPLIT_ATTR_S),
        "::",
        stringify!(AVSPipe)
        )
    );
}

pub type AVS_SPLIT_ATTR_S = rkAVS_SPLIT_ATTR_S;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkAVS_CUBE_MAP_ATTR_S {
    pub bBgColor: RK_BOOL,
    pub u32BgColor: RK_U32,
    pub u32SurfaceLength: RK_U32,
    pub stStartPoint: [POINT_S; 6usize],
}

#[test]
fn bindgen_test_layout_rkAVS_CUBE_MAP_ATTR_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkAVS_CUBE_MAP_ATTR_S> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAVS_CUBE_MAP_ATTR_S>(),
        60usize,
        concat!("Size of: ", stringify!(rkAVS_CUBE_MAP_ATTR_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAVS_CUBE_MAP_ATTR_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkAVS_CUBE_MAP_ATTR_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bBgColor) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_CUBE_MAP_ATTR_S),
        "::",
        stringify!(bBgColor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32BgColor) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_CUBE_MAP_ATTR_S),
        "::",
        stringify!(u32BgColor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32SurfaceLength) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_CUBE_MAP_ATTR_S),
        "::",
        stringify!(u32SurfaceLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stStartPoint) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_CUBE_MAP_ATTR_S),
        "::",
        stringify!(stStartPoint)
        )
    );
}

impl Default for rkAVS_CUBE_MAP_ATTR_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type AVS_CUBE_MAP_ATTR_S = rkAVS_CUBE_MAP_ATTR_S;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkAVS_LUT_S {
    pub enAccuracy: AVS_LUT_ACCURACY_E,
    pub enFuseWidth: AVS_FUSE_WIDTH_E,
    pub stLutStep: AVS_STEP_ATTR_S,
    pub pVirAddr: [*mut ::std::os::raw::c_void; 2usize],
}

#[test]
fn bindgen_test_layout_rkAVS_LUT_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkAVS_LUT_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAVS_LUT_S>(),
        24usize,
        concat!("Size of: ", stringify!(rkAVS_LUT_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAVS_LUT_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkAVS_LUT_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enAccuracy) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_LUT_S),
        "::",
        stringify!(enAccuracy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enFuseWidth) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_LUT_S),
        "::",
        stringify!(enFuseWidth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stLutStep) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_LUT_S),
        "::",
        stringify!(stLutStep)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVirAddr) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_LUT_S),
        "::",
        stringify!(pVirAddr)
        )
    );
}

impl Default for rkAVS_LUT_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type AVS_LUT_S = rkAVS_LUT_S;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkAVS_CALIB_S {
    pub pCalibFilePath: *const RK_CHAR,
    pub pMeshAlphaPath: *const RK_CHAR,
}

#[test]
fn bindgen_test_layout_rkAVS_CALIB_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkAVS_CALIB_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAVS_CALIB_S>(),
        8usize,
        concat!("Size of: ", stringify!(rkAVS_CALIB_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAVS_CALIB_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkAVS_CALIB_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pCalibFilePath) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_CALIB_S),
        "::",
        stringify!(pCalibFilePath)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pMeshAlphaPath) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_CALIB_S),
        "::",
        stringify!(pMeshAlphaPath)
        )
    );
}

impl Default for rkAVS_CALIB_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type AVS_CALIB_S = rkAVS_CALIB_S;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkAVS_FINAL_LUT_S {
    pub pMeshBlk: [MB_BLK; 2usize],
    pub pAlphaBlk: [MB_BLK; 2usize],
    pub pLdchBlk: [MB_BLK; 2usize],
    pub pParamBlk: [MB_BLK; 2usize],
}

#[test]
fn bindgen_test_layout_rkAVS_FINAL_LUT_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkAVS_FINAL_LUT_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAVS_FINAL_LUT_S>(),
        32usize,
        concat!("Size of: ", stringify!(rkAVS_FINAL_LUT_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAVS_FINAL_LUT_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkAVS_FINAL_LUT_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pMeshBlk) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_FINAL_LUT_S),
        "::",
        stringify!(pMeshBlk)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pAlphaBlk) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_FINAL_LUT_S),
        "::",
        stringify!(pAlphaBlk)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pLdchBlk) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_FINAL_LUT_S),
        "::",
        stringify!(pLdchBlk)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pParamBlk) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_FINAL_LUT_S),
        "::",
        stringify!(pParamBlk)
        )
    );
}

impl Default for rkAVS_FINAL_LUT_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type AVS_FINAL_LUT_S = rkAVS_FINAL_LUT_S;

#[repr(C)]
#[derive(Copy, Clone)]
pub struct rkAVS_INPUT_ATTR_S {
    pub enParamSource: AVS_PARAM_SOURCE_E,
    pub __bindgen_anon_1: rkAVS_INPUT_ATTR_S__bindgen_ty_1,
    pub stSize: SIZE_S,
}

#[repr(C)]
#[derive(Copy, Clone)]
pub union rkAVS_INPUT_ATTR_S__bindgen_ty_1 {
    pub stLUT: AVS_LUT_S,
    pub stCalib: AVS_CALIB_S,
}

#[test]
fn bindgen_test_layout_rkAVS_INPUT_ATTR_S__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<rkAVS_INPUT_ATTR_S__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAVS_INPUT_ATTR_S__bindgen_ty_1>(),
        24usize,
        concat!("Size of: ", stringify!(rkAVS_INPUT_ATTR_S__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAVS_INPUT_ATTR_S__bindgen_ty_1>(),
        4usize,
        concat!(
        "Alignment of ",
        stringify!(rkAVS_INPUT_ATTR_S__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stLUT) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_INPUT_ATTR_S__bindgen_ty_1),
        "::",
        stringify!(stLUT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stCalib) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_INPUT_ATTR_S__bindgen_ty_1),
        "::",
        stringify!(stCalib)
        )
    );
}

impl Default for rkAVS_INPUT_ATTR_S__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

#[test]
fn bindgen_test_layout_rkAVS_INPUT_ATTR_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkAVS_INPUT_ATTR_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAVS_INPUT_ATTR_S>(),
        36usize,
        concat!("Size of: ", stringify!(rkAVS_INPUT_ATTR_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAVS_INPUT_ATTR_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkAVS_INPUT_ATTR_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enParamSource) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_INPUT_ATTR_S),
        "::",
        stringify!(enParamSource)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stSize) as usize - ptr as usize },
        28usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_INPUT_ATTR_S),
        "::",
        stringify!(stSize)
        )
    );
}

impl Default for rkAVS_INPUT_ATTR_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type AVS_INPUT_ATTR_S = rkAVS_INPUT_ATTR_S;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkAVS_OUTPUT_ATTR_S {
    pub enPrjMode: AVS_PROJECTION_MODE_E,
    pub stCenter: POINT_S,
    pub stFOV: AVS_FOV_S,
    pub stORIRotation: AVS_ROTATION_S,
    pub stRotation: AVS_ROTATION_S,
    pub stSplitAttr: [AVS_SPLIT_ATTR_S; 2usize],
    pub stCubeMapAttr: AVS_CUBE_MAP_ATTR_S,
    pub stSize: SIZE_S,
    pub fDistance: RK_FLOAT,
}

#[test]
fn bindgen_test_layout_rkAVS_OUTPUT_ATTR_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkAVS_OUTPUT_ATTR_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAVS_OUTPUT_ATTR_S>(),
        172usize,
        concat!("Size of: ", stringify!(rkAVS_OUTPUT_ATTR_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAVS_OUTPUT_ATTR_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkAVS_OUTPUT_ATTR_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enPrjMode) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_OUTPUT_ATTR_S),
        "::",
        stringify!(enPrjMode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stCenter) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_OUTPUT_ATTR_S),
        "::",
        stringify!(stCenter)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stFOV) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_OUTPUT_ATTR_S),
        "::",
        stringify!(stFOV)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stORIRotation) as usize - ptr as usize },
        20usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_OUTPUT_ATTR_S),
        "::",
        stringify!(stORIRotation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stRotation) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_OUTPUT_ATTR_S),
        "::",
        stringify!(stRotation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stSplitAttr) as usize - ptr as usize },
        44usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_OUTPUT_ATTR_S),
        "::",
        stringify!(stSplitAttr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stCubeMapAttr) as usize - ptr as usize },
        100usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_OUTPUT_ATTR_S),
        "::",
        stringify!(stCubeMapAttr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stSize) as usize - ptr as usize },
        160usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_OUTPUT_ATTR_S),
        "::",
        stringify!(stSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fDistance) as usize - ptr as usize },
        168usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_OUTPUT_ATTR_S),
        "::",
        stringify!(fDistance)
        )
    );
}

impl Default for rkAVS_OUTPUT_ATTR_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type AVS_OUTPUT_ATTR_S = rkAVS_OUTPUT_ATTR_S;

#[repr(C)]
#[derive(Copy, Clone)]
pub struct rkAVS_GRP_ATTR_S {
    pub enMode: AVS_MODE_E,
    pub u32PipeNum: RK_U32,
    pub bSyncPipe: RK_BOOL,
    pub stInAttr: AVS_INPUT_ATTR_S,
    pub stGainAttr: AVS_GAIN_ATTR_S,
    pub u64BBoxPhyAddr: [RK_U64; 2usize],
    pub stOutAttr: AVS_OUTPUT_ATTR_S,
    pub stFrameRate: FRAME_RATE_CTRL_S,
}

#[test]
fn bindgen_test_layout_rkAVS_GRP_ATTR_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkAVS_GRP_ATTR_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAVS_GRP_ATTR_S>(),
        264usize,
        concat!("Size of: ", stringify!(rkAVS_GRP_ATTR_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAVS_GRP_ATTR_S>(),
        8usize,
        concat!("Alignment of ", stringify!(rkAVS_GRP_ATTR_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enMode) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_GRP_ATTR_S),
        "::",
        stringify!(enMode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32PipeNum) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_GRP_ATTR_S),
        "::",
        stringify!(u32PipeNum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bSyncPipe) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_GRP_ATTR_S),
        "::",
        stringify!(bSyncPipe)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stInAttr) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_GRP_ATTR_S),
        "::",
        stringify!(stInAttr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stGainAttr) as usize - ptr as usize },
        48usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_GRP_ATTR_S),
        "::",
        stringify!(stGainAttr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u64BBoxPhyAddr) as usize - ptr as usize },
        64usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_GRP_ATTR_S),
        "::",
        stringify!(u64BBoxPhyAddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stOutAttr) as usize - ptr as usize },
        80usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_GRP_ATTR_S),
        "::",
        stringify!(stOutAttr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stFrameRate) as usize - ptr as usize },
        252usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_GRP_ATTR_S),
        "::",
        stringify!(stFrameRate)
        )
    );
}

impl Default for rkAVS_GRP_ATTR_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type AVS_GRP_ATTR_S = rkAVS_GRP_ATTR_S;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkAVS_CHN_ATTR_S {
    pub u32Width: RK_U32,
    pub u32Height: RK_U32,
    pub enCompressMode: COMPRESS_MODE_E,
    pub enDynamicRange: DYNAMIC_RANGE_E,
    pub u32Depth: RK_U32,
    pub stFrameRate: FRAME_RATE_CTRL_S,
    pub u32FrameBufCnt: RK_U32,
}

#[test]
fn bindgen_test_layout_rkAVS_CHN_ATTR_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkAVS_CHN_ATTR_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAVS_CHN_ATTR_S>(),
        32usize,
        concat!("Size of: ", stringify!(rkAVS_CHN_ATTR_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAVS_CHN_ATTR_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkAVS_CHN_ATTR_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32Width) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_CHN_ATTR_S),
        "::",
        stringify!(u32Width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32Height) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_CHN_ATTR_S),
        "::",
        stringify!(u32Height)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enCompressMode) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_CHN_ATTR_S),
        "::",
        stringify!(enCompressMode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enDynamicRange) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_CHN_ATTR_S),
        "::",
        stringify!(enDynamicRange)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32Depth) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_CHN_ATTR_S),
        "::",
        stringify!(u32Depth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stFrameRate) as usize - ptr as usize },
        20usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_CHN_ATTR_S),
        "::",
        stringify!(stFrameRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32FrameBufCnt) as usize - ptr as usize },
        28usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_CHN_ATTR_S),
        "::",
        stringify!(u32FrameBufCnt)
        )
    );
}

impl Default for rkAVS_CHN_ATTR_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type AVS_CHN_ATTR_S = rkAVS_CHN_ATTR_S;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkAVS_MOD_PARAM_S {
    pub u32WorkingSetSize: RK_U32,
    pub enMBSource: MB_SOURCE_E,
}

#[test]
fn bindgen_test_layout_rkAVS_MOD_PARAM_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkAVS_MOD_PARAM_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkAVS_MOD_PARAM_S>(),
        8usize,
        concat!("Size of: ", stringify!(rkAVS_MOD_PARAM_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkAVS_MOD_PARAM_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkAVS_MOD_PARAM_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32WorkingSetSize) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_MOD_PARAM_S),
        "::",
        stringify!(u32WorkingSetSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enMBSource) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkAVS_MOD_PARAM_S),
        "::",
        stringify!(enMBSource)
        )
    );
}

impl Default for rkAVS_MOD_PARAM_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type AVS_MOD_PARAM_S = rkAVS_MOD_PARAM_S;

pub const rkIVS_MODE_E_IVS_MODE_MD: rkIVS_MODE_E = 1;
pub const rkIVS_MODE_E_IVS_MODE_OD: rkIVS_MODE_E = 2;
pub const rkIVS_MODE_E_IVS_MODE_MD_OD: rkIVS_MODE_E = 3;
pub const rkIVS_MODE_E_IVS_MODE_BUTT: rkIVS_MODE_E = 4;

pub type rkIVS_MODE_E = ::std::os::raw::c_uint;

pub use self::rkIVS_MODE_E as IVS_MODE_E;

#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rkIVS_AREA_S {
    pub u32PointNum: RK_U32,
    pub points: [POINT_S; 6usize],
}

#[test]
fn bindgen_test_layout_rkIVS_AREA_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkIVS_AREA_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkIVS_AREA_S>(),
        52usize,
        concat!("Size of: ", stringify!(rkIVS_AREA_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkIVS_AREA_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkIVS_AREA_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32PointNum) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkIVS_AREA_S),
        "::",
        stringify!(u32PointNum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).points) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkIVS_AREA_S),
        "::",
        stringify!(points)
        )
    );
}

pub type IVS_AREA_S = rkIVS_AREA_S;

#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rkIVS_AREAS_S {
    pub u32AreaNum: RK_U32,
    pub areas: [IVS_AREA_S; 16usize],
}

#[test]
fn bindgen_test_layout_rkIVS_AREAS_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkIVS_AREAS_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkIVS_AREAS_S>(),
        836usize,
        concat!("Size of: ", stringify!(rkIVS_AREAS_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkIVS_AREAS_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkIVS_AREAS_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32AreaNum) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkIVS_AREAS_S),
        "::",
        stringify!(u32AreaNum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).areas) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkIVS_AREAS_S),
        "::",
        stringify!(areas)
        )
    );
}

pub type IVS_AREAS_S = rkIVS_AREAS_S;

#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rkIVS_DET_ATTR_S {
    pub stDetArea: IVS_AREAS_S,
}

#[test]
fn bindgen_test_layout_rkIVS_DET_ATTR_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkIVS_DET_ATTR_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkIVS_DET_ATTR_S>(),
        836usize,
        concat!("Size of: ", stringify!(rkIVS_DET_ATTR_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkIVS_DET_ATTR_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkIVS_DET_ATTR_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stDetArea) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkIVS_DET_ATTR_S),
        "::",
        stringify!(stDetArea)
        )
    );
}

pub type IVS_DET_ATTR_S = rkIVS_DET_ATTR_S;

#[repr(C)]
#[derive(Copy, Clone)]
pub struct rkIVS_CHN_ATTR_S {
    pub enMode: IVS_MODE_E,
    pub u32PicWidth: RK_U32,
    pub u32PicHeight: RK_U32,
    pub enPixelFormat: PIXEL_FORMAT_E,
    pub enRotation: ROTATION_E,
    pub enMirror: MIRROR_E,
    pub bTraceClose: RK_BOOL,
    pub s32Gop: RK_S32,
    pub bSmearEnable: RK_BOOL,
    pub bWeightpEnable: RK_BOOL,
    pub bMDEnable: RK_BOOL,
    pub s32MDInterval: RK_S32,
    pub bMDNightMode: RK_BOOL,
    pub u32MDSensibility: RK_U32,
    pub bODEnable: RK_BOOL,
    pub s32ODInterval: RK_S32,
    pub s32ODPercent: RK_S32,
    pub __bindgen_anon_1: rkIVS_CHN_ATTR_S__bindgen_ty_1,
}

#[repr(C)]
#[derive(Copy, Clone)]
pub union rkIVS_CHN_ATTR_S__bindgen_ty_1 {
    pub stDetAttr: IVS_DET_ATTR_S,
}

#[test]
fn bindgen_test_layout_rkIVS_CHN_ATTR_S__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<rkIVS_CHN_ATTR_S__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkIVS_CHN_ATTR_S__bindgen_ty_1>(),
        836usize,
        concat!("Size of: ", stringify!(rkIVS_CHN_ATTR_S__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<rkIVS_CHN_ATTR_S__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(rkIVS_CHN_ATTR_S__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stDetAttr) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkIVS_CHN_ATTR_S__bindgen_ty_1),
        "::",
        stringify!(stDetAttr)
        )
    );
}

impl Default for rkIVS_CHN_ATTR_S__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

#[test]
fn bindgen_test_layout_rkIVS_CHN_ATTR_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkIVS_CHN_ATTR_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkIVS_CHN_ATTR_S>(),
        904usize,
        concat!("Size of: ", stringify!(rkIVS_CHN_ATTR_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkIVS_CHN_ATTR_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkIVS_CHN_ATTR_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enMode) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkIVS_CHN_ATTR_S),
        "::",
        stringify!(enMode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32PicWidth) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkIVS_CHN_ATTR_S),
        "::",
        stringify!(u32PicWidth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32PicHeight) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkIVS_CHN_ATTR_S),
        "::",
        stringify!(u32PicHeight)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enPixelFormat) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(rkIVS_CHN_ATTR_S),
        "::",
        stringify!(enPixelFormat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enRotation) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(rkIVS_CHN_ATTR_S),
        "::",
        stringify!(enRotation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enMirror) as usize - ptr as usize },
        20usize,
        concat!(
        "Offset of field: ",
        stringify!(rkIVS_CHN_ATTR_S),
        "::",
        stringify!(enMirror)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bTraceClose) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(rkIVS_CHN_ATTR_S),
        "::",
        stringify!(bTraceClose)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32Gop) as usize - ptr as usize },
        28usize,
        concat!(
        "Offset of field: ",
        stringify!(rkIVS_CHN_ATTR_S),
        "::",
        stringify!(s32Gop)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bSmearEnable) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(rkIVS_CHN_ATTR_S),
        "::",
        stringify!(bSmearEnable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bWeightpEnable) as usize - ptr as usize },
        36usize,
        concat!(
        "Offset of field: ",
        stringify!(rkIVS_CHN_ATTR_S),
        "::",
        stringify!(bWeightpEnable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bMDEnable) as usize - ptr as usize },
        40usize,
        concat!(
        "Offset of field: ",
        stringify!(rkIVS_CHN_ATTR_S),
        "::",
        stringify!(bMDEnable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32MDInterval) as usize - ptr as usize },
        44usize,
        concat!(
        "Offset of field: ",
        stringify!(rkIVS_CHN_ATTR_S),
        "::",
        stringify!(s32MDInterval)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bMDNightMode) as usize - ptr as usize },
        48usize,
        concat!(
        "Offset of field: ",
        stringify!(rkIVS_CHN_ATTR_S),
        "::",
        stringify!(bMDNightMode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32MDSensibility) as usize - ptr as usize },
        52usize,
        concat!(
        "Offset of field: ",
        stringify!(rkIVS_CHN_ATTR_S),
        "::",
        stringify!(u32MDSensibility)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bODEnable) as usize - ptr as usize },
        56usize,
        concat!(
        "Offset of field: ",
        stringify!(rkIVS_CHN_ATTR_S),
        "::",
        stringify!(bODEnable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32ODInterval) as usize - ptr as usize },
        60usize,
        concat!(
        "Offset of field: ",
        stringify!(rkIVS_CHN_ATTR_S),
        "::",
        stringify!(s32ODInterval)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32ODPercent) as usize - ptr as usize },
        64usize,
        concat!(
        "Offset of field: ",
        stringify!(rkIVS_CHN_ATTR_S),
        "::",
        stringify!(s32ODPercent)
        )
    );
}

impl Default for rkIVS_CHN_ATTR_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type IVS_CHN_ATTR_S = rkIVS_CHN_ATTR_S;

#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rkIVS_MD_ATTR_S {
    pub s32ThreshSad: RK_S32,
    pub s32ThreshMove: RK_S32,
}

#[test]
fn bindgen_test_layout_rkIVS_MD_ATTR_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkIVS_MD_ATTR_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkIVS_MD_ATTR_S>(),
        8usize,
        concat!("Size of: ", stringify!(rkIVS_MD_ATTR_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkIVS_MD_ATTR_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkIVS_MD_ATTR_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32ThreshSad) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkIVS_MD_ATTR_S),
        "::",
        stringify!(s32ThreshSad)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32ThreshMove) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkIVS_MD_ATTR_S),
        "::",
        stringify!(s32ThreshMove)
        )
    );
}

pub type IVS_MD_ATTR_S = rkIVS_MD_ATTR_S;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkIVS_MD_INFO_S {
    pub frameId: RK_U32,
    pub u32RectNum: RK_U32,
    pub stRect: [RECT_S; 4096usize],
    pub pData: *mut RK_CHAR,
    pub u32Size: RK_U32,
    pub s32Fd: RK_S32,
}

#[test]
fn bindgen_test_layout_rkIVS_MD_INFO_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkIVS_MD_INFO_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkIVS_MD_INFO_S>(),
        65556usize,
        concat!("Size of: ", stringify!(rkIVS_MD_INFO_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkIVS_MD_INFO_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkIVS_MD_INFO_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frameId) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkIVS_MD_INFO_S),
        "::",
        stringify!(frameId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32RectNum) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkIVS_MD_INFO_S),
        "::",
        stringify!(u32RectNum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stRect) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkIVS_MD_INFO_S),
        "::",
        stringify!(stRect)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pData) as usize - ptr as usize },
        65544usize,
        concat!(
        "Offset of field: ",
        stringify!(rkIVS_MD_INFO_S),
        "::",
        stringify!(pData)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32Size) as usize - ptr as usize },
        65548usize,
        concat!(
        "Offset of field: ",
        stringify!(rkIVS_MD_INFO_S),
        "::",
        stringify!(u32Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32Fd) as usize - ptr as usize },
        65552usize,
        concat!(
        "Offset of field: ",
        stringify!(rkIVS_MD_INFO_S),
        "::",
        stringify!(s32Fd)
        )
    );
}

impl Default for rkIVS_MD_INFO_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type IVS_MD_INFO_S = rkIVS_MD_INFO_S;

#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rkIVS_OD_INFO_S {
    pub frameId: RK_U32,
    pub u32Flag: RK_U32,
    pub u32PixSum: RK_U32,
}

#[test]
fn bindgen_test_layout_rkIVS_OD_INFO_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkIVS_OD_INFO_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkIVS_OD_INFO_S>(),
        12usize,
        concat!("Size of: ", stringify!(rkIVS_OD_INFO_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkIVS_OD_INFO_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkIVS_OD_INFO_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frameId) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkIVS_OD_INFO_S),
        "::",
        stringify!(frameId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32Flag) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkIVS_OD_INFO_S),
        "::",
        stringify!(u32Flag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32PixSum) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkIVS_OD_INFO_S),
        "::",
        stringify!(u32PixSum)
        )
    );
}

pub type IVS_OD_INFO_S = rkIVS_OD_INFO_S;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkIVS_RESULT_S {
    pub stMdInfo: IVS_MD_INFO_S,
    pub stOdInfo: IVS_OD_INFO_S,
}

#[test]
fn bindgen_test_layout_rkIVS_RESULT_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkIVS_RESULT_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkIVS_RESULT_S>(),
        65568usize,
        concat!("Size of: ", stringify!(rkIVS_RESULT_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkIVS_RESULT_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkIVS_RESULT_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stMdInfo) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkIVS_RESULT_S),
        "::",
        stringify!(stMdInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stOdInfo) as usize - ptr as usize },
        65556usize,
        concat!(
        "Offset of field: ",
        stringify!(rkIVS_RESULT_S),
        "::",
        stringify!(stOdInfo)
        )
    );
}

impl Default for rkIVS_RESULT_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type IVS_RESULT_S = rkIVS_RESULT_S;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rkIVS_RESULT_INFO_S {
    pub s32ResultNum: RK_S32,
    pub pstResults: *mut IVS_RESULT_S,
}

#[test]
fn bindgen_test_layout_rkIVS_RESULT_INFO_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkIVS_RESULT_INFO_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkIVS_RESULT_INFO_S>(),
        8usize,
        concat!("Size of: ", stringify!(rkIVS_RESULT_INFO_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkIVS_RESULT_INFO_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkIVS_RESULT_INFO_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32ResultNum) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkIVS_RESULT_INFO_S),
        "::",
        stringify!(s32ResultNum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pstResults) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkIVS_RESULT_INFO_S),
        "::",
        stringify!(pstResults)
        )
    );
}

impl Default for rkIVS_RESULT_INFO_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type IVS_RESULT_INFO_S = rkIVS_RESULT_INFO_S;

pub const rkVENC_RC_QUALITY_E_VENC_RC_QUALITY_HIGHEST: rkVENC_RC_QUALITY_E = 0;
pub const rkVENC_RC_QUALITY_E_VENC_RC_QUALITY_HIGHER: rkVENC_RC_QUALITY_E = 1;
pub const rkVENC_RC_QUALITY_E_VENC_RC_QUALITY_HIGH: rkVENC_RC_QUALITY_E = 2;
pub const rkVENC_RC_QUALITY_E_VENC_RC_QUALITY_MEDIUM: rkVENC_RC_QUALITY_E = 3;
pub const rkVENC_RC_QUALITY_E_VENC_RC_QUALITY_LOW: rkVENC_RC_QUALITY_E = 4;
pub const rkVENC_RC_QUALITY_E_VENC_RC_QUALITY_LOWER: rkVENC_RC_QUALITY_E = 5;
pub const rkVENC_RC_QUALITY_E_VENC_RC_QUALITY_LOWEST: rkVENC_RC_QUALITY_E = 6;
pub const rkVENC_RC_QUALITY_E_VENC_RC_QUALITY_BUTT: rkVENC_RC_QUALITY_E = 7;

pub type rkVENC_RC_QUALITY_E = ::std::os::raw::c_uint;

pub use self::rkVENC_RC_QUALITY_E as VENC_RC_QUALITY_E;

pub const rkVENC_RC_MODE_E_VENC_RC_MODE_H264CBR: rkVENC_RC_MODE_E = 1;
pub const rkVENC_RC_MODE_E_VENC_RC_MODE_H264VBR: rkVENC_RC_MODE_E = 2;
pub const rkVENC_RC_MODE_E_VENC_RC_MODE_H264AVBR: rkVENC_RC_MODE_E = 3;
pub const rkVENC_RC_MODE_E_VENC_RC_MODE_H264FIXQP: rkVENC_RC_MODE_E = 4;
pub const rkVENC_RC_MODE_E_VENC_RC_MODE_MJPEGCBR: rkVENC_RC_MODE_E = 5;
pub const rkVENC_RC_MODE_E_VENC_RC_MODE_MJPEGVBR: rkVENC_RC_MODE_E = 6;
pub const rkVENC_RC_MODE_E_VENC_RC_MODE_MJPEGFIXQP: rkVENC_RC_MODE_E = 7;
pub const rkVENC_RC_MODE_E_VENC_RC_MODE_H265CBR: rkVENC_RC_MODE_E = 8;
pub const rkVENC_RC_MODE_E_VENC_RC_MODE_H265VBR: rkVENC_RC_MODE_E = 9;
pub const rkVENC_RC_MODE_E_VENC_RC_MODE_H265AVBR: rkVENC_RC_MODE_E = 10;
pub const rkVENC_RC_MODE_E_VENC_RC_MODE_H265FIXQP: rkVENC_RC_MODE_E = 11;
pub const rkVENC_RC_MODE_E_VENC_RC_MODE_BUTT: rkVENC_RC_MODE_E = 12;

pub type rkVENC_RC_MODE_E = ::std::os::raw::c_uint;

pub use self::rkVENC_RC_MODE_E as VENC_RC_MODE_E;

pub const rkVENC_NALU_TYPE_E_VENC_NALU_BSLICE: rkVENC_NALU_TYPE_E = 1;
pub const rkVENC_NALU_TYPE_E_VENC_NALU_PSLICE: rkVENC_NALU_TYPE_E = 2;
pub const rkVENC_NALU_TYPE_E_VENC_NALU_ISLICE: rkVENC_NALU_TYPE_E = 3;
pub const rkVENC_NALU_TYPE_E_VENC_NALU_IDRSLICE: rkVENC_NALU_TYPE_E = 4;
pub const rkVENC_NALU_TYPE_E_VENC_NALU_SEI: rkVENC_NALU_TYPE_E = 5;
pub const rkVENC_NALU_TYPE_E_VENC_NALU_VPS: rkVENC_NALU_TYPE_E = 6;
pub const rkVENC_NALU_TYPE_E_VENC_NALU_SPS: rkVENC_NALU_TYPE_E = 7;
pub const rkVENC_NALU_TYPE_E_VENC_NALU_PPS: rkVENC_NALU_TYPE_E = 8;
pub const rkVENC_NALU_TYPE_E_VENC_NALU_BUTT: rkVENC_NALU_TYPE_E = 9;

pub type rkVENC_NALU_TYPE_E = ::std::os::raw::c_uint;

pub use self::rkVENC_NALU_TYPE_E as VENC_NALU_TYPE_E;

#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rkVENC_H264_CBR_S {
    pub u32Gop: RK_U32,
    pub u32SrcFrameRateNum: RK_U32,
    pub u32SrcFrameRateDen: RK_U32,
    pub fr32DstFrameRateNum: RK_U32,
    pub fr32DstFrameRateDen: RK_U32,
    pub u32BitRate: RK_U32,
    pub u32StatTime: RK_U32,
}

#[test]
fn bindgen_test_layout_rkVENC_H264_CBR_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkVENC_H264_CBR_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkVENC_H264_CBR_S>(),
        28usize,
        concat!("Size of: ", stringify!(rkVENC_H264_CBR_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkVENC_H264_CBR_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkVENC_H264_CBR_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32Gop) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_H264_CBR_S),
        "::",
        stringify!(u32Gop)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32SrcFrameRateNum) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_H264_CBR_S),
        "::",
        stringify!(u32SrcFrameRateNum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32SrcFrameRateDen) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_H264_CBR_S),
        "::",
        stringify!(u32SrcFrameRateDen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fr32DstFrameRateNum) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_H264_CBR_S),
        "::",
        stringify!(fr32DstFrameRateNum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fr32DstFrameRateDen) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_H264_CBR_S),
        "::",
        stringify!(fr32DstFrameRateDen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32BitRate) as usize - ptr as usize },
        20usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_H264_CBR_S),
        "::",
        stringify!(u32BitRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32StatTime) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_H264_CBR_S),
        "::",
        stringify!(u32StatTime)
        )
    );
}

pub type VENC_H264_CBR_S = rkVENC_H264_CBR_S;

#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rkVENC_H264_VBR_S {
    pub u32Gop: RK_U32,
    pub u32SrcFrameRateNum: RK_U32,
    pub u32SrcFrameRateDen: RK_U32,
    pub fr32DstFrameRateNum: RK_U32,
    pub fr32DstFrameRateDen: RK_U32,
    pub u32BitRate: RK_U32,
    pub u32MaxBitRate: RK_U32,
    pub u32MinBitRate: RK_U32,
    pub u32StatTime: RK_U32,
}

#[test]
fn bindgen_test_layout_rkVENC_H264_VBR_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkVENC_H264_VBR_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkVENC_H264_VBR_S>(),
        36usize,
        concat!("Size of: ", stringify!(rkVENC_H264_VBR_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkVENC_H264_VBR_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkVENC_H264_VBR_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32Gop) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_H264_VBR_S),
        "::",
        stringify!(u32Gop)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32SrcFrameRateNum) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_H264_VBR_S),
        "::",
        stringify!(u32SrcFrameRateNum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32SrcFrameRateDen) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_H264_VBR_S),
        "::",
        stringify!(u32SrcFrameRateDen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fr32DstFrameRateNum) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_H264_VBR_S),
        "::",
        stringify!(fr32DstFrameRateNum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fr32DstFrameRateDen) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_H264_VBR_S),
        "::",
        stringify!(fr32DstFrameRateDen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32BitRate) as usize - ptr as usize },
        20usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_H264_VBR_S),
        "::",
        stringify!(u32BitRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32MaxBitRate) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_H264_VBR_S),
        "::",
        stringify!(u32MaxBitRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32MinBitRate) as usize - ptr as usize },
        28usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_H264_VBR_S),
        "::",
        stringify!(u32MinBitRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32StatTime) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_H264_VBR_S),
        "::",
        stringify!(u32StatTime)
        )
    );
}

pub type VENC_H264_VBR_S = rkVENC_H264_VBR_S;

#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rkVENC_H264_AVBR_S {
    pub u32Gop: RK_U32,
    pub u32SrcFrameRateNum: RK_U32,
    pub u32SrcFrameRateDen: RK_U32,
    pub fr32DstFrameRateNum: RK_U32,
    pub fr32DstFrameRateDen: RK_U32,
    pub u32BitRate: RK_U32,
    pub u32MaxBitRate: RK_U32,
    pub u32MinBitRate: RK_U32,
    pub u32StatTime: RK_U32,
}

#[test]
fn bindgen_test_layout_rkVENC_H264_AVBR_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkVENC_H264_AVBR_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkVENC_H264_AVBR_S>(),
        36usize,
        concat!("Size of: ", stringify!(rkVENC_H264_AVBR_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkVENC_H264_AVBR_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkVENC_H264_AVBR_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32Gop) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_H264_AVBR_S),
        "::",
        stringify!(u32Gop)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32SrcFrameRateNum) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_H264_AVBR_S),
        "::",
        stringify!(u32SrcFrameRateNum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32SrcFrameRateDen) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_H264_AVBR_S),
        "::",
        stringify!(u32SrcFrameRateDen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fr32DstFrameRateNum) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_H264_AVBR_S),
        "::",
        stringify!(fr32DstFrameRateNum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fr32DstFrameRateDen) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_H264_AVBR_S),
        "::",
        stringify!(fr32DstFrameRateDen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32BitRate) as usize - ptr as usize },
        20usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_H264_AVBR_S),
        "::",
        stringify!(u32BitRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32MaxBitRate) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_H264_AVBR_S),
        "::",
        stringify!(u32MaxBitRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32MinBitRate) as usize - ptr as usize },
        28usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_H264_AVBR_S),
        "::",
        stringify!(u32MinBitRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32StatTime) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_H264_AVBR_S),
        "::",
        stringify!(u32StatTime)
        )
    );
}

pub type VENC_H264_AVBR_S = rkVENC_H264_AVBR_S;

#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rkVENC_H264_FIXQP_S {
    pub u32Gop: RK_U32,
    pub u32SrcFrameRateNum: RK_U32,
    pub u32SrcFrameRateDen: RK_U32,
    pub fr32DstFrameRateNum: RK_U32,
    pub fr32DstFrameRateDen: RK_U32,
    pub u32IQp: RK_U32,
    pub u32PQp: RK_U32,
    pub u32BQp: RK_U32,
}

#[test]
fn bindgen_test_layout_rkVENC_H264_FIXQP_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkVENC_H264_FIXQP_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkVENC_H264_FIXQP_S>(),
        32usize,
        concat!("Size of: ", stringify!(rkVENC_H264_FIXQP_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkVENC_H264_FIXQP_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkVENC_H264_FIXQP_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32Gop) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_H264_FIXQP_S),
        "::",
        stringify!(u32Gop)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32SrcFrameRateNum) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_H264_FIXQP_S),
        "::",
        stringify!(u32SrcFrameRateNum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32SrcFrameRateDen) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_H264_FIXQP_S),
        "::",
        stringify!(u32SrcFrameRateDen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fr32DstFrameRateNum) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_H264_FIXQP_S),
        "::",
        stringify!(fr32DstFrameRateNum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fr32DstFrameRateDen) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_H264_FIXQP_S),
        "::",
        stringify!(fr32DstFrameRateDen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32IQp) as usize - ptr as usize },
        20usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_H264_FIXQP_S),
        "::",
        stringify!(u32IQp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32PQp) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_H264_FIXQP_S),
        "::",
        stringify!(u32PQp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32BQp) as usize - ptr as usize },
        28usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_H264_FIXQP_S),
        "::",
        stringify!(u32BQp)
        )
    );
}

pub type VENC_H264_FIXQP_S = rkVENC_H264_FIXQP_S;

#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rkVENC_MJPEG_CBR_S {
    pub u32SrcFrameRateNum: RK_U32,
    pub u32SrcFrameRateDen: RK_U32,
    pub fr32DstFrameRateNum: RK_U32,
    pub fr32DstFrameRateDen: RK_U32,
    pub u32BitRate: RK_U32,
    pub u32StatTime: RK_U32,
}

#[test]
fn bindgen_test_layout_rkVENC_MJPEG_CBR_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkVENC_MJPEG_CBR_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkVENC_MJPEG_CBR_S>(),
        24usize,
        concat!("Size of: ", stringify!(rkVENC_MJPEG_CBR_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkVENC_MJPEG_CBR_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkVENC_MJPEG_CBR_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32SrcFrameRateNum) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_MJPEG_CBR_S),
        "::",
        stringify!(u32SrcFrameRateNum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32SrcFrameRateDen) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_MJPEG_CBR_S),
        "::",
        stringify!(u32SrcFrameRateDen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fr32DstFrameRateNum) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_MJPEG_CBR_S),
        "::",
        stringify!(fr32DstFrameRateNum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fr32DstFrameRateDen) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_MJPEG_CBR_S),
        "::",
        stringify!(fr32DstFrameRateDen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32BitRate) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_MJPEG_CBR_S),
        "::",
        stringify!(u32BitRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32StatTime) as usize - ptr as usize },
        20usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_MJPEG_CBR_S),
        "::",
        stringify!(u32StatTime)
        )
    );
}

pub type VENC_MJPEG_CBR_S = rkVENC_MJPEG_CBR_S;

#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rkVENC_MJPEG_VBR_S {
    pub u32SrcFrameRateNum: RK_U32,
    pub u32SrcFrameRateDen: RK_U32,
    pub fr32DstFrameRateNum: RK_U32,
    pub fr32DstFrameRateDen: RK_U32,
    pub u32BitRate: RK_U32,
    pub u32MaxBitRate: RK_U32,
    pub u32MinBitRate: RK_U32,
    pub u32StatTime: RK_U32,
}

#[test]
fn bindgen_test_layout_rkVENC_MJPEG_VBR_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkVENC_MJPEG_VBR_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkVENC_MJPEG_VBR_S>(),
        32usize,
        concat!("Size of: ", stringify!(rkVENC_MJPEG_VBR_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkVENC_MJPEG_VBR_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkVENC_MJPEG_VBR_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32SrcFrameRateNum) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_MJPEG_VBR_S),
        "::",
        stringify!(u32SrcFrameRateNum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32SrcFrameRateDen) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_MJPEG_VBR_S),
        "::",
        stringify!(u32SrcFrameRateDen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fr32DstFrameRateNum) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_MJPEG_VBR_S),
        "::",
        stringify!(fr32DstFrameRateNum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fr32DstFrameRateDen) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_MJPEG_VBR_S),
        "::",
        stringify!(fr32DstFrameRateDen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32BitRate) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_MJPEG_VBR_S),
        "::",
        stringify!(u32BitRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32MaxBitRate) as usize - ptr as usize },
        20usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_MJPEG_VBR_S),
        "::",
        stringify!(u32MaxBitRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32MinBitRate) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_MJPEG_VBR_S),
        "::",
        stringify!(u32MinBitRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32StatTime) as usize - ptr as usize },
        28usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_MJPEG_VBR_S),
        "::",
        stringify!(u32StatTime)
        )
    );
}

pub type VENC_MJPEG_VBR_S = rkVENC_MJPEG_VBR_S;

#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rkVENC_MJPEG_FIXQP_S {
    pub u32SrcFrameRateNum: RK_U32,
    pub u32SrcFrameRateDen: RK_U32,
    pub fr32DstFrameRateNum: RK_U32,
    pub fr32DstFrameRateDen: RK_U32,
    pub u32Qfactor: RK_U32,
}

#[test]
fn bindgen_test_layout_rkVENC_MJPEG_FIXQP_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkVENC_MJPEG_FIXQP_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkVENC_MJPEG_FIXQP_S>(),
        20usize,
        concat!("Size of: ", stringify!(rkVENC_MJPEG_FIXQP_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkVENC_MJPEG_FIXQP_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkVENC_MJPEG_FIXQP_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32SrcFrameRateNum) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_MJPEG_FIXQP_S),
        "::",
        stringify!(u32SrcFrameRateNum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32SrcFrameRateDen) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_MJPEG_FIXQP_S),
        "::",
        stringify!(u32SrcFrameRateDen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fr32DstFrameRateNum) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_MJPEG_FIXQP_S),
        "::",
        stringify!(fr32DstFrameRateNum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fr32DstFrameRateDen) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_MJPEG_FIXQP_S),
        "::",
        stringify!(fr32DstFrameRateDen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32Qfactor) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_MJPEG_FIXQP_S),
        "::",
        stringify!(u32Qfactor)
        )
    );
}

pub type VENC_MJPEG_FIXQP_S = rkVENC_MJPEG_FIXQP_S;
pub type VENC_H265_CBR_S = rkVENC_H264_CBR_S;
pub type VENC_H265_VBR_S = rkVENC_H264_VBR_S;
pub type VENC_H265_AVBR_S = rkVENC_H264_AVBR_S;
pub type VENC_H265_FIXQP_S = rkVENC_H264_FIXQP_S;

#[repr(C)]
#[derive(Copy, Clone)]
pub struct rkVENC_RC_ATTR_S {
    pub enRcMode: VENC_RC_MODE_E,
    pub __bindgen_anon_1: rkVENC_RC_ATTR_S__bindgen_ty_1,
}

#[repr(C)]
#[derive(Copy, Clone)]
pub union rkVENC_RC_ATTR_S__bindgen_ty_1 {
    pub stH264Cbr: VENC_H264_CBR_S,
    pub stH264Vbr: VENC_H264_VBR_S,
    pub stH264Avbr: VENC_H264_AVBR_S,
    pub stH264FixQp: VENC_H264_FIXQP_S,
    pub stMjpegCbr: VENC_MJPEG_CBR_S,
    pub stMjpegVbr: VENC_MJPEG_VBR_S,
    pub stMjpegFixQp: VENC_MJPEG_FIXQP_S,
    pub stH265Cbr: VENC_H265_CBR_S,
    pub stH265Vbr: VENC_H265_VBR_S,
    pub stH265Avbr: VENC_H265_AVBR_S,
    pub stH265FixQp: VENC_H265_FIXQP_S,
}

#[test]
fn bindgen_test_layout_rkVENC_RC_ATTR_S__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<rkVENC_RC_ATTR_S__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkVENC_RC_ATTR_S__bindgen_ty_1>(),
        36usize,
        concat!("Size of: ", stringify!(rkVENC_RC_ATTR_S__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<rkVENC_RC_ATTR_S__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(rkVENC_RC_ATTR_S__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stH264Cbr) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_RC_ATTR_S__bindgen_ty_1),
        "::",
        stringify!(stH264Cbr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stH264Vbr) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_RC_ATTR_S__bindgen_ty_1),
        "::",
        stringify!(stH264Vbr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stH264Avbr) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_RC_ATTR_S__bindgen_ty_1),
        "::",
        stringify!(stH264Avbr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stH264FixQp) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_RC_ATTR_S__bindgen_ty_1),
        "::",
        stringify!(stH264FixQp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stMjpegCbr) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_RC_ATTR_S__bindgen_ty_1),
        "::",
        stringify!(stMjpegCbr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stMjpegVbr) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_RC_ATTR_S__bindgen_ty_1),
        "::",
        stringify!(stMjpegVbr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stMjpegFixQp) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_RC_ATTR_S__bindgen_ty_1),
        "::",
        stringify!(stMjpegFixQp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stH265Cbr) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_RC_ATTR_S__bindgen_ty_1),
        "::",
        stringify!(stH265Cbr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stH265Vbr) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_RC_ATTR_S__bindgen_ty_1),
        "::",
        stringify!(stH265Vbr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stH265Avbr) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_RC_ATTR_S__bindgen_ty_1),
        "::",
        stringify!(stH265Avbr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stH265FixQp) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_RC_ATTR_S__bindgen_ty_1),
        "::",
        stringify!(stH265FixQp)
        )
    );
}

impl Default for rkVENC_RC_ATTR_S__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

#[test]
fn bindgen_test_layout_rkVENC_RC_ATTR_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkVENC_RC_ATTR_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkVENC_RC_ATTR_S>(),
        40usize,
        concat!("Size of: ", stringify!(rkVENC_RC_ATTR_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkVENC_RC_ATTR_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkVENC_RC_ATTR_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enRcMode) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_RC_ATTR_S),
        "::",
        stringify!(enRcMode)
        )
    );
}

impl Default for rkVENC_RC_ATTR_S {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}

pub type VENC_RC_ATTR_S = rkVENC_RC_ATTR_S;

#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rkVENC_PARAM_H264_S {
    pub u32StepQp: RK_U32,
    pub u32MaxQp: RK_U32,
    pub u32MinQp: RK_U32,
    pub u32MaxIQp: RK_U32,
    pub u32MinIQp: RK_U32,
    pub s32DeltIpQp: RK_S32,
    pub s32MaxReEncodeTimes: RK_S32,
    pub u32FrmMaxQp: RK_U32,
    pub u32FrmMinQp: RK_U32,
    pub u32FrmMaxIQp: RK_U32,
    pub u32FrmMinIQp: RK_U32,
}

#[test]
fn bindgen_test_layout_rkVENC_PARAM_H264_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkVENC_PARAM_H264_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkVENC_PARAM_H264_S>(),
        44usize,
        concat!("Size of: ", stringify!(rkVENC_PARAM_H264_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkVENC_PARAM_H264_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkVENC_PARAM_H264_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32StepQp) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_PARAM_H264_S),
        "::",
        stringify!(u32StepQp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32MaxQp) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_PARAM_H264_S),
        "::",
        stringify!(u32MaxQp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32MinQp) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_PARAM_H264_S),
        "::",
        stringify!(u32MinQp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32MaxIQp) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_PARAM_H264_S),
        "::",
        stringify!(u32MaxIQp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32MinIQp) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_PARAM_H264_S),
        "::",
        stringify!(u32MinIQp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32DeltIpQp) as usize - ptr as usize },
        20usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_PARAM_H264_S),
        "::",
        stringify!(s32DeltIpQp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32MaxReEncodeTimes) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_PARAM_H264_S),
        "::",
        stringify!(s32MaxReEncodeTimes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32FrmMaxQp) as usize - ptr as usize },
        28usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_PARAM_H264_S),
        "::",
        stringify!(u32FrmMaxQp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32FrmMinQp) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_PARAM_H264_S),
        "::",
        stringify!(u32FrmMinQp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32FrmMaxIQp) as usize - ptr as usize },
        36usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_PARAM_H264_S),
        "::",
        stringify!(u32FrmMaxIQp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32FrmMinIQp) as usize - ptr as usize },
        40usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_PARAM_H264_S),
        "::",
        stringify!(u32FrmMinIQp)
        )
    );
}

pub type VENC_PARAM_H264_S = rkVENC_PARAM_H264_S;

#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rkVENC_PARAM_H265_S {
    pub u32StepQp: RK_U32,
    pub u32MaxQp: RK_U32,
    pub u32MinQp: RK_U32,
    pub u32MaxIQp: RK_U32,
    pub u32MinIQp: RK_U32,
    pub s32DeltIpQp: RK_S32,
    pub s32MaxReEncodeTimes: RK_S32,
    pub u32FrmMaxQp: RK_U32,
    pub u32FrmMinQp: RK_U32,
    pub u32FrmMaxIQp: RK_U32,
    pub u32FrmMinIQp: RK_U32,
}

#[test]
fn bindgen_test_layout_rkVENC_PARAM_H265_S() {
    const UNINIT: ::std::mem::MaybeUninit<rkVENC_PARAM_H265_S> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rkVENC_PARAM_H265_S>(),
        44usize,
        concat!("Size of: ", stringify!(rkVENC_PARAM_H265_S))
    );
    assert_eq!(
        ::std::mem::align_of::<rkVENC_PARAM_H265_S>(),
        4usize,
        concat!("Alignment of ", stringify!(rkVENC_PARAM_H265_S))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32StepQp) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_PARAM_H265_S),
        "::",
        stringify!(u32StepQp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32MaxQp) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_PARAM_H265_S),
        "::",
        stringify!(u32MaxQp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32MinQp) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_PARAM_H265_S),
        "::",
        stringify!(u32MinQp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32MaxIQp) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_PARAM_H265_S),
        "::",
        stringify!(u32MaxIQp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32MinIQp) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_PARAM_H265_S),
        "::",
        stringify!(u32MinIQp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32DeltIpQp) as usize - ptr as usize },
        20usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_PARAM_H265_S),
        "::",
        stringify!(s32DeltIpQp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s32MaxReEncodeTimes) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_PARAM_H265_S),
        "::",
        stringify!(s32MaxReEncodeTimes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32FrmMaxQp) as usize - ptr as usize },
        28usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_PARAM_H265_S),
        "::",
        stringify!(u32FrmMaxQp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32FrmMinQp) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_PARAM_H265_S),
        "::",
        stringify!(u32FrmMinQp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32FrmMaxIQp) as usize - ptr as usize },
        36usize,
        concat!(
        "Offset of field: ",
        stringify!(rkVENC_PARAM_H265_S),
        "::",
        stringify!(u32FrmMaxIQp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32FrmMinIQp) as usize - ptr as usize },
        40usize,
        concat!(
        "Offset of field: ",
